<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>GettingStarted</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20060903;21101800">
	<META NAME="CHANGEDBY" CONTENT="le pimousse">
	<META NAME="CHANGED" CONTENT="20061201;21521600">
	<STYLE TYPE="text/css">
	<!--
		TD P { color: #000000 }
		P { color: #000000 }
	-->
	</STYLE>
</HEAD>
<BODY LANG="en-US" TEXT="#000000" BGCOLOR="#f8e89e" DIR="LTR">
<P ALIGN=LEFT STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="tahoma"><BR><STRONG><FONT SIZE=5><FONT COLOR="#3300cc">Prise
en Main</FONT></FONT></STRONG><BR>(Extrait du manuel &eacute;crit par
Julian MacDonald et traduit par Les Manuels d'Aide en Fran&ccedil;ais)<BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">1
<STRONG><FONT SIZE=4><FONT COLOR="#ff6633">Organisation de l'Ecran
Principal</FONT></FONT></STRONG></FONT></FONT></STRONG><BR><BR>L'illustration
ci-dessous montre la fen&ecirc;tre principale :<BR><BR><IMG SRC="images/main-screen.jpg" NAME="graphics3" ALIGN=BOTTOM WIDTH=764 HEIGHT=616 BORDER=0><BR><BR>Notez
qu'&agrave; partir de la version 1.8, Art of Illusion utilise une
Interface Utilisateur de type Java Swing. Ce qui signifie que le
'Look &amp; Feel' de l'interface est personnalisable jusqu'&agrave;
un certain point. Plusieurs Look &amp; Feels sont disponibles sur
Internet au t&eacute;l&eacute;chargement (ex.: <A HREF="http://www.javootoo.com/" TARGET="_blank">www.javootoo.com</A>).
Pour en param&eacute;trer un de fa&ccedil;on &agrave; le faire
fonctionner avec AoI, vous devez cr&eacute;er un simple Startup
Script de D&eacute;marrage (cliquez <A HREF="../../../../../Desktop/AoI%20Manual/scripting.html#startup_scripts">ici</A>
pour en savoir plus).</FONT></FONT></P>
<P ALIGN=LEFT STYLE="margin-bottom: 0cm"><A NAME="panels1"></A><FONT SIZE=2><FONT FACE="tahoma">La
fen&ecirc;tre principale est divis&eacute;e en plusieurs zones: les 4
<A HREF="#view_windows">fen&ecirc;tres de vues</A> interactives, la
<A HREF="#object_list">Liste des Objets et le panneau de Propri&eacute;t&eacute;s
d'un Objet</A>, et enfin les <A HREF="#icons">Ic&ocirc;nes des
Outils</A>, chacun d'entre eux &eacute;tant d&eacute;crits en d&eacute;tails
ci-dessous. &nbsp;Le score de l'animation peut aussi &ecirc;tre
affich&eacute; - voir la section <A HREF="../../../../../Desktop/AoI%20Manual/animation.html">animation</A>
pour en savoir plus. &nbsp;Les paneaux lat&eacute;raux sont
ancrables, de sorte que l'affichage peut &ecirc;tre configur&eacute;
&agrave; souhait - il vous suffit de faire glisser la Liste des
Objets, le Panneau Propri&eacute;t&eacute;s et le Score vers le haut,
le bas ou les c&ocirc;t&eacute;s de l'affichage.<BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">2
</FONT></FONT><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">Fen&ecirc;tres
d'Affichage</FONT></FONT></STRONG></STRONG><BR><BR>Les 4 fen&ecirc;tres
vierges affichent diff&eacute;rentes vues de la sc&egrave;ne. Par
d&eacute;faut, les deux fen&ecirc;tres sup&eacute;rieures et la
fen&ecirc;tre inf&eacute;rieur gauche affichent des vues parall&egrave;les
ou orthogonales respectivement de face, de c&ocirc;t&eacute; et du
haut, et la fen&ecirc;tre inf&eacute;rieure droite affiche une
perspective &agrave; partir de l'appareil photo actuellement
s&eacute;lectionn&eacute;. Ces vues peuvent &ecirc;tre facilement
modifi&eacute;es &agrave; l'aide du menu d&eacute;roulant en haut de
chacune des fen&ecirc;tres d'affichage.<BR><BR>Le fen&ecirc;tre qui
poss&egrave;de le 'focus', ou fen&ecirc;tre s&eacute;lectionn&eacute;e,
est celle qui pr&eacute;sente le contour le plus &eacute;pais (la
fen&ecirc;tre sup&eacute;rieure gauche dans l'exemple de
l'illustration ci-dessus). Ce qui est pertinent pour que les
op&eacute;rations fonctionnent sur une seule fen&ecirc;tre
d'affichage. Pour changer de fen&ecirc;tre s&eacute;lectionn&eacute;e,
d&eacute;placez simplement le curseur au-dessus de celle-ci et
cliquez. <BR>Toutes les fen&ecirc;tres d'affichage peuvent passer en
mode panoramique, zoom et pivoter &agrave; l'aide des contr&ocirc;les
de l'appareil photo: 
<IMG SRC="images/camera_buttons.jpg" NAME="Image4" ALIGN=BOTTOM WIDTH=53 HEIGHT=28 BORDER=0>
ou en utilisant des raccourcis clavier:<BR><BR><BR></FONT><B><FONT FACE="TAhoma, sans-serif"><FONT COLOR="#3333ff">Contr&ocirc;le
Point de Vue:</FONT></FONT></B></FONT></P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>Faites
	un clic gauche sur 
	<IMG SRC="images/camera_pan.jpg" NAME="Image1" ALIGN=BOTTOM WIDTH=26 HEIGHT=28 BORDER=0>
	et d&eacute;placez le pointeur dans une fen&ecirc;tre de vue tout en
	maintenant le bouton gauche de la souris enfonc&eacute;. </FONT></FONT>
	</P>
</UL>
<UL>
	<LI><P><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>Maintenez le
	bouton droit de la souris enfonc&eacute; et d&eacute;placez le
	pointeur dans une fen&ecirc;tre de vue. </FONT></FONT>
	</P>
</UL>
<P><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2><BR><B><FONT COLOR="#3333ff">Zoom
et Grandissement:</FONT></B></FONT></FONT></P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>S&eacute;lectionnez
	le mode Point de Vue en cliquant sur 
	<IMG SRC="images/camera_pan.jpg" NAME="Image6" ALIGN=BOTTOM WIDTH=26 HEIGHT=27 BORDER=0>
	et maintenez CTRL enfonc&eacute;e tout en effectuant un clic droit
	et en d&eacute;pla&ccedil;ant le pointeur vers le haut (zoom
	arri&egrave;re) ou le bas (zoom avant) ou </FONT></FONT>
	</P>
</UL>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><A NAME="scrollWheel"></A><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>Utilisez
	la molette de d&eacute;filement - d&eacute;filement bas pour un zoom
	avant et d&eacute;filement haut pour un zoom arri&egrave;re.
	Maintenir enfonc&eacute;e la touche ALT acc&eacute;l&eacute;rera le
	zoom avant ou arri&egrave;re en utilisant la molette de d&eacute;filement.
	</FONT></FONT>
	</P>
</UL>
<UL>
	<LI><P><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>L'agrandissement
	des vues en parall&egrave;le peut aussi s'effectuer en entrant un
	niveau d'agrandissement appropri&eacute; &agrave; partir du menu
	d&eacute;roulant en haut de chaque fen&ecirc;tre de vue. </FONT></FONT>
	</P>
</UL>
<P><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2><BR><B><FONT COLOR="#3333ff">Contr&ocirc;les
de Rotation:</FONT></B></FONT></FONT></P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>La
	Rotation de chaque fen&ecirc;tre d'affichage est obtenue en cliquant
	sur 
	<IMG SRC="images/camera_rotate.jpg" NAME="Image7" ALIGN=BOTTOM WIDTH=26 HEIGHT=26 BORDER=0>
	et en d&eacute;pla&ccedil;ant le curseur dans la fen&ecirc;tre
	concern&eacute;e tout en maintenant enfonc&eacute;e le bouton gauche
	de la souris. Maintenir enfonc&eacute;e la touche Maj tout en
	d&eacute;pla&ccedil;ant le curseur entra&icirc;ne une rotation
	autour de l'axe vertical, et maintenir enfonc&eacute;e la touche
	Ctrl fait pivoter la vue selon un axe perpendiculaire &agrave;
	l'&eacute;cran. </FONT></FONT>
	</P>
</UL>
<UL>
	<LI><P><FONT FACE="TAhoma, sans-serif"><FONT SIZE=2>Vous pouvez
	aussi obtenir une rotation en maintenant enfonc&eacute;e la touche
	&lt;Alt&gt; tout en d&eacute;pla&ccedil;ant la souris. Les touches
	Maj et Ctrl fonctionnent aussi avec cette m&eacute;thode. <BR><BR>Si
	des objets sont s&eacute;lectionn&eacute;s, le centre de rotation se
	trouvera au centre cette s&eacute;lection.<BR><BR>Faire pivoter une
	des fen&ecirc;tres d'affichage fixe (c'est-&agrave;-dire une face,
	un c&ocirc;t&eacute; ou un haut) signifie que cet affichage ne
	montre plus une vue fixe et change ainsi son nom pour 'other'.
	S&eacute;lectionner le nom de la vue appropri&eacute;e &agrave;
	partir de la liste d&eacute;roulante restaurera la vue par d&eacute;faut.
	</FONT></FONT>
	</P>
</UL>
<P ALIGN=LEFT STYLE="margin-bottom: 0cm"><A NAME="framing"></A><FONT FACE="tahoma"><FONT SIZE=2>S'il
existe plus d'un appareil photo dans la sc&egrave;ne, il est possible
de voir l'affichage &agrave; partir de chacun d'entre eux le
s&eacute;lectionnant dans la liste d&eacute;roulante.<BR><BR>Si vous
trouvez qu'il est plus facile de travailler avec une grande fen&ecirc;tre,
choisissez <B>Sc&egrave;ne -&gt; Maximiser la Vue</B> &agrave; partir
de la barre de menu sup&eacute;rieure et la fen&ecirc;tre
actuellement s&eacute;lectionn&eacute;e remplira l'espace de
travail.<BR><BR>Une autre chose que vous devez savoir est
l'orientation du syst&egrave;me de coordonn&eacute;es utilis&eacute;,
car elle varie selon les programmes 3D. Art of Illusion utilise le
syst&egrave;me de coordonn&eacute;es &agrave; droite - les valeurs
positives de l'axe des x pointent &agrave; droite et les valeurs
positives de l'axe des y pointent en haut, les valeurs positives de
l'axe des z pointent en dehors de l'&eacute;cran. Si vous faites face
au devant de la sc&egrave;ne, l'axe des y se dirige en haut et en
bas, l'axe des x de gauche &agrave; droite, et l'axe des z d'avant en
arri&egrave;re. Les axes des vues par d&eacute;faut sont les
suivants:<BR><IMG SRC="images/orientations.jpg" NAME="graphics8" ALIGN=BOTTOM WIDTH=708 HEIGHT=544 BORDER=0>
<BR>Il est parfois utile de visualiser rapidement l'ensemble de la
sc&egrave;ne ou un objet s&eacute;lectionn&eacute; dans la fen&ecirc;tre
d'affichage. Vous pouvez y parvenir via <B>Sc&egrave;ne -&gt; Ajuster
sur la s&eacute;lection</B>, ce qui r&egrave;gle le zoom et effectue
un centrage des fen&ecirc;tres sans appareil photo de fa&ccedil;on &agrave;
ce que les objets s&eacute;lectionn&eacute;s s'ajustent &agrave;
leurs limites, et <B>Sc&egrave;ne -&gt; Englober la Sc&egrave;ne
Enti&egrave;re</B> qui ajustera la totalit&eacute; de la sc&egrave;ne
aux limites des fen&ecirc;tres.<BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">3
Mode d'Affichage</FONT></FONT></STRONG><BR><BR>Vous disposez de 5
moyens possibles pour afficher la sc&egrave;ne en temps r&eacute;el:
Aper&ccedil;u <B>Fil de Fer</B>, aper&ccedil;u <B>Ombr&eacute;</B>,
aper&ccedil;u <B>Liss&eacute;,</B> aper&ccedil;u <B>Textur&eacute;</B>
et per&ccedil;u <B>Transparent</B>. Le type d'aper&ccedil;u est
s&eacute;lectionn&eacute; &agrave; partir de la barre de menu
sup&eacute;rieure <B>Sc&egrave;ne -&gt; Mode d'Affichage -&gt; Fil de
Fer/Ombr&eacute;/Liss&eacute;/Textur&eacute;/Transparent</B> et
affectent les fen&ecirc;tres d'affichage poss&eacute;dant le 'focus'.
Les diff&eacute;rences entre ces affichages sont illustr&eacute;es
ci-dessous: <BR><BR><IMG SRC="images/previews.jpg" NAME="graphics9" ALIGN=BOTTOM WIDTH=800 HEIGHT=600 BORDER=0>
<BR><BR>Le choix du mode d'aper&ccedil;u affecte la performance des
mouvements de l'appareil photo en temps r&eacute;el, avec une vitesse
d&eacute;croissante dans l'ordre Fil de Fer -&gt; Ombr&eacute; -&gt;
Liss&eacute; -&gt; Textur&eacute;. En fonction de utilis&eacute;,
ceci se remarquera davantage pour les sc&egrave;nes complexes. Le
type d'aper&ccedil;u est r&eacute;glable de fa&ccedil;on ind&eacute;pendante
pour chacune des fen&ecirc;tres d'affichage.<BR><BR>Notez que les
aper&ccedil;us Ombr&eacute; et Liss&eacute; affichent des couleurs
conformes, bien que de fa&ccedil;on simplifi&eacute;e, aux textures
attribu&eacute;es &agrave; chaque objet. L'aper&ccedil;u Textur&eacute;
donne une repr&eacute;sentation plus proche des textures en cours.
<BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">4 Ic&ocirc;nes</FONT></FONT></STRONG><BR><BR>En
haut &agrave; gauche de l'&eacute;cran se trouvent les ic&ocirc;nes
vous permettant de choisir rapidement les outils courants. Ils vous
permettent de cr&eacute;er et de d&eacute;placer de nouveaux objets,
de faire pivoter et ajuster des objets existant. Si vous faites
passer le curseur au-dessus des ic&ocirc;nes, une info-bulle
s'affichera pour d&eacute;crire leur fonction.</FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD WIDTH=400>
			<P><FONT FACE="tahoma"><FONT SIZE=2>Cette illustration d&eacute;crit
			bri&egrave;vement chaque ic&ocirc;ne. Les outils eux m&ecirc;me
			sont d&eacute;taill&eacute;s dans les sections correspondantes de
			ce manuel.</FONT></FONT></P>
		</TD>
		<TD>
			<P><IMG SRC="images/modelling_icons.jpg" NAME="graphics10" ALIGN=BOTTOM WIDTH=382 HEIGHT=179 BORDER=0></P>
		</TD>
	</TR>
</TABLE>
<P><A NAME="icons1"></A><A NAME="main_space"></A><A NAME="object_list"></A><A NAME="main_space1"></A>
<FONT SIZE=2><FONT FACE="tahoma"><BR>Avec chaque outil s&eacute;lectionn&eacute;,
une ligne de texte appara&icirc;t en bas de l'&eacute;cran pour
d&eacute;crire bri&egrave;vement sa fonction.<BR><BR>Avec les outils
D&eacute;placer et Pivoter, les objets peuvent &ecirc;tre d&eacute;plac&eacute;s
d'un pixel &agrave; la fois &agrave; l'aide des touches de direction
du clavier, et de 10 pixels &agrave; la fois en utilisant la touches
Alt avec les touches de direction.<BR><BR>Vous pouvez utiliser la
Barre Espace pour basculer rapidement entre les outils; un appui
dessus changera la s&eacute;lection entre l'outil
D&eacute;placer/S&eacute;lectionner et le dernier outil utilis&eacute;.<BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">5
<STRONG><FONT SIZE=4><FONT COLOR="#ff6633">Liste des Objets et
Panneau de Propri&eacute;t&eacute;s</FONT></FONT></STRONG></FONT></FONT></STRONG><BR><BR>A
droite de la fen&ecirc;tre principale se trouve la liste des objets
(en haut par d&eacute;faut). </FONT></FONT>
</P>
<P><FONT FACE="tahoma"><FONT SIZE=2>Sans surprise, il s'agit de la
liste de tous les objets inclus dans la sc&egrave;ne, y compris les
appareils photo et les &eacute;clairages. Les objets peuvent &ecirc;tre
s&eacute;lectionn&eacute;s &agrave; partir de cette liste pour
&eacute;dition, simplement en cliquant dessus. Pour s&eacute;lectionner
plusieurs objets, maintenez enfonc&eacute;e la touche Ctrl tout en
cliquant, ou, pour s&eacute;lectionner une plage, cliquez sur un
objet et maintenez la touche Maj enfonc&eacute;e tout en cliquant sur
un autre objet de fa&ccedil;on &agrave; s&eacute;lectionner tous ceux
qui se trouvent entre les deux.<BR><BR>Certains types d'objets (ex.:
courbes, splines et filets) autorisent d'autres types d'&eacute;dition
que les d&eacute;placements, ajustement et pivotements standards. Un
double-clic sur un objet de la Liste des Objets affiche l'outil
d'&eacute;dition pertinent.<BR><BR>Cette liste permet aussi
d'organiser les objets hierarchiquement, un certain nombre d'objets
pouvant &ecirc;tre class&eacute;s comme 'enfants' d'autres objets.
D&eacute;placer, Ajuster et Pivoter les objets 'parents' produira
aussi des transformations pour les les objets 'enfants' en fonction
du r&eacute;glage de l'outil. Un objet peut &ecirc;tre r&eacute;gl&eacute;
comme l'enfant d'un autre en cliquant dessus et en le d&eacute;pla&ccedil;ant
en-dessous du pr&eacute;tendu parent. Une barre fl&eacute;ch&eacute;e
indique la position de l'objet dans la liste. Un retrait de cette
barre indique que l'objet peut devenir un enfant de l'objet qui le
pr&eacute;c&egrave;de dans la liste. Le rel&acirc;chement du bouton
de la souris d&eacute;clenche ceci et l'objet parent se voit alors
attribuer une fl&egrave;che descendante pour indiquer cette
hi&eacute;rarchie. Cliquer sur cette fl&egrave;che cache l'objet
enfant et la fl&egrave;che se modifie pour pointer &agrave;
droite.<BR><BR>Organiser une hi&eacute;rarchie parent-enfant entre
les objets peut s'av&eacute;rer &eacute;galement utile au cours d'une
animation.</FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/object_list.jpg" NAME="graphics11" ALIGN=BOTTOM WIDTH=120 HEIGHT=173 BORDER=0></P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=2>Dans l'illustration de gauche,
			la hi&eacute;rarchie des objets pour la sc&egrave;ne d'un tube
			dentifrice est d&eacute;finie. Dans ce cas, 'toothpaste' et 'lid'
			sont les enfants de 'toothpaste tube' et 'lid end' est l'enfant de
			'lid'. Les Transformations effectu&eacute;es sur 'toothpaste tube'
			peuvent &ecirc;tre d&eacute;finies de fa&ccedil;on &agrave;
			affecter tous les objets mentionn&eacute;s, alors que celles
			appliqu&eacute;es &agrave; 'lid' ne peuvent affecter que 'lid' et
			'lid end'.<BR><BR>Si n&eacute;cessaire, la Liste des Objets peut
			&ecirc;tre cach&eacute;e en s&eacute;lectionnant <B>Sc&egrave;ne
			-&gt; Cacher la Liste des Objets</B>.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P><A NAME="properties"></A><FONT SIZE=2><FONT FACE="tahoma"><BR><BR><FONT SIZE=2><FONT FACE="tahoma">Un
clic droit sur un objet de la Liste des Objets affiche un menu des
op&eacute;rations disponibles pour cet objet, incluant diff&eacute;rents
<A HREF="../../../../../Desktop/AoI%20Manual/editing_objects.html">outils
d'&eacute;dition</A>, l'application de <A HREF="../../../../../Desktop/AoI%20Manual/textures_and_materials.html">textures
et mat&eacute;riaux</A> et la possibilit&eacute; de <A HREF="../../../../../Desktop/AoI%20Manual/layout.html#hiding_objects">cacher/afficher</A>
l'objet. &nbsp;Les options sont &eacute;galement disponibles via un
menu contextuel que l'on affiche &agrave; l'aide d'un clic droit
directement sur un objet dans les fen&ecirc;tres de vues. <BR><BR>Le
panneau Propri&eacute;t&eacute;s de l'Objet affiche diff&eacute;rentes
propri&eacute;t&eacute;s &eacute;ditables pour les objets
actuellement s&eacute;lectionn&eacute;s, comme dans l'exemple
ci-dessous.</FONT></FONT></FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/obj_prop_panel.jpg" NAME="graphics12" ALIGN=BOTTOM WIDTH=166 HEIGHT=368 BORDER=0></P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=2>Les propri&eacute;t&eacute;s
			qui apparaissent dans ce panneau d&eacute;pendent du type
			d'objet(s) s&eacute;lectionn&eacute;(s). Dans cet exemple, les
			propri&eacute;t&eacute;s de la sph&egrave;re sont affich&eacute;es
			et &eacute;ditables.<BR><BR>Les valeurs Position et Orientation
			peuvent &ecirc;tre entr&eacute;es directement, la texture et le
			mat&eacute;riau peuvent &ecirc;tre d&eacute;finis.<BR><BR>Les
			rayons X, Y et Z de l'objet peuvent aussi &ecirc;tre d&eacute;finis
			directement dans les champs ad&eacute;quats ou via les curseurs de
			contr&ocirc;le &agrave; leur droite. &nbsp;Pour y parvenir,
			d&eacute;placez le curseur dans un sens horaire ou anti-horaire
			autour de son axe en maintenant enfonc&eacute; le bouton gauche de
			la souris. &nbsp;Pour effectuer des modifications importantes des
			valeurs, vous pouvez maintenir la touche ALT enfonc&eacute;e lors
			du d&eacute;placement des curseurs.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P><A NAME="hiding_objects"></A><A NAME="grids"></A><A NAME="hiding_objects11"></A><A NAME="hiding_objects1"></A>
<FONT SIZE=2><FONT FACE="tahoma"><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">6
Cacher/Montrer des Objets</FONT></FONT></STRONG><BR><BR>Il est
parfois utile de pouvoir cacher des objets de l'affichage, comme par
exemple dans une sc&egrave;ne compliqu&eacute;e o&ugrave; certains
objets chevauchent ceux que vous souhaitez travailler. Pour cacher
ces objets, s&eacute;lectionnez-les et cliquez sur <B>Objet -&gt;
Cacher la S&eacute;lection</B>. <FONT SIZE=2><FONT FACE="tahoma">Vous
pouvez aussi effectuer un clic droit sur une s&eacute;lection de la
Liste des Objets ou sur l'objet lui-m&ecirc;me dans l'une des
fen&ecirc;tres de vues et choisir <B>Cacher la S&eacute;lection</B>.
</FONT></FONT>Ce qui les cachera &eacute;galement dans la
pr&eacute;sentation de l'image, ce qui est utile si vous souhaitez
tester la pr&eacute;sentation de certains objets. Les objets cach&eacute;s
sont affich&eacute;s en gris dans la Liste des Objets.<BR><BR>Pour
afficher &agrave; nouveau les objets, s&eacute;lectionnez-les et
cliquez sur <B>Objet -&gt; Afficher la S&eacute;lection</B>, <FONT SIZE=2><FONT FACE="tahoma">ou
faites un clic droit sur le ou les objets de la Liste des Objets ou
dans une des fen&ecirc;tres de vues et choisissez <B>Afficher le
S&eacute;lection</B>.</FONT></FONT><BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">7
Grilles</FONT></FONT></STRONG><BR><BR>Il est souvent utile de pouvoir
positionner les objets avec pr&eacute;cision et basculer sur le mode
Grille vous y aidera. La grille est activ&eacute;e via <B>Sc&egrave;ne
-&gt; Grilles</B>, ce qui affiche la bo&icirc;te de dialogue
suivante:</FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/grid_box.jpg" NAME="graphics13" ALIGN=BOTTOM WIDTH=606 HEIGHT=278 BORDER=0></P>
		</TD>
		<TD WIDTH=250>
			<P><FONT FACE="tahoma"><FONT SIZE=2>L'Espacement de la Grille
			d&eacute;termine les espaces entre les lignes de la grille qui
			appara&icirc;t dans chaque fen&ecirc;tre d'affichage. En fait,
			pour voir la grille, vous devez activer l'option <B>Montrer la
			Grille</B>. Il est &eacute;galement possible d'activer <B>Coller &agrave;
			la Grille</B> qui oblige les objets &agrave; se placer des
			endroits distincts plut&ocirc;t que de permettre une totale
			libert&eacute; de mouvement. Activez <B>Coller &agrave; la Grille</B>
			et entrez le nombre pertinent pour <B>Coller aux Subdivisions</B>.
			Il s'agit du nombre des positions uniform&eacute;ment distribu&eacute;es
			disponibles &agrave; l'int&eacute;rieur de chaque carr&eacute; de
			la grille. Ainsi, plus ce nombre est &eacute;lev&eacute;, plus il
			y a de libert&eacute; de mouvement. Dans cet exemple, les objets
			seront aimant&eacute;s tous les 1/10 de l'espace grille si la case
			<B>Coller &agrave; la Grille</B> est coch&eacute;e.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P STYLE="margin-bottom: 0cm"><A NAME="grids1"></A><A NAME="coordaxes"></A><A NAME="file_menu"></A><A NAME="coordaxes1"></A><A NAME="file menu"></A>
<FONT SIZE=2><FONT FACE="tahoma"><BR><BR>asculer sur la grille
affichera celle-ci dans toutes les fen&ecirc;tres d'affichage. De
plus, les vues en perspective afficheront un plan au sol.<BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">2.2.8
Axes des Coordonn&eacute;es</FONT></FONT></STRONG><BR><BR>Lorsque
vous parcourez une sc&egrave;ne, il est parfois possible de perdre le
sens de l'orientation. Pour vous aider dans une telle situation, vous
pouvez activer les Axes de Coordonn&eacute;es via <B>Sc&egrave;ne -&gt;
Afficher les Axes de Coordonn&eacute;es</B>. Ce qui affichera trois
lignes nomm&eacute;es x,y et z et repr&eacute;sentant les axes
ci-dessous:<BR><BR><IMG SRC="images/coord_axes.jpg" NAME="graphics14" ALIGN=BOTTOM WIDTH=345 HEIGHT=282 BORDER=0><BR><BR>Si
vous le souhaitez, les axes de coordonn&eacute;es peuvent &ecirc;tre
d&eacute;sactiv&eacute;s via <B>Sc&egrave;ne -&gt; Cacher les Axes de
Coordonn&eacute;es</B>.<BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">2.2.9
Menu Fichier</FONT></FONT></STRONG> <BR><BR>L'&eacute;l&eacute;ment
le plus &agrave; gauche de la barre de menus, <B>Fichier</B>, permet
d'effectuer diff&eacute;rentes op&eacute;rations sur les fichiers.
Cliquer sur ce menu affichera les &eacute;l&eacute;ments ci-dessous:</FONT></FONT></P>
<TABLE WIDTH=884 BORDER=0 CELLPADDING=2 CELLSPACING=0>
	<COL WIDTH=199>
	<COL WIDTH=677>
	<TR>
		<TD WIDTH=199>
			<P><IMG SRC="images/file_menu.jpg" NAME="graphics15" ALIGN=BOTTOM WIDTH=196 HEIGHT=188 BORDER=0></P>
		</TD>
		<TD WIDTH=677>
			<P><A NAME="Import"></A><FONT SIZE=2><FONT FACE="tahoma"><B>Nouveau</B>
			ouvre une nouvelle instance de Art of Illusion pour cr&eacute;er
			une nouvelle sc&egrave;ne. Cette sc&egrave;ne vierge contient, par
			d&eacute;faut, un appareil photo et un <A HREF="../../../../../Desktop/AoI%20Manual/lights.html#directional">&eacute;clairage
			directionnel</A>.<BR><BR><B>Ouvrir</B> affiche un fichier de sc&egrave;ne
			Art of Illusion existant dans une instance distincte de
			AoI.<BR><BR><B>R&eacute;cemment Ouverts</B> affiche la liste des
			10 derni&egrave;res sc&egrave;nes qui ont &eacute;t&eacute;
			ouvertes et vous permet d'en choisir une.<BR><BR><B>Fermer</B>
			referme le fichier sc&egrave;ne en cours. S'il s'agit de la seule
			instance ouverte de AoI, le programme sera compl&egrave;tement
			ferm&eacute;.<BR><BR><B>Importer</B> permet aux formats de mod&egrave;les
			3D, autres que AoI, d'&ecirc;tre ouverts. Le seul format de
			fichier pris en charge est wavefront .OBJ et l'importation tol&egrave;re
			aussi l'importation des mat&eacute;riaux OBJ. S&eacute;lectionnez
			simplement le fichier OBJ lorsque vous y &ecirc;tes invit&eacute;
			et le fichier sera lu et converti automatiquement en texture AoI.
			Le mod&egrave;le sera ajust&eacute; automatiquement lors de
			l'importation pour mieux s'adapter &agrave; l'&eacute;chelle
			d'unit&eacute;s de AoI.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P STYLE="margin-bottom: 0cm"><FONT FACE="tahoma"><FONT SIZE=2><BR><BR><B>Exporter</B>
permet &agrave; AoI d'enregistrer des mod&egrave;les/sc&egrave;nes 3D
en formats 3D autres que AoI. L'Exportation peut se faire en fichiers
Wavefront OBJ, VRML ou Povray v3.5, avec prises en charge partielle
des textures. Vous pouvez choisir d'exporter toute la sc&egrave;ne ou
simplement l'objet s&eacute;lectionn&eacute; et sp&eacute;cifier une
erreur de surface maximum dans la bo&icirc;te de dialogue ci-dessous.
Une valeur inf&eacute;rieure pour l'erreur entra&icirc;nera un
r&eacute;sultat plus complexe, et ainsi, un fichier d'exportation
plus volumineux. <BR><BR>Les textures 2 D export&eacute;es OBJ et
VRML sont enregistr&eacute;es sous la forme d'images interactives
dont la taille et la qualit&eacute; sont sp&eacute;cifi&eacute;es
dans les bo&icirc;tes de dialogues appropri&eacute;es.<BR><BR>D'autres
options sont disponibles pour les VRML et Povray comme indiqu&eacute;
dans les bo&icirc;tes de dialogue ci-dessous:</FONT></FONT></P>
<TABLE WIDTH=400 CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/vrml_export.jpg" NAME="graphics16" ALIGN=BOTTOM WIDTH=190 HEIGHT=215 BORDER=0></P>
		</TD>
		<TD>
			<P><IMG SRC="images/obj_export.jpg" NAME="graphics17" ALIGN=BOTTOM WIDTH=175 HEIGHT=170 BORDER=0></P>
		</TD>
		<TD>
			<P><IMG SRC="images/povray_export.jpg" NAME="graphics18" ALIGN=BOTTOM WIDTH=266 HEIGHT=217 BORDER=0></P>
		</TD>
	</TR>
	<TR>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=1>VRML export option dialogue </FONT></FONT>
			</P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=1>OBJ export option dialogue </FONT></FONT>
			</P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=1>Povray export option dialogue </FONT></FONT>
			</P>
		</TD>
	</TR>
</TABLE>
<P><FONT SIZE=2><FONT FACE="tahoma"><BR><BR><B>Lier &agrave; un
Fichier Externe</B> repr&eacute;sente le moyen d'utiliser un objet &agrave;
partir d'un autre fichier AoI dans la sc&egrave;ne en cours via un
lien dynamique pointant sur ce fichier. En utilisant cette m&eacute;thode,
les modifications effectu&eacute;es &agrave; l'objet source affecte
tout fichier qui poss&egrave;de un lien vers cet objet. S&eacute;lectionner
cette option affichera une simple bo&icirc;te de dialogue vous
permettant de s&eacute;lectionner le fichier source et l'objet
contenu dans ce fichier et pour lequel un lien sera
cr&eacute;&eacute;.<BR><BR><BR><B>Enregistrer</B> enregistre le
fichier en cours sous le nom existant ou vous demande d'indiquer un
nouveau nom si le fichier n'a jamais &eacute;t&eacute; enregistr&eacute;.
Une m&eacute;thode d'Enregistrement S&eacute;curis&eacute; est
utilis&eacute;e pour vous garantir que le fichier est enregistr&eacute;
correctement avant le remplacement du fichier existant.<BR><BR><B>Enregistrer
Sous</B> permet d'enregistrer le fichier sous un autre nom.<BR><BR><B>Quitter</B>
ferme tous les fichiers AoI ouverts et &eacute;teint compl&egrave;tement
le programme. Il vous sera demand&eacute; d'enregistrer tous les
fichiers qui n'ont pas encore &eacute;t&eacute; enregistr&eacute;s.<BR><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">10
Edit Menu</FONT></FONT></STRONG><BR><BR>Le menu <B>&Eacute;dition</B>
de la barre de menus sup&eacute;rieure contient quelques outils
utiles et &eacute;l&eacute;mentaires de manipulation d'objet.<BR><BR>Voici
ce qu'il contient:</FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/edit_menu.jpg" NAME="graphics19" ALIGN=BOTTOM WIDTH=140 HEIGHT=210 BORDER=0></P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=2><B>Annuler/Refaire</B> annule
			la derni&egrave;re action ou r&eacute;it&egrave;re la derni&egrave;re
			action annul&eacute;e, y compris les s&eacute;lections.<BR><BR><B>Couper</B>
			cr&eacute;e une copie des objets s&eacute;lectionn&eacute;s dans
			le m&eacute;moire tout en supprimant les originaux.<BR><BR><B>Copier</B>
			ressemble &agrave; <B>Couper</B> mais les objets d'origine sont
			conserv&eacute;s.<BR><BR><B>Coller</B> cr&eacute;e autant de
			nouveaux objets que les outils <STRONG>Couper</STRONG> et <STRONG>Copier</STRONG>
			en ont m&eacute;moris&eacute;.<BR><BR><B>Effacer</B> supprime les
			objets s&eacute;lectionn&eacute;s.<BR><BR><B>S&eacute;lectionner
			les Enfants</B> s&eacute;lectionne tous les objets 'enfants' des
			objets actuellement s&eacute;lectionn&eacute;s.<BR><BR><B>Tout
			S&eacute;lectionner</B> s&eacute;lectionne tous les objets de la
			sc&egrave;ne. </FONT></FONT>
			</P>
		</TD>
	</TR>
</TABLE>
<P><FONT FACE="tahoma"><FONT SIZE=2><BR><B>Cr&eacute;er un Double
</B>cr&eacute;e une copie sp&eacute;ciale de tout objet s&eacute;lectionn&eacute;
en ce sens qu'ils seront li&eacute;s dynamiquement de sorte que toute
modification effectu&eacute;e sur l'un d'entre eux sera
automatiquement reproduite sur les autres doubles. Notez que cette
m&eacute;thode de copie utilise sensiblement moins de m&eacute;moire
que de cr&eacute;er plusieurs copies classiques via les outils
copier/couper/coller.<BR><BR><B>Lib&eacute;rer les Doubles</B>
supprime l'association entre les doubles de sorte qu'ils deviennent
des objets ind&eacute;pendants.<BR><BR><B>Pr&eacute;f&eacute;rences</B>
permet de r&eacute;gler diff&eacute;rents param&egrave;tres pour les
instances ult&eacute;rieures du programme. S&eacute;lectionner cette
option affiche la bo&icirc;te de dialogue suivante:</FONT></FONT></P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P><IMG SRC="images/preferences.jpg" NAME="graphics20" ALIGN=BOTTOM WIDTH=334 HEIGHT=385 BORDER=0></P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=2>La fen&ecirc;tre Pr&eacute;f&eacute;rences
			propose deux onglets: G&eacute;n&eacute;ral et Raccourcis. &nbsp;Les
			pr&eacute;f&eacute;rences de l'onglet <B><FONT COLOR="#990000">G&eacute;n&eacute;ral</FONT></B>
			sont les suivantes:</FONT></FONT></P>
			<P><FONT SIZE=2><FONT FACE="tahoma">Le <B>Convertisseur par D&eacute;faut</B>
			d&eacute;finit le moteur de conversion par d&eacute;faut utilis&eacute;
			pour <A HREF="../../../../../Desktop/AoI%20Manual/rendering.html#render_engines">convertir</A>
			les sc&egrave;nes.<BR><BR>Le <B>Convertisseur d'Aper&ccedil;u
			d'Objet</B> d&eacute;finit le convertisseur par d&eacute;faut
			utilis&eacute; pour obtenir un aper&ccedil;u dans les &eacute;diteurs
			d'objet <A HREF="../../../../../Desktop/AoI%20Manual/object_types.html#splines">maillage
			spline</A> et <A HREF="../../../../../Desktop/AoI%20Manual/object_types.html#triangle%20meshes">maillage
			triangulaire</A>.<BR><BR>Le <B>Convertisseur d'Aper&ccedil;u de
			Texture</B> d&eacute;finit le convertisseur par d&eacute;faut
			utilis&eacute; dans les diff&eacute;rentes bo&icirc;tes de
			dialogue de <A HREF="../../../../../Desktop/AoI%20Manual/textures.html">texture</A>.<BR><BR>Le
			<B>Mode d'Affichage par D&eacute;faut</B> d&eacute;finit le <A HREF="#display mode">type
			d'affichage</A> par d&eacute;faut, c'est-&agrave;-dire Fil de Fer,
			Ombr&eacute; ou Liss&eacute;, dans la fen&ecirc;tre principale. </FONT></FONT>
			</P>
			<P><FONT FACE="tahoma"><FONT SIZE=2><FONT SIZE=2><FONT FACE="tahoma"><B>Couleur
			d'Arri&egrave;re plan</B> permet de d&eacute;finir la couleur de
			fond des fen&ecirc;tres de vues, en blanc ou en gris. </FONT></FONT></FONT></FONT>
			</P>
		</TD>
	</TR>
</TABLE>
<P STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="tahoma"><BR>L'<B>Erreur
de Surface Interactive</B> d&eacute;finit la surface pr&eacute;cise
des objets affich&eacute;s dans la fen&ecirc;tre principale et dans
les &eacute;diteurs d'objet. Plus la valeur est basse, plus la
surface sera affich&eacute;e de fa&ccedil;on pr&eacute;cise comme
ci-dessous. gardez &agrave; l'esprit, cependant, qu'une erreur de
surface basse produira une performance m&eacute;diocre en terme de
vitesse.</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="tahoma"><FONT SIZE=2><BR><IMG SRC="images/int_surf_err.jpg" NAME="graphics21" ALIGN=BOTTOM WIDTH=531 HEIGHT=209 BORDER=0><BR><BR><B>Niveau
Maximum d'Annulations</B> d&eacute;finit le nombre de derni&egrave;res
op&eacute;rations enregistr&eacute;es par AoI et ainsi combien
pourront &ecirc;tre annul&eacute;es. Plus le nombre est &eacute;lev&eacute;,
plus le nombre d'&eacute;tapes &agrave; annuler sera &eacute;lev&eacute;,
mais plus la valeur de la m&eacute;moire n&eacute;cessaire sera
&eacute;lev&eacute;e.<BR><BR><B>Utiliser OpenGL pour la Conversion
Interactive</B> Par d&eacute;faut, Art of Illusion utilise OpenGL,
via les biblioth&egrave;ques JOGL, pour acc&eacute;l&eacute;rer
l'affichage interactif dans la fen&ecirc;tre principale et les
&eacute;diteurs d'objet. Si vous rencontrez des probl&egrave;mes avec
ceci, l'option peut &ecirc;tre d&eacute;sactiv&eacute;e pour
permettre une conversion logicielle.<BR><BR><B>Conserver une
Sauvegarde Lors de l'Enregistrement</B> cr&eacute;e une sauvegarde du
dernier fichier enregistr&eacute; lorsque vous enregistrez le fichier
sous un m&ecirc;me nom. Le fichier sauvegard&eacute; porte
l'extension suppl&eacute;mentaire .bak.<BR><BR>Enfin, l'option <B>Langue</B>
permet de d&eacute;finir la langue d'affichage de toutes les bo&icirc;tes
de dialogue. Comme pour la version 2.0, vous pouvez choisir Danish,
English (United States), Fran&ccedil;ais, German, Italian, Japanese,
Portuguese, Spanish ou Swedish.</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="tahoma"><FONT SIZE=2>L'onglet
<B><FONT COLOR="#990000">Raccourcis</FONT></B> de la fen&ecirc;tre
Pr&eacute;f&eacute;rences est illustr&eacute; ci-dessous. &nbsp;Cet
onglet permet de d&eacute;finir des raccourcis claviers, en plus de
ceux qui sont d&eacute;crits &agrave; la section <A HREF="../../../../../Desktop/AoI%20Manual/layout.html#shortcuts">2.2.12</A>.
&nbsp;Les touches ainsi d&eacute;finies d&eacute;clenchent des
scripts pour effectuer certaines t&acirc;ches. De nouveaux raccourcis
peuvent &ecirc;tre ajout&eacute;s et des raccourcis existants &eacute;dit&eacute;s.
&nbsp;Ce qui permet aux scripts Beanshell d'&ecirc;tre &eacute;crits
dans une bo&icirc;te de dialogue sp&eacute;ciale pour effectuer les
s&eacute;ries de commandes n&eacute;cessaires.</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD WIDTH=400>
			<P><IMG SRC="images/shortcuts_pref.jpg" NAME="graphics22" ALIGN=BOTTOM WIDTH=334 HEIGHT=385 BORDER=0></P>
		</TD>
		<TD>
			<P><FONT FACE="tahoma"><FONT SIZE=2><FONT SIZE=2><FONT FACE="tahoma">Les
			raccourcis par d&eacute;faut sont:<BR><BR><B>Suppr&nbsp;</B> &nbsp;&nbsp;
			&nbsp; &nbsp; &nbsp;- &nbsp;&nbsp; Efface la S&eacute;lection<BR><B>1</B>&nbsp;&nbsp;&nbsp;
			&nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp;- &nbsp;
			&nbsp;Mode d'Affichage: Fil de fer<BR><B>2</B>&nbsp;&nbsp; &nbsp;
			&nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp;&nbsp; &nbsp;- &nbsp;
			&nbsp;Mode d'Affichage: Ombr&eacute;<BR><B>3</B> &nbsp;&nbsp; &nbsp;
			&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; - &nbsp; &nbsp;Mode
			d'Affichage: Liss&eacute;<BR><B>4</B>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;
			&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; - &nbsp;&nbsp; Mode d'Affichage:
			Textur&eacute;<BR><B>5&nbsp;</B>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;
			&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;- &nbsp; &nbsp;Mode d'Affichage:
			Transparent<BR><B>E</B>&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;
			&nbsp; &nbsp; &nbsp;- &nbsp; &nbsp;Mode de S&eacute;lection:
			Bord/Courbe<BR><B>F</B>&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;
			&nbsp; &nbsp; &nbsp;- &nbsp; &nbsp;Mode de S&eacute;lection:
			Face<BR><B>V</B>&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;
			&nbsp; &nbsp; &nbsp;- &nbsp;&nbsp; Mode de S&eacute;lection:
			Point/Sommet<BR><B>Page Suiv&nbsp;&nbsp;</B>&nbsp; - &nbsp;&nbsp;
			Outil de S&eacute;lection: Suivant<BR><B>Page Pr&eacute;c</B>&nbsp;
			&nbsp; -&nbsp; &nbsp; Outil de S&eacute;lection:
			Pr&eacute;c&eacute;dent<BR><B>Espace</B>&nbsp;&nbsp;&nbsp; &nbsp;
			&nbsp; &nbsp; - &nbsp; &nbsp;Outil de S&eacute;lection: Par
			D&eacute;faut<BR><B>ClavNum-0</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Perspective<BR><B>ClavNum-1</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Devant<BR><B>ClavNum-2</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Derri&egrave;re<BR><B>ClavNum-3&nbsp;</B> &nbsp; - &nbsp;&nbsp;
			Vue: Gauche<BR><B>ClavNum-4&nbsp;</B> &nbsp; - &nbsp;&nbsp; Vue:
			Droite<BR><B>ClavNum-5</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Dessus<BR><B>ClavNum-6</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Dessous<BR><B>ClavNum-7</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Camera 1<BR><B>ClavNum-8</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Camera 2<BR><B>ClavNum +</B>&nbsp; &nbsp; - &nbsp;&nbsp; Vue: Zoom
			Avant<BR><B>ClavNum -</B>&nbsp;&nbsp; &nbsp; - &nbsp;&nbsp; Vue:
			Zoom Arri&egrave;re</FONT></FONT></FONT></FONT></P>
		</TD>
	</TR>
	<TR>
		<TD></TD>
		<TD></TD>
	</TR>
</TABLE>
<P><FONT SIZE=2><FONT FACE="tahoma"><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">11
Using Template Images</FONT></FONT></STRONG><BR><BR><STRONG><FONT SIZE=4><FONT COLOR="#ff6633">2.2.11
Utiliser les Images Mod&egrave;les</FONT></FONT></STRONG><BR><BR>Art
of Illusion permet de r&eacute;gler le fond des fen&ecirc;tres
d'affichage sur une image. Ce qui est utile lors de la mod&eacute;lisation
des objets qui b&eacute;n&eacute;ficient d'une image de r&eacute;f&eacute;rence.
Pour s&eacute;lectionner d'une image &agrave; attribuer &agrave;
l'arri&egrave;re-plan, cliquez dans la fen&ecirc;tre d'affichage dans
laquelle vous souhaitez afficher l'image et choisissez <B>Sc&egrave;ne
-&gt; D&eacute;finir une Image Mod&egrave;le</B>. Une bo&icirc;te de
dialogue s'affiche pour vous permettre de choisir une image au format
.jpg, .gif ou .png. Apr&egrave;s la s&eacute;lection, l'image sera
affich&eacute;e comme fond de la fen&ecirc;tre d'affichage
s&eacute;lectionn&eacute;e.<BR><BR>Pour cacher l'image, choisissez
<B>Sc&egrave;ne -&gt; Masquer le Mod&egrave;le</B> et pour l'afficher
&agrave; nouveau, choisissez <B>Sc&egrave;ne -&gt; Montrer le Mod&egrave;le</B>.
Ces actions peuvent aussi &ecirc;tre ex&eacute;cut&eacute;es pour
cacher/afficher les images mod&egrave;les des diff&eacute;rents
&eacute;diteurs.</FONT></FONT></P>
</BODY>
</HTML>