#Thu May 16 17:55:33 BRT 2013
42X59=Po\u010Det sloupc\u016F v ka\u017Ed\u00E9m konstruktoru VALUES mus\u00ED b\u00FDt stejn\u00FD.
42Y94=AND nebo OR m\u00E1 operand, kter\u00FD nen\u00ED logickou hodnotou. Operandy p\u0159\u00EDslu\u0161ej\u00EDc\u00ED k AND a OR se musej\u00ED vyhodnotit na hodnotu TRUE, FALSE nebo UNKNOWN. 
42Z48.U=ID sloupce[{0}][{1}]
42X86=Selh\u00E1n\u00ED p\u0159\u00EDkazu ALTER TABLE. Neexistuje omezen\u00ED ''{0}'' v tabulce ''{1}''. 
43X58.U=Transforma\u010Dn\u00ED tabulka
01522=Nov\u011B definovan\u00E9 synonymum ''{0}'' se rozli\u0161ilo na objekt ''{1}'', kter\u00FD moment\u00E1ln\u011B nen\u00ED definov\u00E1n.
43Y57.U=U\u017Eivatelem dodan\u00E9 p\u0159episy nastaven\u00ED optimaliz\u00E1toru pro slou\u010Den\u00ED jsou {0}
42Y49=Bylo uvedeno n\u011Bkolik hodnot pro kl\u00ED\u010D vlastnosti ''{0}''. 
43X76.U=Uskute\u010Dn\u011Bn\u00E9 rozhran\u00ED ResultSet
XBM0G.D=Do\u0161lo k selh\u00E1n\u00ED spu\u0161t\u011Bn\u00ED \u0161ifrovac\u00EDho j\u00E1dra. Ujist\u011Bte se, \u017Ee m\u00E1te spu\u0161t\u011Bnou Javu 2 a \u017Ee jste st\u00E1hli poskytovatele \u0161ifrov\u00E1n\u00ED, jako je JCE, a um\u00EDstili jej do va\u0161\u00ED cesty ke t\u0159\u00EDd\u011B. 
22015=Funkce ''{0}'' nen\u00ED povolena v n\u00E1sleduj\u00EDc\u00EDch sad\u00E1ch typ\u016F. Prvn\u00ED operand je typu ''{1}''. Druh\u00FD operand je typu ''{2}''. T\u0159et\u00ED operand (po\u010D\u00E1te\u010Dn\u00ED pozice) je typu ''{3}''.
42X68=Nebylo nalezeno \u017E\u00E1dn\u00E9 pole ''{0}'' pat\u0159\u00EDc\u00ED t\u0159\u00EDd\u011B ''{1}''. P\u0159\u00ED\u010Dinou m\u016F\u017Ee b\u00FDt, \u017Ee pole existuje, ale nen\u00ED ve\u0159ejn\u00E9, nebo \u017Ee t\u0159\u00EDda neexistuje nebo nen\u00ED ve\u0159ejn\u00E1.
01504=Nov\u00FD index je duplik\u00E1tem existuj\u00EDc\u00EDho indexu\: {0}.
42Z84.U=sd\u00EDlet
42Z39.U=Do\u0161lo k neo\u010Dek\u00E1van\u00E9 v\u00FDjimce {0} p\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED polohovadla.
43X94.U=omezen\u00ED
43X49.U=Ha\u0161ovat lev\u00E9 vn\u011Bj\u0161\u00ED slou\u010Den\u00ED
42Y58=Vyskytla se v\u00FDjimka form\u00E1tu \u010D\u00EDsla p\u0159i konverzi hodnoty ''{0}'' pro p\u0159epis nastaven\u00ED optimaliz\u00E1toru ''{1}''.
42Z93=Omezen\u00ED ''{0}'' a ''{1}'' maj\u00ED stejnou sadu sloupc\u016F, co\u017E nen\u00ED povoleno. 
XBCM4.S=Byly p\u0159ekro\u010Deny limity form\u00E1tu souboru t\u0159\u00EDdy Javy\: {1} v generovan\u00E9 t\u0159\u00EDd\u011B {0}.
42Z57.U=Prov\u00E1d\u011Bn\u00ED se zastavilo po optimalizaci p\u0159\u00EDznakem lad\u011Bn\u00ED StopAfterOptimizing.
42Y85=Kl\u00ED\u010Dov\u00E9 slovo DEFAULT je povoleno v klauzuli VALUES pouze tehdy, kdy\u017E se klauzule VALUES objev\u00ED v p\u0159\u00EDkazu INSERT.
22015.S.1=Neplatn\u00E1 konverze dat\: po\u017Eadovan\u00E1 konverze by m\u011Bla za n\u00E1sledek ztr\u00E1tu p\u0159esnosti {0}
43X67.U=Vlo\u017Eit rozhran\u00ED ResultSet pomoc\u00ED
42X77=Pozice sloupce ''{0}'' je mimo rozsah v\u00FDrazu dotazu.
22501=Klauzule ESCAPE s hodnotou ''null'' vrac\u00ED nedefinovan\u00E9 v\u00FDsledky a nen\u00ED povolena.
42Z75=V\u00FDraz dotazu XML mus\u00ED b\u00FDt \u0159et\u011Bzcov\u00FDm liter\u00E1lem.
43X85.U=Rozhran\u00ED ResultSet existuj\u00EDc\u00EDho slou\u010Den\u00ED vno\u0159en\u00E9 smy\u010Dky
42Y67=Sch\u00E9ma ''{0}'' nelze uvolnit.
