#Thu May 16 17:55:33 BRT 2013
42X59=Die Spaltenanzahl muss in allen VALUES-Konstruktoren identisch sein.
42Y94=Ein AND oder OR verwendet einen nicht-Booleschen Operanden. Das Ergebnis der Auswertung f\u00FCr die Operanden von AND und OR muss TRUE, FALSE oder UNKNOWN sein.
42Z48.U=ID f\u00FCr Spalte [{0}][{1}]
42X86=ALTER TABLE ist gescheitert. F\u00FCr die Tabelle ''{1}'' gibt es keine Integrit\u00E4tsbedingung ''{0}''. 
43X58.U=Hash-Tabelle
01522=Das neu definierte Synonym ''{0}'' wurde in das Objekt ''{1}'' aufgel\u00F6st, das derzeit nicht definiert ist.
43Y57.U=Der Benutzer hat f\u00FCr join folgende vorrangigen Optimizer-Werte angegeben\: {0}
42Y49=F\u00FCr den Merkmalschl\u00FCssel ''{0}'' wurden mehrere Werte angegeben. 
43X76.U=Gespeichertes ResultSet
XBM0G.D=Die Verschl\u00FCsselungssteuerkomponente konnte nicht gestartet werden. Vergewissern Sie sich, dass Sie Java 2 ausf\u00FChren und einen Verschl\u00FCsselungsprovider wie JCE heruntergeladen und in den Klassenpfad aufgenommen haben. 
22015=Die Funktion ''{0}'' ist f\u00FCr die folgenden Typen unzul\u00E4ssig. Der erste Operand ist vom Typ ''{1}''.  Der zweite Operand ist vom Typ ''{2}''. Der dritte Operand (Anfangsposition) ist vom Typ ''{3}''.
42X68=Es wurde kein Feld ''{0}'', das zur Klasse ''{1}'' geh\u00F6rt, gefunden. M\u00F6glicherweise ist das Feld vorhanden, jedoch nicht \u00F6ffentlich. Es kann auch sein, dass die Klasse nicht vorhanden oder nicht \u00F6ffentlich ist.
01504=Der neue Index ist ein Duplikat eines vorhandenen Indexes\: {0}.
42Z84.U=SHARE
42Z39.U=Unerwartete Ausnahme {0} beim Anfordern des Positionierers.
43X94.U=Einschr\u00E4nkung
43X49.U=Nach links erweiterte Verkn\u00FCpfung von Hash-Eintr\u00E4gen
01009=Die generierte Spalte {0} wurde aus Tabelle {1} gel\u00F6scht.
42Y58=Beim Konvertieren des Wertes ''{0}'' f\u00FCr den vorrangigen Optimizer-Wert ''{1}'' ist eine NumberFormatException eingetreten.
42Z93=Die Integrit\u00E4tsbedingungen ''{0}'' und ''{1}'' haben dieselben Spaltengruppen. Dies ist unzul\u00E4ssig. 
XBCM4.S=In der generierten Klasse {0} wurde die Formatbegrenzung f\u00FCr Java-Klassendateien {1} \u00FCberschritten.
42Z57.U=Die Ausf\u00FChrung wurde nach der Optimierung von der Debug-Markierung StopAfterOptimizing gestoppt.
42Y85=Das Schl\u00FCsselwort DEFAULT ist in einer VALUES-Klausel nur zul\u00E4ssig, wenn die VALUES-Klausel in einer INSERT-Anweisung erscheint.
43X67.U=INSERT-ResultSet mit
42X77=Die Spaltenposition ''{0}'' befindet sich au\u00DFerhalb des Bereichs f\u00FCr den Abfrageausdruck.
22501=Eine ESCAPE-Klausel NULL gibt nicht definierte Ergebnisse zur\u00FCck und ist unzul\u00E4ssig.
42Z75=Ein XML-Abfrageausdruck muss ein Zeichenfolgenliteral sein.
43X85.U=ResultSet f\u00FCr Verkn\u00FCpfung \u00FCber vorhandene verschachtelte Schleife
42Y67=Das Schema ''{0}'' kann nicht gel\u00F6scht werden.
