#Thu May 16 17:55:33 BRT 2013
42X59=Le nombre de colonnes de chaque constructeur VALUES doit \u00EAtre le m\u00EAme.
42Y94=Un op\u00E9rateur AND ou OR poss\u00E8de un op\u00E9rande non bool\u00E9en. Les op\u00E9randes de AND et OR doivent avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN.  
42Z48.U=Id de colonne[{0}][{1}]
42X86=Echec de l''op\u00E9ration ALTER TABLE. Il n''existe aucune contrainte ''{0}'' sur la table ''{1}''. 
43X58.U=Table de hachage
01522=Le synonyme nouvellement d\u00E9fini ''{0}'' a \u00E9t\u00E9 r\u00E9solu en objet ''{1}'' qui n''est pas d\u00E9fini actuellement.
43Y57.U=Les substitutions d''optimiseur fournies par l''utilisateur pour effectuer une jointure sont {0}
42Y49=Plusieurs valeurs sont indiqu\u00E9es pour la cl\u00E9 de propri\u00E9t\u00E9 ''{0}''. 
43X76.U=ResultSet mat\u00E9rialis\u00E9
XBM0G.D=Echec du d\u00E9marrage du moteur de chiffrement. Assurez-vous que vous ex\u00E9cutez Java 2 et que vous avez t\u00E9l\u00E9charg\u00E9 un fournisseur de chiffrement tel que jce et que vous l''avez plac\u00E9 dans votre chemin de classes. 
22015=La fonction ''{0}'' n''est pas autoris\u00E9e sur l''ensemble de types suivant.  Le premier op\u00E9rande est de type ''{1}''.  Le deuxi\u00E8me op\u00E9rande est de type ''{2}''.  Le troisi\u00E8me op\u00E9rande (position de d\u00E9but) est de type ''{3}''.
42X68=Aucune zone ''{0}'' appartenant \u00E0 la classe ''{1}'' n''a \u00E9t\u00E9 trouv\u00E9e.  Il est possible que cette zone existe, mais qu''elle ne soit pas publique, ou que la classe n''existe pas ou qu''elle ne soit pas publique.
01504=Le nouvel index est un double d''un index existant \: {0}.
42Z84.U=partager
42Z39.U=Exception impr\u00E9vue {0} lors de l''extraction du positionneur.
43X94.U=limitation
43X49.U=Jointure externe gauche par hachage
01009=La colonne g\u00E9n\u00E9r\u00E9e {0} a \u00E9t\u00E9 supprim\u00E9e de la table {1}.
42Y58=L''exception NumberFormatException s''est produite lors de la conversion de la valeur ''{0}'' pour l''\u00E9l\u00E9ment de substitution d''optimiseur ''{1}''.
42Z93=Les contraintes ''{0}'' et ''{1}'' poss\u00E8dent le m\u00EAme ensemble de colonnes, ce qui n''est pas autoris\u00E9.. 
XBCM4.S=Limite(s) du format de fichier de la classe Java d\u00E9pass\u00E9e(s) \: {1} dans la classe g\u00E9n\u00E9r\u00E9e {0}.
42Z57.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s l''optimisation par l''indicateur de d\u00E9bogage StopAfterOptimizing.
42Y85=Le mot cl\u00E9 DEFAULT n''est pas autoris\u00E9 dans une clause VALUES lorsque cette clause figure dans une instruction INSERT.
43X67.U=Ins\u00E9rer ResultSet \u00E0 l''aide de
42X77=La position de la colonne ''{0}'' est en dehors des limites pour l''expression de requ\u00EAte.
22501=Une clause ESCAPE ayant pour valeur NULL renvoie des r\u00E9sultats non d\u00E9finis et n''est pas autoris\u00E9e.
42Z75=L''expression de requ\u00EAte XML doit \u00EAtre un litt\u00E9ral cha\u00EEne.
43X85.U=ResultSet de jointure Exists en boucle imbriqu\u00E9e
42Y67=Le sch\u00E9ma ''{0}'' ne peut pas \u00EAtre supprim\u00E9.
