#Thu May 16 17:55:33 BRT 2013
42X59=Az oszlopok sz\u00E1m\u00E1nak minden VALUES konstruktorban egyeznie kell.
42Y94=Az AND vagy OR nem logikai operandussal rendelkezik. Az AND \u00E9s OR operandusainak \u00E9rt\u00E9ke ki\u00E9rt\u00E9kel\u00E9s ut\u00E1n TRUE, FALSE vagy UNKNOWN lehet.  
42Z48.U=Oszlop [{0}][{1}] azonos\u00EDt\u00F3
42X86=Az ALTER TABLE meghi\u00FAsult. A(z) ''{1}'' t\u00E1bl\u00E1ra nem vonatkozik ''{0}'' megszor\u00EDt\u00E1s. 
43X58.U=Kivonatt\u00E1bla
01522=Az \u00FAjonnan meghat\u00E1rozott ''{0}'' szinonima a jelenleg meghat\u00E1rozatlan ''{1}'' objektumra oldhat\u00F3 fel.
43Y57.U=A felhaszn\u00E1l\u00F3 \u00E1ltal biztos\u00EDtott optimaliz\u00E1l\u00F3 fel\u00FClb\u00EDr\u00E1l\u00E1sok az \u00F6sszef\u00E9s\u00FCl\u00E9shez a k\u00F6vetkez\u0151k\: {0}
42Y49=A(z) ''{0}'' tulajdons\u00E1gkulcshoz t\u00F6bb \u00E9rt\u00E9k van megadva. 
43X76.U=Megval\u00F3sult ResultSet
XBM0G.D=A titkos\u00EDt\u00E1si alrendszer ind\u00EDt\u00E1sa meghi\u00FAsult. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a Java 2-t futtatja \u00E9s let\u00F6lt\u00F6tt egy titkos\u00EDt\u00E1sszolg\u00E1ltat\u00F3t, mint p\u00E9ld\u00E1ul a jce, \u00E9s azt elhelyezte az oszt\u00E1ly\u00FAtvonalon. 
22015=A(z) ''{0}'' f\u00FCggv\u00E9ny nem enged\u00E9lyezett a k\u00F6vetkez\u0151 t\u00EDpushalmazon.  Az els\u0151 operandus ''{1}'' t\u00EDpus\u00FA.  A m\u00E1sodik operandus ''{2}'' t\u00EDpus\u00FA.  A harmadik operandus (a kezd\u0151poz\u00EDci\u00F3) ''{3}'' t\u00EDpus\u00FA.
42X68=Nem tal\u00E1lhat\u00F3 a(z) ''{1}'' oszt\u00E1lyhoz tartoz\u00F3 ''{0}'' mez\u0151.  Elk\u00E9pzelhet\u0151, hogy a mez\u0151 l\u00E9tezik, de nem nyilv\u00E1nos, vagy az oszt\u00E1ly nem l\u00E9tezik illetve nem nyilv\u00E1nos.
01504=Az \u00FAj index egy megl\u00E9v\u0151 index m\u00E1sodp\u00E9ld\u00E1nya\: {0}.
42Z84.U=megoszt\u00E1s
42Z39.U=V\u00E1ratlan {0} kiv\u00E9tel t\u00F6rt\u00E9nt a poz\u00EDcion\u00E1l\u00F3 lek\u00E9r\u00E9se sor\u00E1n.
43X94.U=korl\u00E1toz\u00E1s
43X49.U=Kivonat bal k\u00FCls\u0151 join
42Y58=NumberFormatException kiv\u00E9tel t\u00F6rt\u00E9nt a(z) ''{0}'' \u00E1talak\u00EDt\u00E1sakor az optimaliz\u00E1l\u00F3 fel\u00FClb\u00EDr\u00E1l\u00E1shoz\: ''{1}''.
42Z93=A(z) ''{0}'' \u00E9s ''{1}'' megszor\u00EDt\u00E1s azonos oszlophalmazzal rendelkezik, amely nem megengedett. 
XBCM4.S=A Java oszt\u00E1lyf\u00E1jl-form\u00E1tum korl\u00E1tai t\u00FAll\u00E9pve\: {1} a(z) {0} el\u0151\u00E1ll\u00EDtott oszt\u00E1lyban.
42Z57.U=A v\u00E9grehajt\u00E1s a StopAfterOptimizing hibakeres\u00E9si jelz\u0151 \u00E1ltali optimaliz\u00E1l\u00E1s ut\u00E1n le\u00E1llt.
42Y85=A DEFAULT kulcssz\u00F3 csak akkor megengedett a VALUES r\u00E9szkifejez\u00E9sben, ha a VALUES r\u00E9szkifejez\u00E9s INSERT utas\u00EDt\u00E1sban jelenik meg.
43X67.U=ResultSet besz\u00FAr\u00E1sa
42X77=A(z) ''{0}'' oszloppoz\u00EDci\u00F3 a lek\u00E9rdez\u00E9s kifejez\u00E9s tartom\u00E1ny\u00E1n k\u00EDv\u00FCli esik.
42Z75=Az XML lek\u00E9rdez\u00E9s kifejez\u00E9snek karaktersorozat liter\u00E1lnak kell lennie.
22501=A NULL egy ESCAPE r\u00E9szkifejez\u00E9se meghat\u00E1rozatlan eredm\u00E9nyeket ad vissza \u00E9s nem enged\u00E9lyezett.
43X85.U=Be\u00E1gyazott ciklus kivonat join ResultSet
42Y67=A(z) ''{0}'' s\u00E9ma nem sz\u00FCntethet\u0151 meg.
