#Thu May 16 17:55:33 BRT 2013
42X59=O n\u00FAmero de colunas em cada construtor VALUES deve ser id\u00EAntico.
42Y94=Um AND ou OR possui um operando n\u00E3o-booleano. Os operandos de AND e OR devem ser avaliados como TRUE, FALSE ou UNKNOWN.
42Z48.U=Id da coluna [{0}][{1}]
42X86=ALTER TABLE falhou. N\u00E3o existe a restri\u00E7\u00E3o ''{0}'' na tabela ''{1}''.
43X58.U=Tabela de ''hash''
01522=O sin\u00F4nimo definido recentemente ''{0}'' determinado ao objeto ''{1}'', que est\u00E1 indefinido no momento.
43Y57.U=Substitui\u00E7\u00F5es de otimiza\u00E7\u00E3o fornecidas pelo usu\u00E1rio para jun\u00E7\u00E3o s\u00E3o {0}
42Y49=M\u00FAltiplos valores especificados para a chave da propriedade ''{0}''.
43X76.U=ResultSet materializado
XBM0G.D=Falha ao iniciar o mecanismo de criptografia. Certifique-se de estar usando o Java 2, de ter baixado um provedor de criptografia como o JCE, e de t\u00EA-lo colocado no caminho de classes.
22015=A fun\u00E7\u00E3o ''{0}'' n\u00E3o \u00E9 permitida no seguinte conjunto de tipos.  O primeiro operando \u00E9 do tipo ''{1}''.  O segundo operando \u00E9 do tipo ''{2}''.  O terceiro operando (posi\u00E7\u00E3o inicial) \u00E9 do tipo ''{3}''.
42X68=Nenhum campo ''{0}'' que perten\u00E7a \u00E0 classe ''{1}'' foi localizado.  Isto pode ocorrer, porque o campo existe mas n\u00E3o \u00E9 p\u00FAblico, ou porque a classe n\u00E3o existe ou n\u00E3o \u00E9 p\u00FAblica.
01504=O novo \u00EDndice \u00E9 uma duplica\u00E7\u00E3o de um \u00EDndice existente\: {0}.
42Z84.U=compartilhar
42Z39.U=Exce\u00E7\u00E3o inesperada {0} ao obter o posicionador.
43X94.U=restri\u00E7\u00E3o
43X49.U=Jun\u00E7\u00E3o externa esquerda por ''hash''
42Y58=Ocorr\u00EAncia de NumberFormatException ao converter o valor ''{0}'' para a substitui\u00E7\u00E3o do otimizador ''{1}''.
42Z93=As restri\u00E7\u00F5es ''{0}'' e ''{1}'' possuem o mesmo conjunto de colunas, o que n\u00E3o \u00E9 permitido.
XBCM4.S=Excedido(s) limite(s) do formato de arquivo da classe Java\: {1} na classe gerada {0}.
42Z57.U=Execu\u00E7\u00E3o parada ap\u00F3s a otimiza\u00E7\u00E3o pelo sinalizador de depura\u00E7\u00E3o StopAfterOptimizing.
42Y85=A palavra-chave DEFAULT na cl\u00E1usula VALUES \u00E9 permitida apenas quando a cl\u00E1usula VALUES aparece dentro de uma instru\u00E7\u00E3o INSERT.
43X67.U=Inserir ResultSet utilizando
42X77=A posi\u00E7\u00E3o da coluna ''{0}'' est\u00E1 fora do faixa para a express\u00E3o de consulta.
42Z75=A express\u00E3o de consulta XML deve ser um literal de cadeia.
22501=Uma cl\u00E1usula ESCAPE nula retorna resultados indefinidos, n\u00E3o sendo permitida.
43X85.U=ResultSet de jun\u00E7\u00E3o EXISTS por la\u00E7o aninhado
42Y67=O esquema ''{0}'' n\u00E3o pode ser removido.
