#Thu May 16 17:55:33 BRT 2013
42X59=\u0427\u0438\u0441\u043B\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0432 \u043A\u0430\u0436\u0434\u043E\u043C \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u043E\u0440\u0435 VALUES \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u043E\u0434\u0438\u043D\u0430\u043A\u043E\u0432\u044B\u043C.
42Y94=\u0412 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0438 \u0441 AND \u0438\u043B\u0438 OR \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u043E\u043F\u0435\u0440\u0430\u043D\u0434, \u043D\u0435 \u043E\u0442\u043D\u043E\u0441\u044F\u0449\u0438\u0439\u0441\u044F \u043A \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u043C\u0443 \u0442\u0438\u043F\u0443. \u041E\u043F\u0435\u0440\u0430\u043D\u0434\u044B \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0439 AND \u0438 OR \u0434\u043E\u043B\u0436\u043D\u044B \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0442\u044C\u0441\u044F \u0432 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F TRUE, FALSE \u0438\u043B\u0438 UNKNOWN.  
42Z48.U=ID \u0441\u0442\u043E\u043B\u0431\u0446\u0430[{0}][{1}]
42X86=\u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435 ALTER TABLE \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u043E\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E. \u0414\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F ''{0}''. 
43X58.U=\u0422\u0430\u0431\u043B\u0438\u0446\u0430 \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
01522=\u0417\u0430\u043D\u043E\u0432\u043E \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0439 \u0441\u0438\u043D\u043E\u043D\u0438\u043C ''{0}'' \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D \u0432 \u043E\u0431\u044A\u0435\u043A\u0442 ''{1}'', \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0432 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043D\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D.
43Y57.U=\u0417\u0430\u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u043C \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430 \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F\: {0}
42Y49=\u0414\u043B\u044F \u043A\u043B\u044E\u0447\u0430 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 ''{0}'' \u0437\u0430\u0434\u0430\u043D\u043E \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439. 
43X76.U=\u041C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet)
XBM0G.D=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u0432\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0435 Java 2 \u0438 \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u043B\u0438 \u043F\u0440\u043E\u0432\u0430\u0439\u0434\u0435\u0440\u0430 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, jce) \u0438 \u043F\u043E\u043C\u0435\u0441\u0442\u0438\u043B\u0438 \u0435\u0433\u043E \u0432 \u043F\u0443\u0442\u044C \u043A\u043B\u0430\u0441\u0441\u043E\u0432. 
22015=\u0424\u0443\u043D\u043A\u0446\u0438\u044F ''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043F\u0440\u0438\u0432\u0435\u0434\u0435\u043D\u043D\u043E\u0433\u043E \u043D\u0438\u0436\u0435 \u043D\u0430\u0431\u043E\u0440\u0430 \u0442\u0438\u043F\u043E\u0432.  \u041F\u0435\u0440\u0432\u044B\u0439 \u043E\u043F\u0435\u0440\u0430\u043D\u0434 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0442\u0438\u043F\u0443 ''{1}''.  \u0412\u0442\u043E\u0440\u043E\u0439 \u043E\u043F\u0435\u0440\u0430\u043D\u0434 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0442\u0438\u043F\u0443 ''{2}''.  \u0422\u0440\u0435\u0442\u0438\u0439 \u043E\u043F\u0435\u0440\u0430\u043D\u0434 (\u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0435 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435) \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0442\u0438\u043F\u0443 ''{3}''.
42X68=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u043F\u043E\u043B\u044F ''{0}'', \u043E\u0442\u043D\u043E\u0441\u044F\u0449\u0435\u0433\u043E\u0441\u044F \u043A \u043A\u043B\u0430\u0441\u0441\u0443 ''{1}''.  \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u044D\u0442\u043E \u043F\u043E\u043B\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u043D\u043E \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C, \u043B\u0438\u0431\u043E \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0438\u043B\u0438 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C.
01504=\u041D\u043E\u0432\u044B\u0439 \u0438\u043D\u0434\u0435\u043A\u0441 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442\u043E\u043C \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u0438\u043D\u0434\u0435\u043A\u0441\u0430\: {0}.
42Z84.U=\u0440\u0430\u0437\u0434\u0435\u043B\u044F\u0435\u043C\u0430\u044F
42Z39.U=\u041D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E\u0435 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 {0} \u043F\u0440\u0438 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u0438 \u043F\u043E\u0437\u0438\u0446\u0438\u043E\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F.
43X94.U=\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435
43X49.U=\u041B\u0435\u0432\u043E\u0435 \u0432\u043D\u0435\u0448\u043D\u0435\u0435 \u0445\u044D\u0448-\u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435
42Y58=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 NumberFormatException \u043F\u0440\u0438 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F ''{0}'' \u0434\u043B\u044F \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430 ''{1}''.
42Z93=\u0423 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0439 ''{0}'' \u0438 ''{1}'' \u043E\u0434\u0438\u043D \u0438 \u0442\u043E\u0442 \u0436\u0435 \u043D\u0430\u0431\u043E\u0440 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432, \u0447\u0442\u043E \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F. 
XBCM4.S=\u0412 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u043C \u043A\u043B\u0430\u0441\u0441\u0435 {0} \u043F\u0440\u0435\u0432\u044B\u0448\u0435\u043D\u044B \u043B\u0438\u043C\u0438\u0442\u044B \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u0444\u0430\u0439\u043B\u0430 \u043A\u043B\u0430\u0441\u0441\u043E\u0432 Java ({1}).
42Z57.U=\u0412\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u043F\u043E\u0441\u043B\u0435 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u0438 \u0444\u043B\u0430\u0433\u043E\u043C \u043E\u0442\u043B\u0430\u0434\u043A\u0438 StopAfterOptimizing.
42Y85=\u041A\u043B\u044E\u0447\u0435\u0432\u043E\u0435 \u0441\u043B\u043E\u0432\u043E DEFAULT \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 VALUES, \u043A\u043E\u0433\u0434\u0430 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F VALUES \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432\u043D\u0443\u0442\u0440\u0438 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 INSERT.
43X67.U=\u0412\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C
42X77=\u041F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432\u043D\u0435 \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D\u0430 \u0434\u043B\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0437\u0430\u043F\u0440\u043E\u0441\u0430.
42Z75=\u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0437\u0430\u043F\u0440\u043E\u0441\u0430 XML \u0434\u043E\u043B\u0436\u043D\u043E \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u0441\u0442\u0440\u043E\u0447\u043D\u044B\u0439 \u043B\u0438\u0442\u0435\u0440\u0430\u043B.
22501=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F ESCAPE \u0441\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C NULL \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043D\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0435 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0438 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439.
43X85.U=ResultSet - \u041E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u0433\u043E \u0446\u0438\u043A\u043B\u0430
42Y67=\u0421\u0445\u0435\u043C\u0443 ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C.
