#Thu May 16 17:55:33 BRT 2013
XSAJ2.U=\u8A2A\u554F\u3057\u305F\u884C\u6570
XIE0R.S=\u30A4\u30F3\u30DD\u30FC\u30C8\u30A8\u30E9\u30FC\u3002\u30D5\u30A1\u30A4\u30EB {1} \u306E\u884C {0}\: {2} 
54038=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30C8\u30EA\u30AC\u30FC\u306E\u6DF1\u3055\u304C\u6700\u5927\u5024\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
57017.C=\u30BD\u30FC\u30B9\u30FB\u30B3\u30FC\u30C9\u30FB\u30DA\u30FC\u30B8 {0} \u304B\u3089\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30B3\u30FC\u30C9\u30FB\u30DA\u30FC\u30B8 {1} \u3078\u306E\u5909\u63DB\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
42XA7=''{0}'' \u306F\u751F\u6210\u3055\u308C\u305F\u5217\u3067\u3059\u3002\u305D\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42734=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8 ''{1}'' \u3067\u6307\u5B9A\u3055\u308C\u305F\u540D\u524D ''{0}'' \u304C\u56FA\u6709\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XJ013.S=\u540D\u524D\u4ED8\u304D\u306E\u30BB\u30FC\u30D6\u30DD\u30A4\u30F3\u30C8\u306B ID \u304C\u3042\u308A\u307E\u305B\u3093\u3002
XJ112.S=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u8A73\u3057\u304F\u306F\u3001\u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XCXE0.S=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30C6\u30EA\u30C8\u30EA\u30FC\u3092\u4F7F\u7528\u3059\u308B\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u304C\u3001\u305D\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F\u30C6\u30EA\u30C8\u30EA\u30FC\u3092\u6301\u3063\u3066\u3044\u307E\u305B\u3093\u3002
XJ211.S=\u30D0\u30C3\u30C1\u51E6\u7406\u4E2D\u306B\u30EA\u30AB\u30D0\u30EA\u30FC\u4E0D\u80FD\u306A\u9023\u9396\u5206\u65AD\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002 \u30D0\u30C3\u30C1\u306F\u975E\u30A2\u30C8\u30DF\u30C3\u30AF\u306B\u7D42\u4E86\u3057\u307E\u3059\u3002
XJ040.C=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC {1} \u3092\u4F7F\u7528\u3057\u3066\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u3092\u59CB\u52D5\u3067\u304D\u307E\u305B\u3093\u3002\u8A73\u3057\u304F\u306F\u3001\u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
42824=LIKE \u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u304C\u30B9\u30C8\u30EA\u30F3\u30B0\u3067\u306A\u3044\u304B\u3001\u7B2C 1 \u30AA\u30DA\u30E9\u30F3\u30C9\u304C\u5217\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XSCB8.S=btree \u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8 {0} \u306F\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u3066\u3044\u307E\u3059\u3002
XSAI3.S=\u30D5\u30A3\u30FC\u30C1\u30E3\u30FC\u306F\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
A001=\u81F4\u547D\u7684\: \u30B7\u30B9\u30C6\u30E0\u306E\u8A8D\u8A3C\u30B5\u30FC\u30D3\u30B9\u304C\u3042\u308A\u307E\u305B\u3093
42815.S.171=\u5F15\u6570 ''{0}'' \u304A\u3088\u3073 ''{1}'' \u306E\u30C7\u30FC\u30BF\u578B\u3001\u9577\u3055\u3001\u307E\u305F\u306F\u5024\u306B\u306F\u4E92\u63DB\u6027\u304C\u3042\u308A\u307E\u305B\u3093\u3002
42ZB4=''{0}''.{1}'' \u306F\u8868\u6A5F\u80FD\u3092\u8B58\u5225\u3057\u307E\u305B\u3093\u3002
XJ103.S=\u8868\u540D\u3092 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSLA0.D=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u30C7\u30A3\u30B9\u30AF {0} \u306B\u30D5\u30E9\u30C3\u30B7\u30E5\u3067\u304D\u307E\u305B\u3093\u3002
58016.C=DDM \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC 0x{0} \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
XJ202.S=\u7121\u52B9\u306A\u30AB\u30FC\u30BD\u30EB\u540D ''{0}'' \u3067\u3059\u3002
XSDG2.D=\u30DA\u30FC\u30B8 {0} \u306B\u7121\u52B9\u306A\u30C1\u30A7\u30C3\u30AF\u30B5\u30E0\u3002\u4E88\u671F\u3055\u308C\u3066\u3044\u305F\u30C1\u30A7\u30C3\u30AF\u30B5\u30E0\={1}\u3001\u30C7\u30A3\u30B9\u30AF\u4E0A\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\={2}\u3001\u30DA\u30FC\u30B8\u30C0\u30F3\u30D7\: {3}
XSDB7.D=\u8B66\u544A\: Derby (\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {2}) \u304C\u307E\u3060\u30A2\u30AF\u30C6\u30A3\u30D6\u3067\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u306E\u306B\u3082\u304B\u304B\u308F\u3089\u305A\u3001Derby ( \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {0}) \u304C\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 {1} \u3092\u30D6\u30FC\u30C8\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002  \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u30D6\u30FC\u30C8\u3067\u304D\u308B Derby \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u30011 \u5EA6\u306B 1 \u3064\u3060\u3051\u3067\u3059\u3002 \u3053\u308C\u306B\u3088\u308A\u91CD\u5927\u306A\u3001\u30EA\u30AB\u30D0\u30EA\u4E0D\u80FD\u306E\u7834\u58CA\u304C\u767A\u751F\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u3059\u3067\u306B\u7834\u58CA\u3055\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
XJ022.S=\u30B9\u30C8\u30EA\u30FC\u30E0\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\: ''{0}''\u3002
42815.S.713=''{0}'' \u306E\u7F6E\u304D\u63DB\u3048\u5024\u304C\u7121\u52B9\u3067\u3059\u3002
XSDF3.S=\u30BB\u30B0\u30E1\u30F3\u30C8 {0} \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
XSDA8.S=\u30AF\u30E9\u30B9 {0} \u306E\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u53EF\u80FD\u307E\u305F\u306F SQLData \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30EA\u30B9\u30C8\u30A2\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F
XBM0Q.D=\u30D5\u30A1\u30A4\u30EB {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002 \u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30B3\u30D4\u30FC\u304C\u6B63\u3057\u3044\u3082\u306E\u3067\u3042\u308A\u3001\u305D\u308C\u304C\u7834\u58CA\u3055\u308C\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XJ121.S=\u73FE\u884C\u30AB\u30FC\u30BD\u30EB\u4F4D\u7F6E\u3067\u306E\u7121\u52B9\u306A\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3067\u3059\u3002
42509=\u6307\u5B9A\u3055\u308C\u305F\u4ED8\u4E0E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u307E\u305F\u306F\u53D6\u308A\u6D88\u3057\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 ''{0}'' \u306B\u5BFE\u3057\u3066\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
XJ004.C=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
