#Thu May 16 17:55:33 BRT 2013
XSAJ2.U=Anzahl der besuchten Zeilen
XIE0R.S=Importfehler in Zeile {0} der Datei {1}\: {2} 
54038=Die maximale Verschachtelungstiefe f\u00FCr Ausl\u00F6ser wurde \u00FCberschritten.
57017.C=Eine Konvertierung von der Quellen-Codepage {0} in die Ziel-Codepage {1} ist nicht verf\u00FCgbar. Die Verbindung wurde beendet.
42XA7=''{0}'' ist eine generierte Spalte. Sie k\u00F6nnen ihren Standardwert nicht \u00E4ndern.
42734=Der im Kontext ''{1}'' angegebene Name ''{0}'' ist nicht eindeutig.
XJ013.S=Keine ID f\u00FCr benannte Sicherungspunkte.
XJ112.S=Es wurde eine Sicherheitsausnahme festgestellt. Details enth\u00E4lt die n\u00E4chste Ausnahme.
XCXE0.S=Sie versuchen, eine Operation auszuf\u00FChren, die das Gebietsschema der Datenbank verwendet. F\u00FCr die Datenbank ist jedoch kein Gebietsschema festgelegt.
XJ211.S=W\u00E4hrend der Batch-Verarbeitung ist eine Kettenunterbrechungsausnahme eingetreten, nach der keine Wiederherstellung m\u00F6glich ist. Der Batch wird nicht atomar beendet.
XJ040.C=Die Datenbank ''{0}'' konnte nicht mit dem Klassenladeprogramm {1} gestartet werden. Details k\u00F6nnen Sie der n\u00E4chsten Ausnahme entnehmen.
42824=Ein Operand von LIKE ist keine Zeichenfolge, oder der erste Operand ist keine Spalte.
XSCB8.S=Das B-Baum-Konglomerat {0} ist geschlossen.
XSAI3.S=Ein Feature ist nicht implementiert.
A001=SCHWERWIEGENDER FEHLER\: Es gibt keinen Authentifizierungsservice f\u00FCr das System.
42815.S.171=Die Argumente ''{0}'' und ''{1}'' sind nach Datentyp, L\u00E4nge oder Argumentwerten inkompatibel.
42ZB4=''{0}''.{1}'' identifiziert keine Tabellenfunktion.
XJ103.S=Der Tabellenname muss ungleich null sein.
XSLA0.D=Die freigegebene Protokolldatei kann nicht auf den Datentr\u00E4ger {0} geschrieben werden.
58016.C=Der DDM-Parameter 0x{0} wird nicht unterst\u00FCtzt. Die Verbindung wurde beendet.
XJ202.S=Ung\u00FCltiger Cursorname ''{0}''
XSDG2.D=Ung\u00FCltige Kontrollsumme auf der Seite {0}. Erwartet\: {1}, Version auf Datentr\u00E4ger\: {2}. Seitenspeicherauszug\: {3}
XSDB7.D=WARNUNG\: Derby (Instanz {0}) versucht, die Datenbank {1} zu booten, obwohl Derby (Instanz {2}) noch aktiv sein k\u00F6nnte. Eine Datenbank sollte immer nur von jeweils einer Derby-Instanz gebootet werden. Es k\u00F6nnen schwerwiegende und irreparable Sch\u00E4den eingetreten sein oder noch eintreten.
XJ022.S=Der folgende Datenstrom kann nicht definiert werden\: ''{0}''.
42815.S.713=Der Ersatzwert f\u00FCr ''{0}'' ist ung\u00FCltig.
XSDF3.S=Das Segment {0} kann nicht erstellt werden.
XSDA8.S=Ausnahme beim Wiederherstellen eines serialisierbaren oder SQLData-Objekts der Klasse {0}.
XBM0Q.D=Die Datei {0} wurde nicht gefunden. Vergewissern Sie sich, dass es sich um die richtige Sicherungskopie handelt und dass diese nicht besch\u00E4digt ist.
XJ121.S=Ung\u00FCltige Operation an der aktuellen Cursorposition
42509=Die angegebene Operation GRANT oder REVOKE ist f\u00FCr das Objekt ''{0}'' nicht zul\u00E4ssig.
XJ004.C=Die Datenbank ''{0}'' wurde nicht gefunden.
