#Thu May 16 17:55:33 BRT 2013
XSAJ2.U=N\u00FAmero de filas visitadas
XIE0R.S=Error de importaci\u00F3n en la l\u00EDnea {0} del archivo {1}\: {2} 
54038=Se ha excedido la profundidad m\u00E1xima de desencadenantes anidados.
57017.C=No existe ninguna conversi\u00F3n disponible para la p\u00E1gina de c\u00F3digos de origen, {0}, a la p\u00E1gina de c\u00F3digos de destino, {1}.  La conexi\u00F3n se ha finalizado.
42XA7=''{0}'' es una columna generada. No puede cambiar su valor predeterminado.
42734=El nombre ''{0}'' especificado en el contexto ''{1}'' no es \u00FAnico.
XJ013.S=No hay ID para SAVEPOINT con nombre.
XJ112.S=Se ha encontrado una excepci\u00F3n de seguridad, consulte la excepci\u00F3n siguiente para obtener detalles.
XCXE0.S=Est\u00E1 intentando realizar una operaci\u00F3n que utiliza el territorio de la base de datos, pero la base de datos no dispone de un territorio.
XJ211.S=Se ha producido una excepci\u00F3n de ruptura de cadena no recuperable durante el proceso por lotes. El proceso por lotes finaliza de manera no at\u00F3mica.
XJ040.C=No se ha podido iniciar la base de datos ''{0}'' con el cargador de clases {1}, consulte la excepci\u00F3n siguiente para obtener detalles.
42824=Un operando de LIKE no es una serie, o el primer operando no es una columna.
XSCB8.S=El conglomerado btree {0} est\u00E1 cerrado.
XSAI3.S=Caracter\u00EDstica no implementada.
A001=MUY GRAVE\: no existe servicio de autenticaci\u00F3n para el sistema
42815.S.171=El tipo de datos, longitud o valor de argumentos ''{0}'' y ''{1}'' es incompatible.
42ZB4=''{0}''.{1}'' no identifica una funci\u00F3n de tabla.
XJ103.S=El nombre de tabla no puede ser nulo
XSLA0.D=No se puede enviar el archivo de anotaciones cronol\u00F3gicas al disco {0}.
58016.C=El par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
XJ202.S=Nombre de cursor no v\u00E1lido ''{0}''.
XSDG2.D=Suma de comprobaci\u00F3n no v\u00E1lida en la p\u00E1gina {0}, se esperaba {1}, versi\u00F3n en disco {2}, vuelco de p\u00E1gina\: {3}
XSDB7.D=AVISO\: Derby (instancia {0}) est\u00E1 intentando arrancar la base datos {1} a pesar de que Derby (instancia {2}) pueda seguir activo.  S\u00F3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Pueden producirse da\u00F1os graves y no recuperables aunque podr\u00EDan haberse producido ya.
XJ022.S=No es posible establecer la corriente\: ''{0}''.
42815.S.713=El valor de sustituci\u00F3n para ''{0}'' no es v\u00E1lido.
XSDF3.S=No se puede crear el segmento {0}.
XSDA8.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto serializable o SQLData de clase {0}
XBM0Q.D=No se encontr\u00F3 el archivo {0}. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
XJ121.S=Operaci\u00F3n no v\u00E1lida en la posici\u00F3n actual del cursor.
42509=La operaci\u00F3n de otorgar o revocar especificada no se permite en el objeto ''{0}''.
XJ004.C=Base de datos ''{0}'' no encontrada.
