#Thu May 16 17:55:33 BRT 2013
XSAJ2.U=Megl\u00E1togatott sorok sz\u00E1ma
54038=A be\u00E1gyazott triggerek t\u00FAll\u00E9pt\u00E9k a maxim\u00E1lis m\u00E9lys\u00E9get.
57017.C=Nem \u00E9rhet\u0151 el \u00E1talak\u00EDt\u00E1s a forr\u00E1s k\u00F3dlapr\u00F3l ({0}) a c\u00E9l k\u00F3dlapra ({1}).  A kapcsolat lez\u00E1r\u00E1sra ker\u00FClt.
42734=A(z) ''{1}'' kontextusban megadott ''{0}'' n\u00E9v nem egyedi.
XJ013.S=A megnevezett ment\u00E9si pontokhoz nem tal\u00E1lhat\u00F3 azonos\u00EDt\u00F3.
XJ112.S=Biztons\u00E1gi kiv\u00E9tel t\u00F6rt\u00E9nt. R\u00E9szletek\u00E9rt tekintse meg a kiv\u00E9telt.
XCXE0.S=Az adatb\u00E1zis ter\u00FClet\u00E9t haszn\u00E1l\u00F3 m\u0171veletet pr\u00F3b\u00E1l v\u00E9grehajtani, de az adatb\u00E1zis nem rendelkezik ter\u00FClettel.
XJ211.S=Nem vissza\u00E1ll\u00EDthat\u00F3 l\u00E1ncmegszak\u00EDt\u00F3 kiv\u00E9tel t\u00F6rt\u00E9nt a k\u00F6tegelt feldolgoz\u00E1s sor\u00E1n. A k\u00F6teg nem atomi m\u00F3don z\u00E1rult le.
XJ040.C=A(z) ''{0}'' adatb\u00E1zis ind\u00EDt\u00E1sa meghi\u00FAsult, r\u00E9szlek\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt.
42824=A LIKE operandusa nem karaktersorozat, vagy az els\u0151 operandus nem oszlop.
XSCB8.S=A(z) {0} b-fa konglomer\u00E1tum be van z\u00E1rva.
XSAI3.S=A szolg\u00E1ltat\u00E1s nincs megval\u00F3s\u00EDtva.
A001=FATAL\: A rendszerhez nem tal\u00E1lhat\u00F3 hiteles\u00EDt\u00E9si szolg\u00E1ltat\u00E1s
42815.S.171=A(z) ''{0}'' \u00E9s ''{1}'' argumentum adatt\u00EDpusa, hossza vagy \u00E9rt\u00E9ke nem kompatibilis.
XJ103.S=A t\u00E1blan\u00E9v nem lehet \u00FCres
XSLA0.D=A napl\u00F3f\u00E1jl nem \u00EDrhat\u00F3 ki a(z) {0} lemezre.
58016.C=A 0x{0} DDM param\u00E9ter nem t\u00E1mogatott.  A kapcsolat lez\u00E1r\u00E1sra ker\u00FClt.
XJ202.S=\u00C9rv\u00E9nytelen kurzorn\u00E9v\: ''{0}''.
XSDG2.D=\u00C9rv\u00E9nytelen ellen\u0151rz\u0151 \u00F6sszeg a(z) {0} oldalon, v\u00E1rt\={1}, a lemezen tal\u00E1lhat\u00F3 v\u00E1ltozat\={2}, az oldalki\u00EDrat\u00E1s a k\u00F6vetkez\u0151\: {3}
XSDB7.D=FIGYELMEZTET\u00C9S\: a Derby (p\u00E9ld\u00E1ny\: {0}) megpr\u00F3b\u00E1l bel\u00E9pni a(z) {1} adatb\u00E1zisba, noha lehets\u00E9ges, hogy a Derby (p\u00E9ld\u00E1ny\: {2}) m\u00E9g mindig akt\u00EDv.  Ugyanazon adatb\u00E1zisba egyszerre csak a Derby egy p\u00E9ld\u00E1nya l\u00E9phet be. Ez s\u00FAlyos \u00E9s helyre\u00E1ll\u00EDthatatlan s\u00E9r\u00FCl\u00E9seket eredm\u00E9nyezhet \u00E9s tal\u00E1n m\u00E1r eredm\u00E9nyezett is.
XJ022.S=Folyamok nem \u00E1ll\u00EDthat\u00F3k be\: ''{0}''.
42815.S.713=A(z) ''{0}'' helyettes\u00EDt\u0151 \u00E9rt\u00E9ke \u00E9rv\u00E9nytelen.
XSDF3.S=Nem hozhat\u00F3 l\u00E9tre a(z) {0} szegmens.
XSDA8.S=A(z) {0} oszt\u00E1ly egy soros\u00EDthat\u00F3 vagy SQLData objektum\u00E1nak vissza\u00E1ll\u00EDt\u00E1sa sor\u00E1n kiv\u00E9tel t\u00F6rt\u00E9nt
XBM0Q.D=A(z) {0} f\u00E1jl nem tal\u00E1lhat\u00F3. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a biztons\u00E1gi m\u00E1solat megfelel\u0151 \u00E9s nem s\u00E9r\u00FClt.
XJ121.S=\u00C9rv\u00E9nytelen m\u0171velet az aktu\u00E1lis kurzorpoz\u00EDci\u00F3n.
42509=A megadott feljogos\u00EDt\u00E1s vagy visszavon\u00E1s m\u0171velet ''{0}'' objektumon nem enged\u00E9lyezett.
XJ004.C=A(z) ''{0}'' adatb\u00E1zis nem tal\u00E1lhat\u00F3.
