#Thu May 16 17:55:33 BRT 2013
XN010.S=Az elj\u00E1r\u00E1sn\u00E9v nem lehet \u00FCres.
XJ050.U=Az adatb\u00E1zis {0} v\u00E1ltozatr\u00F3l friss\u00EDteni kell. \u00C1ll\u00EDtsa be az ''upgrade\=true'' attrib\u00FAtumot a JDBC kapcsolat URL c\u00EDmben a(z) {1} v\u00E1ltozatra val\u00F3 friss\u00EDt\u00E9s enged\u00E9lyez\u00E9se \u00E9rdek\u00E9ben.
A020=\u00C9rv\u00E9nytelen hiteles\u00EDt\u00E9s.
XSLA1.D=Napl\u00F3bejegyz\u00E9s ker\u00FClt k\u00FCld\u00E9sre az adatfolyamba, de az nem alkalmazhat\u00F3 a t\u00E1rol\u00F3ra (Objektum\: {0}).  Ez helyre\u00E1ll\u00EDt\u00E1si probl\u00E9m\u00E1kat is okozhat.
XJ104.S=A megosztott kulcshossz \u00E9rv\u00E9nytelen\: {0}.
58017.C=A 0x{0} DDM param\u00E9ter\u00E9rt\u00E9k nem t\u00E1mogatott.  Elk\u00E9pzelhet\u0151, hogy a bemeneti gazda v\u00E1ltoz\u00F3 nem a kiszolg\u00E1l\u00F3 \u00E1ltal t\u00E1mogatott tartom\u00E1nyba esik.  A kapcsolat lez\u00E1r\u00E1sra ker\u00FClt.
XSDG3.D=A(z) {0} t\u00E1rol\u00F3 metaadatai nem \u00E9rhet\u0151k el
XJ203.S=A(z) ''{0}'' kurzor m\u00E1r haszn\u00E1latban van
XSDB8.D=FIGYELMEZTET\u00C9S\: a Derby (p\u00E9ld\u00E1ny\: {0}) megpr\u00F3b\u00E1l bel\u00E9pni a(z) {1} adatb\u00E1zisba, noha lehets\u00E9ges, hogy a Derby (p\u00E9ld\u00E1ny\: {2}) m\u00E9g mindig akt\u00EDv.  Ugyanazon adatb\u00E1zisba egyszerre csak a Derby egy p\u00E9ld\u00E1nya l\u00E9phet be. S\u00FAlyos \u00E9s helyre\u00E1ll\u00EDthatatlan s\u00E9r\u00FCl\u00E9seket eredm\u00E9nyezhet, ha a Derby k\u00E9t p\u00E9ld\u00E1nya l\u00E9p be egyidej\u0171leg ugyanabba az adatb\u00E1zisba.  A derby.database.forceDatabaseLock\=true tulajdons\u00E1g be\u00E1ll\u00EDt\u00E1sra ker\u00FClt, \u00EDgy az adatb\u00E1zis nem indul el, am\u00EDg a db.lck jelen van.  Norm\u00E1lis esetben ez a f\u00E1jl elt\u00E1vol\u00EDt\u00E1sra ker\u00FCl a Derby adatb\u00E1zisba bel\u00E9pett els\u0151 p\u00E9ld\u00E1ny\u00E1nak kil\u00E9p\u00E9se ut\u00E1n, de egyes le\u00E1ll\u00EDt\u00E1sok eset\u00E9n visszamaradhat.  Ebben az esetben a f\u00E1jlt saj\u00E1t kez\u0171leg kell elt\u00E1vol\u00EDtania.  A db.lck t\u00F6rl\u00E9se el\u0151tt fontos ellen\u0151rizni, hogy m\u00E1s VM nem f\u00E9r hozz\u00E1 az adatb\u00E1zishoz.
XJ023.S=A bemen\u0151 folyam nem pontosan a k\u00E9rt hossznyi mennyis\u00E9g\u0171 adattal rendelkezik.
XSAM0.S=Kiv\u00E9tel t\u00F6rt\u00E9nt modul ind\u00EDt\u00E1s\u00E1ra tett k\u00EDs\u00E9rlet sor\u00E1n a k\u00F6vetkez\u0151h\u00F6z\: ''{0}''.
XSDF4.S=Kiv\u00E9tel t\u00F6rt\u00E9nt a(z) {0} f\u00E1jl elt\u00E1vol\u00EDt\u00E1sa sor\u00E1n a megsz\u00FCntetett t\u00E1rol\u00F3hoz. A f\u00E1jl nem t\u00E1vol\u00EDthat\u00F3 el\: {1}.
XBM0R.D=A(z) {0} f\u00E1jl nem t\u00E1vol\u00EDthat\u00F3 el.  
XSDA9.S=A(z) {0} oszt\u00E1ly egy soros\u00EDthat\u00F3 vagy SQLData objektum\u00E1nak vissza\u00E1ll\u00EDt\u00E1sa sor\u00E1n az oszt\u00E1ly nem tal\u00E1lhat\u00F3
XJ122.S=A soron nem ker\u00FCl megh\u00EDv\u00E1sra updateXXX met\u00F3dus.
A002=FATAL\: Az adatb\u00E1zishoz nem tal\u00E1lhat\u00F3 hiteles\u00EDt\u00E9si szolg\u00E1ltat\u00E1s
XN001.S=A kapcsolat-vissza\u00E1ll\u00EDt\u00E1s munkaegys\u00E9gen bel\u00FCl nem enged\u00E9lyezett.
XSAJ3.U=Megl\u00E1togatott t\u00F6r\u00F6lt sorok sz\u00E1ma
42915=A(z) ''{0}'' idegen kulcs ''{1}'' miatt \u00E9rv\u00E9nytelen. 
42834=A SET NULL nem adhat\u00F3 meg, mivel a(z) ''{0}'' FOREIGN KEY nem tartalmazhat null\u00E9rt\u00E9keket.  
XJ014.S=A n\u00E9vtelen ment\u00E9si pontokhoz nem tal\u00E1lhat\u00F3 n\u00E9v.
C000=A(z) {0} oszt\u00E1ly a(z) {1} f\u00E1jlba lett \u00EDrva. Biztos\u00EDtson t\u00E1mogat\u00E1st a f\u00E1jlhoz \u00E9s a k\u00F6vetkez\u0151 kiv\u00E9telinform\u00E1ci\u00F3khoz\: {2}
A011=WARNING\: A(z) {0} tulajdons\u00E1gban nincs eml\u00EDtve LDAP kiszolg\u00E1l\u00F3/gazdan\u00E9v; felt\u00E9telezett localhost\:389
XJ113.S=A(z) {0} f\u00E1jl nem nyithat\u00F3 meg\: {1}
XJ041.C=A(z) ''{0}'' adatb\u00E1zis l\u00E9trehoz\u00E1sa meghi\u00FAsult, r\u00E9szletek\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt.
XJ212.S=\u00C9rv\u00E9nytelen attrib\u00FAtumszintaxis\: {0}
XSCB9.S=Fenntartva tesztel\u00E9sre.
