#Thu May 16 17:55:33 BRT 2013
XN010.S=O nome do procedimento n\u00E3o pode ser nulo.
XJ050.U=O banco de dados requer atualiza\u00E7\u00E3o da vers\u00E3o {0}, defina o atributo ''upgrade\=true'' na URL de conex\u00E3o JDBC para permitira atualiza\u00E7\u00E3o para a vers\u00E3o {1}.
A020=Autentica\u00E7\u00E3o inv\u00E1lida.
XSLA1.D=O Registro de Log foi enviado para o fluxo, mas o mesmo n\u00E3o pode ser aplicado no armazenamento (Objeto {0}).  Isto tamb\u00E9m pode causar problemas de recupera\u00E7\u00E3o.
XJ104.S=O comprimento da chave compartilhada n\u00E3o \u00E9 v\u00E1lido\: {0}.
58017.C=O valor do par\u00E2metro DDM 0x{0} n\u00E3o \u00E9 suportado.  Uma vari\u00E1vel hospedeira de entrada pode n\u00E3o estar no intervalo que o servidor admite.  A conex\u00E3o foi encerrada.
XSDG3.D=N\u00E3o foi poss\u00EDvel acessar os metadados do cont\u00EAiner {0}
XJ203.S=O cursor com nome ''{0}'' j\u00E1 est\u00E1 em uso.
XSDB8.D=AVISO\: O Derby (inst\u00E2ncia {0}) est\u00E1 tentando inicializar o banco de dados {1}, embora o Derby (inst\u00E2ncia {2}) ainda possa estar ativo.  Apenas uma inst\u00E2ncia do Derby deve inicializar um banco de dados de cada vez. Pode resultar em danos graves e irrecuper\u00E1veis quando 2 inst\u00E2ncias do Derby inicializam o mesmo banco de dados ao mesmo tempo.  A propriedade derby.database.forceDatabaseLock\=true foi definida, portanto, o banco de dados n\u00E3o ser\u00E1 inicializado at\u00E9 que db.lck n\u00E3o esteja mais presente.  Normalmente, esse arquivo \u00E9 removido quando a primeira inst\u00E2ncia do Derby que inicializou o banco de dados termina, mas pode ser abandonado no encerramento.  Nesse caso, ser\u00E1 necess\u00E1rio remover o arquivo manualmente.  \u00C9 importante verificar se nenhuma outra VM est\u00E1 acessando o banco de dados antes de remover manualmente o arquivo db.lck.
XJ023.S=O fluxo de entrada n\u00E3o cont\u00E9m a quantidade exata de dados do comprimento requisitado.
XSAM0.S=Exce\u00E7\u00E3o encontrada ao tentar inicializar o m\u00F3dulo para ''{0}''.
XSDF4.S=Ocorreu uma exce\u00E7\u00E3o durante a remo\u00E7\u00E3o do arquivo {0} do cont\u00EAiner eliminado, o arquivo n\u00E3o p\u00F4de ser removido {1}.
XBM0R.D=N\u00E3o foi poss\u00EDvel remover o arquivo {0}.
XSDA9.S=Classe n\u00E3o encontrada durante a restaura\u00E7\u00E3o de um objeto SQLData ou seri\u00E1vel da classe {0}
XJ122.S=N\u00E3o foi chamado nenhum m\u00E9todo updateXXX para esta linha.
A002=FATAL\: N\u00E3o h\u00E1 nenhum Servi\u00E7o de Autentica\u00E7\u00E3o para o banco de dados
XN001.S=N\u00E3o \u00E9 permitida a redefini\u00E7\u00E3o da conex\u00E3o quando se est\u00E1 dentro de uma unidade de trabalho.
XSAJ3.U=N\u00FAmero de linhas visitadas exclu\u00EDdas
42915=A chave estrangeira ''{0}'' n\u00E3o \u00E9 v\u00E1lida, porque ''{1}''.
42834=SET NULL n\u00E3o pode ser especificado, porque FOREIGN KEY ''{0}'' n\u00E3o pode conter valores nulos.
XJ014.S=Nenhum nome para pontos de salvamento sem nome.
C000=Escrita a classe {0} no arquivo {1}. Por favor forne\u00E7a ao suporte este arquivo e as seguintes informa\u00E7\u00F5es de exce\u00E7\u00E3o\: {2}
A011=ADVERT\u00CANCIA\: Nenhum nome de Hospedeiro/Servidor LDAP mencionado na propriedade {0}; assumindo localhost\:389
XJ113.S=N\u00E3o foi poss\u00EDvel abrir o arquivo {0} \: {1}
XJ041.C=Falha ao criar o banco de dados ''{0}'', consulte a pr\u00F3xima exce\u00E7\u00E3o para obter detalhes.
XJ212.S=A sintaxe do atributo n\u00E3o \u00E9 v\u00E1lida\: {0}
XSCB9.S=Reservado para teste.
