#Thu May 16 17:55:33 BRT 2013
XN010.S=Il nome della procedura non pu\u00F2 essere nullo.
42XA8=Non \u00E8 possibile rinominare ''{0}'' poich\u00E9 \u00E8 utilizzato come riferimento dalla clausola di generazione della colonna ''{1}''.
XJ050.U=\u00C8 necessario aggiornare il database dalla versione {0}, impostare l''attributo ''upgrade\=true'' sull''URL della connessione JDBC per consentire l''aggiornamento alla versione {1}.
A020=Autenticazione non valida.
XSLA1.D=Record di log inviato al flusso ma non applicabile alla memoria (Oggetto {0}).  Ci\u00F2 pu\u00F2 causare dei problemi di ripristino.
XJ104.S=Lunghezza chiave condivisa non valida\: {0}.
58017.C=Il valore del parametro DDM 0x{0} non \u00E8 supportato.  E'' possibile che una variabile host di input non sia presente nell''intervallo che il server supporta.  La connessione \u00E8 stata terminata.
XSDG3.D=Impossibile accedere ai metadati di {0} per {1} {2}
XJ203.S=Nome cursore ''{0}'' gi\u00E0 in uso
XSDB8.D=AVVERTENZA\: Derby (istanza {0}) sta tentando di avviare il database {1} anche se Derby (istanza {2}) potrebbe essere ancora attivo. Ogni database deve essere avviato da una singola istanza di Derby. Se due istanze di Derby avviano lo stesso database contemporaneamente, potrebbe verificarsi un errore grave o irreversibile. La propriet\u00E0 derby.database.forceDatabaseLock\=true \u00E8 stata impostata, pertanto il database non verr\u00E0 avviato fino a quando db.lck non verr\u00E0 rimosso. In genere tale file viene rimosso alla chiusura della prima istanza di Derby che avvia il database, tuttavia in alcune occasioni ci\u00F2 non si verifica. In tal caso, il file dovr\u00E0 essere rimosso manualmente. Prima di eliminare il file db.lck manualmente, \u00E8 importante verificare che nessun''altra macchina virtuale acceda al database.
XJ023.S=Il flusso di input non disponeva la quantit\u00E0 esatta di dati della lunghezza richiesta.
XSAM0.S=Eccezione riscontrata durante il tentativo di avviare il modulo per ''{0}''.
XSDF4.S=Eccezione durante la rimozione del file {0} per il contenitore rilasciato; impossibile eliminare il file {1}.
XBM0R.D=Impossibile eliminare il file {0}.  
XSDA9.S=Classe non trovata durante il ripristino di un oggetto serializzabile o SQLData della classe {0}
XJ122.S=Nessun metodo updateXXX \u00E8 stato richiamato su questa riga.
A002=IRREVERSIBILE\: non esiste alcun Servizio di autenticazione per il database
XN001.S=Reimpostazione della connessione non consentita all''interno di un''unit\u00E0 di lavoro.
XSAJ3.U=Numero di righe eliminate visitate
42915=La chiave esterna ''{0}'' non \u00E8 valida perch\u00E9 ''{1}''. 
XIE0S.S=L''operazione di esportazione non \u00E8 stata eseguita in quanto il file di output specificato ({0}) esiste gi\u00E0. L''operazione di esportazione non sovrascrive i file esistenti anche quando il processo dispone delle necessarie autorizzazioni in scrittura, per ragioni di sicurezza e per impedire la perdita accidentale di dati. Modificare il nome del file di output negli argomenti della procedura di esportazione oppure eliminare il file esistente e quindi ritentare la procedura.
42ZB5=La classe ''{0}'' implementa VTICosting ma non fornisce un costruttore pubblico di tipo non argomento.
42834=Impossibile specificare SET NULL poich\u00E9 FOREIGN KEY ''{0}'' non pu\u00F2 contenere valori nulli.  
XJ014.S=Nessun nome per i savepoint che non sono denominati.
C000=Classe {0} scritta sul file {1}. Fornire il supporto tramite il file e le seguenti informazioni relative all''eccezione\: {2}
A011=AVVERTENZA\: nessun nome Server/Host LDAP menzionato nella propriet\u00E0 {0}; utilizzo di localhost\:389
XJ113.S=Impossibile aprire il file {0} \: {1}
XJ041.C=Impossibile creare il database ''{0}''; per i dettagli consultare l''eccezione successiva.
XJ212.S=Sintassi dell''attributo non valida\: {0}
XSCB9.S=Riservato per scopi di test.
