#Thu May 16 17:55:33 BRT 2013
XN010.S=Jm\u00E9no procedury nesm\u00ED m\u00EDt hodnotu ''null''.
XJ050.U=Datab\u00E1ze po\u017Eaduje upgrade z verze {0}. Nastavte atribut ''upgrade\=true'' adresy URL p\u0159ipojen\u00ED JDBC, abyste povolili upgrade na verzi {1}.
A020=Neplatn\u00E9 ov\u011B\u0159en\u00ED.
XSLA1.D=Z\u00E1znam protokolu byl odesl\u00E1n do toku dat, ale nelze jej pou\u017E\u00EDt na pam\u011B\u0165 (objekt {0}). To rovn\u011B\u017E m\u016F\u017Ee zp\u016Fsobit probl\u00E9my se zotaven\u00EDm.
XJ104.S=D\u00E9lka sd\u00EDlen\u00E9ho kl\u00ED\u010De je neplatn\u00E1\: {0}.
58017.C=Hodnota parametru DDM 0x{0} nen\u00ED podporov\u00E1na. Vstupn\u00ED prom\u011Bnn\u00E1 hostitele nemus\u00ED b\u00FDt v rozsahu, kter\u00FD server podporuje. Spojen\u00ED bylo ukon\u010Deno.
XSDG3.D=Nebylo mo\u017En\u00E9 p\u0159istoupit k metadat\u016Fm pro kontejner {0}
XJ203.S=Jm\u00E9no kurzoru ''{0}'' je ji\u017E pou\u017E\u00EDv\u00E1no
XSDB8.D=VAROV\u00C1N\u00CD\: Server Derby (instance {0}) se pokou\u0161\u00ED zav\u00E9st datab\u00E1zi {1}, a\u010Dkoliv m\u016F\u017Ee b\u00FDt st\u00E1le aktivn\u00ED server Derby (instance {2}). V dan\u00E9m okam\u017Eiku by m\u011Bla zav\u00E1d\u011Bt datab\u00E1zi pouze jedin\u00E1 instance serveru Derby. Pokud dv\u011B instance serveru Derby zav\u00E1d\u011Bj\u00ED tut\u00E9\u017E datab\u00E1zi sou\u010Dasn\u011B, m\u016F\u017Ee nastat z\u00E1va\u017En\u00E9 a neopraviteln\u00E9 poru\u0161en\u00ED. Byla nastavena vlastnost derby.database.forceDatabaseLock\=true, tak\u017Ee datab\u00E1ze nebude zavedena, dokud nebude odstran\u011Bn soubor db.lck. Tento soubor je obvykle odstran\u011Bn, kdy\u017E se ukon\u010D\u00ED prvn\u00ED instance serveru Derby, kter\u00E1 m\u00E1 zav\u00E9st datab\u00E1zi, ale v n\u011Bkter\u00FDch p\u0159\u00EDpadech vypnut\u00ED m\u016F\u017Ee b\u00FDt ponech\u00E1n. V t\u011Bchto p\u0159\u00EDpadech je nutn\u00E9 odstranit soubor ru\u010Dn\u011B. P\u0159ed ru\u010Dn\u00EDm v\u00FDmazem souboru db.lck je d\u016Fle\u017Eit\u00E9 ov\u011B\u0159it, \u017Ee k datab\u00E1zi nep\u0159istupuje \u017E\u00E1dn\u00FD jin\u00FD VM.
XJ023.S=Vstupn\u00ED tok dat nem\u011Bl p\u0159esn\u00E9 mno\u017Estv\u00ED dat jako po\u017Eadovan\u00E1 d\u00E9lka.
XSAM0.S=Byla zji\u0161t\u011Bna v\u00FDjimka p\u0159i pokusu o zaveden\u00ED modulu pro ''{0}''.
XSDF4.S=Do\u0161lo k v\u00FDjimce b\u011Bhem odstra\u0148ov\u00E1n\u00ED souboru {0} pro uvoln\u011Bn\u00FD kontejner. Soubor nebyl odstran\u011Bn {1}.
XBM0R.D=Nelze odstranit soubor {0}.  
XSDA9.S=B\u011Bhem obnovy serializovateln\u00E9ho objektu nebo objektu SQLData t\u0159\u00EDdy {0} nebyla nalezena t\u0159\u00EDda
XJ122.S=Nebyly vol\u00E1ny \u017E\u00E1dn\u00E9 metody updateXXX na tomto \u0159\u00E1dku.
A002=FAT\u00C1LN\u00CD CHYBA\: Neexistuje ov\u011B\u0159ovac\u00ED slu\u017Eba pro datab\u00E1zi
XN001.S=Resetov\u00E1n\u00ED p\u0159ipojen\u00ED nen\u00ED povoleno, kdy\u017E jste uvnit\u0159 jednotky pr\u00E1ce.
XSAJ3.U=Po\u010Det vymazan\u00FDch nav\u0161t\u00EDven\u00FDch \u0159\u00E1dk\u016F
42915=Ciz\u00ED kl\u00ED\u010D ''{0}'' je neplatn\u00FD kv\u016Fli ''{1}''. 
42834=Nelze uv\u00E9st SET NULL, proto\u017Ee CIZ\u00CD KL\u00CD\u010C ''{0}'' nem\u016F\u017Ee obsahovat hodnoty ''null''. 
XJ014.S=\u017D\u00E1dn\u00E9 jm\u00E9no pro nejmenovan\u00E9 body ulo\u017Een\u00ED.
C000=T\u0159\u00EDda {0} byla zaps\u00E1na do souboru {1}. Poskytn\u011Bte podpo\u0159e soubor a n\u00E1sleduj\u00EDc\u00ED informace o v\u00FDjimce\: {2}
A011=VAROV\u00C1N\u00CD\: Ve vlastnosti {0} nebylo uvedeno jm\u00E9no serveru/hostitele LDAP; p\u0159edpokl\u00E1d\u00E1 se localhost\:389
XJ113.S=Nelze otev\u0159\u00EDt soubor {0} \: {1}
XJ041.C=Selh\u00E1n\u00ED vytvo\u0159en\u00ED datab\u00E1ze ''{0}''; podrobnosti viz dal\u0161\u00ED v\u00FDjimka.
XJ212.S=Neplatn\u00E1 syntaxe atributu\: {0}
XSCB9.S=Rezervov\u00E1no pro testov\u00E1n\u00ED.
