#Thu May 16 17:55:33 BRT 2013
XN010.S=\u0418\u043C\u044F \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u044B \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043D\u0443\u043B\u0435\u0432\u044B\u043C.
XJ050.U=\u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 \u0438\u0437 \u0432\u0435\u0440\u0441\u0438\u0438 {0}; \u0437\u0430\u0434\u0430\u0439\u0442\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 ''upgrade\=true'' \u0432 URL \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F JDBC, \u0447\u0442\u043E\u0431\u044B \u0440\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044C \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0435 \u0434\u043E \u0432\u0435\u0440\u0441\u0438\u0438 {1}.
A020=\u041D\u0435\u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u0430\u044F \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F.
XSLA1.D=\u0417\u0430\u043F\u0438\u0441\u044C \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0430 \u0432 \u043F\u043E\u0442\u043E\u043A, \u043D\u043E \u0435\u0435 \u043D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u0438\u043C\u0435\u043D\u0438\u0442\u044C \u043A \u0441\u043A\u043B\u0430\u0434\u0443 (\u043E\u0431\u044A\u0435\u043A\u0442 {0}).  \u042D\u0442\u043E \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442 \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u043E\u0448\u0438\u0431\u043A\u0438 \u043F\u0440\u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438.
XJ104.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0434\u043B\u0438\u043D\u0430 \u0441\u043E\u0432\u043C\u0435\u0441\u0442\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430\: {0}.
58017.C=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 DDM 0x{0} \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F.  \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0432\u0432\u0435\u0434\u0435\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u0445\u043E\u0441\u0442\u0430 \u043D\u0435 \u0443\u043A\u043B\u0430\u0434\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D, \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u044B\u0439 \u0441\u0435\u0440\u0432\u0435\u0440\u043E\u043C.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XSDG3.D=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u043C \u0434\u043B\u044F \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 {0}
XJ203.S=\u0418\u043C\u044F \u043A\u0443\u0440\u0441\u043E\u0440\u0430 ''{0}'' \u0443\u0436\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F.
XSDB8.D=\u041F\u0420\u0415\u0414\u0423\u041F\u0420\u0415\u0416\u0414\u0415\u041D\u0418\u0415\: Derby (\u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 {0}) \u043F\u044B\u0442\u0430\u0435\u0442\u0441\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 {1}, \u0445\u043E\u0442\u044F, \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0435\u0449\u0435 \u0430\u043A\u0442\u0438\u0432\u0435\u043D Derby (\u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 {2}).  \u0417\u0430\u0433\u0440\u0443\u0436\u0430\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 \u043C\u043E\u0436\u0435\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u0438\u043D \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 Derby \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E. \u0415\u0441\u043B\u0438 \u0434\u0432\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 Derby \u043F\u043E\u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044C \u043E\u0434\u043D\u0443 \u0438 \u0442\u0443 \u0436\u0435 \u0431\u0430\u0437\u0443 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E, \u044D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u0438\u0432\u0435\u0441\u0442\u0438 \u043A \u0441\u0435\u0440\u044C\u0435\u0437\u043D\u043E\u043C\u0443 \u0438 \u043D\u0435\u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u043C\u043E\u043C\u0443 \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D\u0438\u044E.  \u0417\u0430\u0434\u0430\u043D\u043E \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E derby.database.forceDatabaseLock\=true, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u0431\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u0441\u044F, \u043F\u043E\u043A\u0430 \u0431\u0443\u0434\u0435\u0442 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C db.lck.  \u041E\u0431\u044B\u0447\u043D\u043E \u044D\u0442\u043E\u0442 \u0444\u0430\u0439\u043B \u0443\u0434\u0430\u043B\u044F\u0435\u0442\u0441\u044F, \u043A\u043E\u0433\u0434\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0430\u0435\u0442 \u0440\u0430\u0431\u043E\u0442\u0443 \u043F\u0435\u0440\u0432\u044B\u0439 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 Derby, \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u044F\u0449\u0438\u0439 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0443 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445, \u043D\u043E \u0432 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0441\u043B\u0443\u0447\u0430\u044F\u0445 \u043E\u043D \u043C\u043E\u0436\u0435\u0442 \u043E\u0441\u0442\u0430\u0432\u0430\u0442\u044C\u0441\u044F \u043F\u0440\u0438 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u0438 \u0440\u0430\u0431\u043E\u0442\u044B.  \u0412 \u0442\u0430\u043A\u0438\u0445 \u0441\u043B\u0443\u0447\u0430\u044F\u0445 \u043F\u0440\u0438\u0434\u0435\u0442\u0441\u044F \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u044D\u0442\u043E\u0442 \u0444\u0430\u0439\u043B \u0432\u0440\u0443\u0447\u043D\u0443\u044E.  \u041F\u0440\u0435\u0436\u0434\u0435 \u0447\u0435\u043C \u0443\u0434\u0430\u043B\u044F\u0442\u044C \u0444\u0430\u0439\u043B db.lck \u0432\u0440\u0443\u0447\u043D\u0443\u044E, \u0432\u0430\u0436\u043D\u043E \u0443\u0434\u043E\u0441\u0442\u043E\u0432\u0435\u0440\u0438\u0442\u044C\u0441\u044F, \u0447\u0442\u043E \u043D\u0438\u043A\u0430\u043A\u0430\u044F \u0434\u0440\u0443\u0433\u0430\u044F VM \u043D\u0435 \u043E\u0431\u0440\u0430\u0449\u0430\u0435\u0442\u0441\u044F \u043A \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445.
XJ023.S=\u0412\u043E \u0432\u0445\u043E\u0434\u043D\u043E\u043C \u043F\u043E\u0442\u043E\u043A\u0435 \u043D\u0435\u0442 \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043C\u0430 \u0434\u0430\u043D\u043D\u044B\u0445, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u044B \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u043B \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u0434\u043B\u0438\u043D\u0435.
XSAM0.S=\u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u043F\u043E\u043F\u044B\u0442\u043A\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044C \u043C\u043E\u0434\u0443\u043B\u044C \u0434\u043B\u044F ''{0}''.
XSDF4.S=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u0438 \u0444\u0430\u0439\u043B\u0430 {0} \u0434\u043B\u044F \u043E\u0442\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430; \u0441\u0442\u0435\u0440\u0435\u0442\u044C \u0444\u0430\u0439\u043B \u043D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C {1}.
XBM0R.D=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u0444\u0430\u0439\u043B {0}.  
XSDA9.S=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u043A\u043B\u0430\u0441\u0441 \u043F\u0440\u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0443\u0435\u043C\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430 \u0438\u043B\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u0430 SQLData \u043A\u043B\u0430\u0441\u0441\u0430 {0}
XJ122.S=\u0414\u043B\u044F \u044D\u0442\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0438 \u043D\u0435 \u0431\u044B\u043B\u043E \u0432\u044B\u0437\u0432\u0430\u043D\u043E \u043D\u0438\u043A\u0430\u043A\u0438\u0445 \u043C\u0435\u0442\u043E\u0434\u043E\u0432 updateXXX.
A002=\u041D\u0415\u0412\u041E\u0421\u0421\u0422\u0410\u041D\u041E\u0412\u0418\u041C\u0410\u042F \u041E\u0428\u0418\u0411\u041A\u0410\: \u041D\u0435\u0442 \u0441\u043B\u0443\u0436\u0431\u044B \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u0434\u043B\u044F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445
XN001.S=\u041F\u0435\u0440\u0435\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0430 \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0435\u0434\u0438\u043D\u0438\u0446\u044B \u0440\u0430\u0431\u043E\u0442\u044B.
XSAJ3.U=\u0427\u0438\u0441\u043B\u043E \u0443\u0434\u0430\u043B\u0435\u043D\u043D\u044B\u0445 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043D\u043D\u044B\u0445 \u0441\u0442\u0440\u043E\u043A
42915=\u0427\u0443\u0436\u043E\u0439 \u043A\u043B\u044E\u0447 ''{0}'' \u043D\u0435\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u0435\u043D, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 ''{1}''. 
42834=\u041D\u0435\u043B\u044C\u0437\u044F \u0443\u043A\u0430\u0437\u0430\u0442\u044C SET NULL, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0447\u0443\u0436\u043E\u0439 \u043A\u043B\u044E\u0447 (FOREIGN KEY) ''{0}'' \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u043D\u0443\u043B\u0435\u0432\u044B\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439.  
XJ014.S=\u041D\u0435\u0442 \u0438\u043C\u0435\u043D\u0438 \u0434\u043B\u044F \u043D\u0435\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F.
C000=\u041A\u043B\u0430\u0441\u0441 {0} \u0437\u0430\u043F\u0438\u0441\u0430\u043D \u0432 \u0444\u0430\u0439\u043B {1}. \u041F\u0435\u0440\u0435\u0434\u0430\u0439\u0442\u0435 \u0441\u043B\u0443\u0436\u0431\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0438 \u044D\u0442\u043E\u0442 \u0444\u0430\u0439\u043B \u0438 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E\u0431 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0438\: {2}
A011=\u041F\u0420\u0415\u0414\u0423\u041F\u0420\u0415\u0416\u0414\u0415\u041D\u0418\u0415\: \u0412 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0435 {0} \u043D\u0435 \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u0438\u043C\u044F \u0441\u0435\u0440\u0432\u0435\u0440\u0430/\u0445\u043E\u0441\u0442\u0430 LDAP; \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u0438\u043D\u044F\u0442\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 localhost\:389
XJ113.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043E\u0442\u043A\u0440\u044B\u0442\u044C \u0444\u0430\u0439\u043B {0} \: {1}
XJ041.C=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 ''{0}''; \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u0432 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0438.
XJ212.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0441\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0441 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430\: {0}
XSCB9.S=\u0417\u0430\u0440\u0435\u0437\u0435\u0440\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F.
