#Thu May 16 17:55:33 BRT 2013
XN010.S=Der Prozedurname muss ungleich null sein.
42XA8=Sie k\u00F6nnen ''{0}'' nicht umbenennen, da die Erstellungsklausel von Spalte ''{1}'' darauf verweist.
XJ050.U=F\u00FCr die Datenbankversion {0} ist ein Upgrade erforderlich. Setzen Sie f\u00FCr den JDBC-Verbindungs-URL das Attribut ''upgrade\=true'', um ein Upgrade auf Version {1} zu erm\u00F6glichen.
A020=Ung\u00FCltige Authentifizierung.
XSLA1.D=Der Protokollsatz wurde an den Datenstrom gesendet, kann jedoch nicht in den Speicher (Objekt {0}) gestellt werden. Dies kann zu Fehlern bei der Wiederherstellung f\u00FChren.
XJ104.S=Ung\u00FCltige L\u00E4nge des gemeinsam genutzten Schl\u00FCssels\: {0}.
58017.C=Der DDM-Parameterwert 0x{0} wird nicht unterst\u00FCtzt. M\u00F6glicherweise liegt eine eingegebene Hostvariable nicht in dem vom Server unterst\u00FCtzten Bereich. Die Verbindung wurde beendet.
XSDG3.D=Auf die Metadaten f\u00FCr {0} konnte nicht zugegriffen werden in {1} {2}
XJ203.S=Der Cursorname ''{0}'' wird bereits verwendet.
XSDB8.D=WARNUNG\: Derby (Instanz {0}) versucht, die Datenbank {1} neu zu booten, obwohl Derby (Instanz {2}) m\u00F6glicherweise immer noch aktiv ist.  Eine Datenbank sollte immer nur von einer Instanz von Derby gebootet werden. Wenn zwei Instanzen von Derby an derselben Datenbank zur selben Zeit einen Bootvorgang durchf\u00FChren, kann dies zu schwerwiegenden und unwiderruflichen Besch\u00E4digungen f\u00FChren.  Die Eigenschaft derby.database.forceDatabaseLock\=true wurde gesetzt, sodass die Datenbank erst dann gebootet wird, wenn die Datei db.lck nicht mehr vorhanden ist.  Normalerweise wird diese Datei entfernt, wenn die erste Instanz von Derby, die einen Bootvorgang an der Datenbank ausf\u00FChrt, vorhanden ist. Sie kann jedoch bei manchen Herunterfahrvorg\u00E4ngen zur\u00FCckbleiben.  In diesem Fall muss die Datei manuell entfernt werden.  Es ist wichtig, dass Sie sicherstellen, dass keine andere VM auf die Datenbank zugreift, bevor Sie die Datei db.lck manuell l\u00F6schen.
XJ023.S=die Datenmenge des Eingabedatenstroms entspricht nicht exakt der angeforderten L\u00E4nge.
XSAM0.S=Bei dem Versuch, ein Modul f\u00FCr ''{0}'' zu booten, ist eine Ausnahme eingetreten.
XSDF4.S=Beim Entfernen der Datei {0} f\u00FCr den gel\u00F6schten Container ist eine Ausnahme eingetreten. Die Datei konnte nicht entfernt werden. {1}.
XBM0R.D=Die Datei {0} kann nicht entfernt werden.
XSDA9.S=Beim Wiederherstellen eines serialisierbaren oder SQLData-Objekts der Klasse {0} wurde die Klasse nicht gefunden.
XJ122.S=F\u00FCr diese Zeile wurden keine updateXXX-Methoden aufgerufen.
A002=SCHWERWIEGENDER FEHLER\: Es gibt keinen Authentifizierungsservice f\u00FCr die Datenbank.
XN001.S=Innerhalb einer Arbeitseinheit ist eine Zur\u00FCcksetzung der Verbindung nicht zul\u00E4ssig.
XSAJ3.U=Anzahl der gel\u00F6schten besuchten Zeilen
42915=Der Fremdschl\u00FCssel ''{0}'' ist wegen ''{1}'' ung\u00FCltig. 
XIE0S.S=Der Exportvorgang wurde nicht ausgef\u00FChrt, weil die angegebene Ausgabedatei ({0}) bereits vorhanden ist. Bei einem Export wird keine vorhandene Datei \u00FCberschrieben, auch dann nicht, wenn der Prozess das Recht zum Schreiben in diese Datei hat. Diese Vorgehensweise wurde aus Sicherheitsgr\u00FCnden \u00FCbernommen, und um unabsichtliche Dateibesch\u00E4digungen zu vermeiden. Bitte \u00E4ndern Sie den Namen der Ausgabedatei in den Exportargumenten zu einem nicht vorhandenen Namen, oder l\u00F6schen Sie die vorhandene Datei und versuchen Sie dann erneut einen Export.
42ZB5=Klasse ''{0}'' implementiert VTICosting,  stellt jedoch keinen \u00F6ffentlichen, parameterlosen Konstruktor bereit.
42834=SET NULL kann nicht angegeben werden, weil der Fremdschl\u00FCssel ''{0}'' keine Nullwerte enthalten darf. 
XJ014.S=Kein Name f\u00FCr nicht benannte Sicherungspunkte.
C000=Die Klasse {0} wurde in die Datei {1} geschrieben. Stellen Sie Unterst\u00FCtzung f\u00FCr die Datei und die folgende Ausnahme bereit\: {2}
A011=WARNUNG\: Im Merkmal {0} ist kein LDAP-Server-/Hostname angegeben. Es wird localhost\:389 verwendet.
XJ113.S=Die Datei {0} kann nicht ge\u00F6ffnet werden. {1}
XJ041.C=Die Datenbank ''{0}'' konnte nicht erstellt werden. Details k\u00F6nnen Sie der n\u00E4chsten Ausnahme entnehmen.
XJ212.S=Ung\u00FCltige Attributsyntax\: {0}
XSCB9.S=F\u00FCr Testzwecke reserviert.
