#Thu May 16 17:55:33 BRT 2013
XN010.S=\uD504\uB85C\uC2DC\uC800 \uC774\uB984\uC740 \uB110\uC774 \uB420 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42XA8=''{0}''\uC740(\uB294) ''{1}'' \uC5F4\uC758 \uC0DD\uC131 \uC808\uC5D0\uC11C \uCC38\uC870\uD558\uBBC0\uB85C \uC774\uB984\uC744 \uBC14\uAFC0 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ050.U=\uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 {0} \uBC84\uC804\uC5D0\uC11C \uC5C5\uADF8\uB808\uC774\uB4DC\uB418\uC5B4\uC57C \uD569\uB2C8\uB2E4. JDBC \uC5F0\uACB0 URL\uC5D0\uC11C ''upgrade\=true'' \uC18D\uC131\uC744 \uC124\uC815\uD558\uC5EC {1} \uBC84\uC804\uC73C\uB85C \uC5C5\uADF8\uB808\uC774\uB4DC\uB97C \uD5C8\uC6A9\uD558\uC2ED\uC2DC\uC624.
A020=\uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uC778\uC99D.
XSLA1.D=\uB85C\uADF8 \uB808\uCF54\uB4DC\uAC00 \uC2A4\uD2B8\uB9BC\uC73C\uB85C \uC804\uC1A1\uB418\uC5C8\uC9C0\uB9CC \uC800\uC7A5\uC18C\uC5D0 \uC801\uC6A9\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4(\uC624\uBE0C\uC81D\uD2B8 {0}). \uC774\uB85C \uC778\uD574 \uBCF5\uAD6C \uBB38\uC81C\uC810\uC774 \uBC1C\uC0DD\uD560 \uC218\uB3C4 \uC788\uC2B5\uB2C8\uB2E4.
XJ104.S=\uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uACF5\uC720 \uD0A4 \uAE38\uC774\: {0}.
58017.C=DDM \uB9E4\uAC1C\uBCC0\uC218 \uAC12 0x{0}\uC774(\uAC00) \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uC785\uB825 \uD638\uC2A4\uD2B8 \uBCC0\uC218\uAC00 \uC11C\uBC84\uC5D0\uC11C \uC9C0\uC6D0\uD558\uB294 \uBC94\uC704\uB97C \uBC97\uC5B4\uB0AC\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC5F0\uACB0\uC774 \uC885\uB8CC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
XSDG3.D={0}\uC5D0 \uB300\uD55C \uBA54\uD0C0\uB370\uC774\uD130\uAC00 {1} {2}\uC5D0 \uC561\uC138\uC2A4\uB420 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ203.S=\uCEE4\uC11C \uC774\uB984 ''{0}''\uC740(\uB294) \uC774\uBBF8 \uC0AC\uC6A9 \uC911\uC785\uB2C8\uB2E4.
XSDB8.D=\uACBD\uACE0\: Derby(\uC778\uC2A4\uD134\uC2A4 {2})\uAC00 \uC5EC\uC804\uD788 \uD65C\uC131 \uC0C1\uD0DC\uC778\uB370 Derby(\uC778\uC2A4\uD134\uC2A4 {0})\uAC00 \uB370\uC774\uD130\uBCA0\uC774\uC2A4 {1}\uC744(\uB97C) \uBD80\uD2B8\uD558\uB824\uACE0 \uD569\uB2C8\uB2E4. Derby\uC758 \uD55C \uC778\uC2A4\uD134\uC2A4\uB9CC\uC774 \uD55C \uBC88\uC5D0 \uD558\uB098\uC758 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uBD80\uD2B8\uD574\uC57C \uD569\uB2C8\uB2E4.  \uB3D9\uC77C\uD55C \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0\uC11C Derby\uC758 \uB450 \uC778\uC2A4\uD134\uC2A4\uAC00 \uB3D9\uC2DC\uC5D0 \uBD80\uD2B8\uD558\uB294 \uACBD\uC6B0 \uC2EC\uAC01\uD558\uACE0 \uBCF5\uAD6C \uBD88\uAC00\uB2A5\uD55C \uC190\uC0C1\uC774 \uBC1C\uC0DD\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.  derby.database.forceDatabaseLock\=true \uB4F1\uB85D \uC815\uBCF4\uAC00 \uC124\uC815\uB418\uC5C8\uC73C\uBBC0\uB85C db.lck\uAC00 \uB354 \uC774\uC0C1 \uC874\uC7AC\uD558\uC9C0 \uC54A\uC744 \uB54C\uAE4C\uC9C0 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uBD80\uD2B8\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uC77C\uBC18\uC801\uC73C\uB85C \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0\uC11C \uBD80\uD2B8\uD560 Derby\uC758 \uCCAB \uBC88\uC9F8 \uC778\uC2A4\uD134\uC2A4\uAC00 \uC885\uB8CC\uB418\uBA74 \uC774 \uD30C\uC77C\uC774 \uC81C\uAC70\uB418\uC9C0\uB9CC \uC77C\uBD80 \uC2DC\uC2A4\uD15C \uC885\uB8CC \uC2DC\uC5D0\uB294 \uACC4\uC18D \uB0A8\uC544 \uC788\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4.  \uC774 \uACBD\uC6B0 \uC218\uB3D9\uC73C\uB85C \uD30C\uC77C\uC744 \uC81C\uAC70\uD574\uC57C \uD569\uB2C8\uB2E4.  db.lck \uD30C\uC77C\uC744 \uC218\uB3D9\uC73C\uB85C \uC0AD\uC81C\uD558\uAE30 \uC804\uC5D0 \uB2E4\uB978 VM\uC774 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0 \uC561\uC138\uC2A4\uD558\uACE0 \uC788\uB294\uC9C0 \uD655\uC778\uD574\uC57C \uD569\uB2C8\uB2E4.
XJ023.S=\uC785\uB825 \uC2A4\uD2B8\uB9BC\uC758 \uB370\uC774\uD130 \uC591\uC774 \uC694\uCCAD\uB41C \uAE38\uC774\uC640 \uC77C\uCE58\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
XSAM0.S=''{0}''\uC5D0 \uB300\uD55C \uBAA8\uB4C8\uC744 \uBD80\uD305\uD558\uB824\uB294 \uC911\uC5D0 \uC608\uC678\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
XSDF4.S=\uC0AD\uC81C\uB41C \uCEE8\uD14C\uC774\uB108\uC5D0 \uB300\uD55C {0} \uD30C\uC77C \uC81C\uAC70 \uC911 \uC608\uC678. \uD30C\uC77C\uC744 \uC81C\uAC70\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. {1}.
XBM0R.D={0} \uD30C\uC77C\uC744 \uC81C\uAC70\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSDA9.S={0}\uC758 \uC5F0\uC18D \uAC00\uB2A5 \uB610\uB294 SQLData \uC624\uBE0C\uC81D\uD2B8 \uBCF5\uC6D0 \uC911\uC5D0 \uD074\uB798\uC2A4\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ122.S=\uC774 \uD589\uC5D0\uC11C updateXXX \uBA54\uC18C\uB4DC\uAC00 \uD638\uCD9C\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.
A002=\uCE58\uBA85\uC801\: \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0 \uB300\uD55C \uC778\uC99D \uC11C\uBE44\uC2A4\uAC00 \uC5C6\uC2B5\uB2C8\uB2E4.
XN001.S=\uC791\uC5C5 \uB2E8\uC704(UOW) \uB0B4\uC5D0\uC11C\uB294 \uC5F0\uACB0 \uC7AC\uC124\uC815\uC774 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
XSAJ3.U=\uBC29\uBB38\uD55C \uC0AD\uC81C \uD589 \uC218
42915=''{1}'' \uB54C\uBB38\uC5D0 ''{0}'' \uC678\uBD80 \uD0A4\uAC00 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. 
XIE0S.S=\uC9C0\uC815\uB41C \uCD9C\uB825 \uD30C\uC77C({0})\uC774 \uC774\uBBF8 \uC788\uC73C\uBBC0\uB85C \uB0B4\uBCF4\uB0B4\uAE30 \uC791\uC5C5\uC774 \uC218\uD589\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4. \uBCF4\uC548 \uBB38\uC81C \uBC0F \uC2E4\uC218\uB85C \uD30C\uC77C\uC774 \uC190\uC0C1\uB418\uB294 \uAC83\uC744 \uBC29\uC9C0\uD558\uAE30 \uC704\uD574 \uB0B4\uBCF4\uB0B4\uAE30 \uD504\uB85C\uC138\uC2A4\uC5D0 \uAE30\uC874 \uD30C\uC77C\uC5D0 \uB300\uD55C \uC4F0\uAE30 \uAD8C\uD55C\uC774 \uC788\uB294 \uACBD\uC6B0\uC5D0\uB3C4 \uD574\uB2F9 \uD30C\uC77C\uC744 \uB36E\uC5B4\uC4F0\uC9C0 \uC54A\uC744 \uAC83\uC785\uB2C8\uB2E4. \uC874\uC7AC\uD558\uC9C0 \uC54A\uB294 \uD30C\uC77C\uC744 \uC9C0\uC815\uD558\uB3C4\uB85D \uB0B4\uBCF4\uB0B4\uAE30 \uC808\uCC28 \uC778\uC218\uC5D0\uC11C \uCD9C\uB825 \uD30C\uC77C \uC774\uB984\uC744 \uBCC0\uACBD\uD558\uAC70\uB098 \uAE30\uC874 \uD30C\uC77C\uC744 \uC0AD\uC81C\uD55C \uB2E4\uC74C \uB0B4\uBCF4\uB0B4\uAE30 \uC791\uC5C5\uC744 \uB2E4\uC2DC \uC2DC\uB3C4\uD558\uC2ED\uC2DC\uC624.
42ZB5=''{0}'' \uD074\uB798\uC2A4\uB294 VTICosting\uC744 \uAD6C\uD604\uD558\uC9C0\uB9CC \uC778\uC218 \uC5C6\uB294 \uACF5\uAC1C \uAD6C\uC131\uC790\uB97C \uC81C\uACF5\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
42834=FOREIGN KEY ''{0}''\uC740(\uB294) \uB110 \uAC12\uC744 \uD3EC\uD568\uD560 \uC218 \uC5C6\uC73C\uBBC0\uB85C SET NULL\uC744 \uC9C0\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. 
XJ014.S=\uC774\uB984\uC9C0\uC815\uB418\uC9C0 \uC54A\uC740 savepoint\uC5D0 \uB300\uD55C \uC774\uB984\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
C000={0} \uD074\uB798\uC2A4\uB97C {1} \uD30C\uC77C\uC5D0 \uAE30\uB85D\uD588\uC2B5\uB2C8\uB2E4. \uD30C\uC77C\uC5D0 \uB300\uD55C \uC9C0\uC6D0\uACFC \uB2E4\uC74C\uC758 \uC608\uC678 \uC815\uBCF4\uB97C \uC81C\uACF5\uD558\uC2ED\uC2DC\uC624. {2}
A011=\uACBD\uACE0\: {0} \uB4F1\uB85D \uC815\uBCF4\uC5D0 LDAP \uC11C\uBC84/\uD638\uC2A4\uD2B8 \uC774\uB984\uC774 \uC5B8\uAE09\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4. localhost\:389\uB85C \uAC00\uC815\uD569\uB2C8\uB2E4.
XJ113.S={0} \: {1} \uD30C\uC77C\uC744 \uC5F4 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ041.C=''{0}'' \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uC791\uC131\uD558\uC9C0 \uBABB\uD588\uC2B5\uB2C8\uB2E4. \uC138\uBD80\uC0AC\uD56D\uC740 \uB2E4\uC74C \uC608\uC678\uB97C \uCC38\uC870\uD558\uC2ED\uC2DC\uC624.
XJ212.S=\uC798\uBABB\uB41C \uC18D\uC131 \uAD6C\uBB38\: {0}
XSCB9.S=\uD14C\uC2A4\uD2B8\uB97C \uC704\uD574 \uC608\uC57D\uB418\uC5B4 \uC788\uC2B5\uB2C8\uB2E4.
