#Thu May 16 17:55:33 BRT 2013
XN010.S=El nombre del procedimiento no puede ser nulo.
42XA8=No se puede renombrar ''{0}'' porque est\u00E1 referenciada por la cl\u00E1usula de generaci\u00F3n de la columna ''{1}''.
XJ050.U=La base de datos necesita actualizarse desde la versi\u00F3n {0}, establezca el atributo ''upgrade\=true'' en el URL de conexi\u00F3n JDBC para permitir la actualizaci\u00F3n a la versi\u00F3n {1}.
A020=Autenticaci\u00F3n no v\u00E1lida.
XSLA1.D=Se ha enviado el registro de anotaciones cronol\u00F3gicas a la corriente, pero no puede aplicarse al almac\u00E9n (Objeto {0}).  Esto tambi\u00E9n puede producir problemas de recuperaci\u00F3n.
XJ104.S=La longitud de clave compartida no es v\u00E1lida\: {0}.
58017.C=El valor del par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  Es posible que una variable de lenguaje principal de entrada no est\u00E9 dentro del rango que soporta el servidor.  La conexi\u00F3n se ha finalizado.
XSDG3.D=No se pudo acceder a los metadatos de {0} en {1} {2}
XJ203.S=El nombre de cursor ''{0}'' ya se utiliza
XSDB8.D=ADVERTENCIA\: Derby (instancia {0}) est\u00E1 intentando iniciar la base de datos {1} aunque es posible que Derby (instancia {2}) est\u00E9 activa todav\u00EDa.  Es conveniente que una sola instancia de Derby inicie una base de datos a la vez. Los datos podr\u00EDan da\u00F1arse de forma irreversible si dos instancias de Derby inician la misma base de datos simult\u00E1neamente.  Se ha definido la propiedad derby.database.forceDatabaseLock\=true, por lo tanto la base de datos no se iniciar\u00E1 hasta que db.lck ya no est\u00E9 presente.  En general, este archivo se elimina cuando se cierra la primera instancia de Derby que se inicia en la base de datos; sin embargo, algunas veces permanece despu\u00E9s de apagarse.  El tal caso, el archivo deber\u00E1 eliminarse manualmente.  Antes de eliminar manualmente el archivo db.lck, es importante comprobar que no haya otras m\u00E1quinas virtuales que intentan acceder a la base de datos.
XJ023.S=La corriente de entrada no conten\u00EDa la cantidad exacta de datos que la longitud solicitada.
XSAM0.S=Se he encontrado una excepci\u00F3n al intentar arrancar el m\u00F3dulo de ''{0}''.
XSDF4.S=Excepci\u00F3n durante la eliminaci\u00F3n del archivo {0} del contenedor eliminado, no se ha podido eliminar el archivo {1}.
XBM0R.D=No se pudo eliminar el archivo {0}.  
XSDA9.S=Clase no encontrada durante la restauraci\u00F3n de un objeto serializable o SQLData de clase {0}
XJ122.S=No se han llamado m\u00E9todos updateXXX en esta fila.
A002=MUY GRAVE\: no existe servicio de autenticaci\u00F3n para la base de datos
XN001.S=No se permite un restablecimiento de la conexi\u00F3n dentro de una unidad de trabajo.
XSAJ3.U=N\u00FAmero de filas suprimidas visitadas
42915=La clave for\u00E1nea ''{0}'' no es v\u00E1lida debido a ''{1}''. 
XIE0S.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo de salida especificado ({0}). Como medida de seguridad, y para evitar posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo de salida en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.
42ZB5=La clase ''{0}'' implementa VTICosting pero no proporciona un constructor sin argumentos p\u00FAblico.
42834=No se puede especificar SET NULL porque FOREIGN KEY ''{0}'' no puede contener valores nulos.  
XJ014.S=No hay nombre para SAVEPOINT sin nombre.
C000=Se ha grabado la clase {0} en el archivo {1}. Proporcione a soporte el archivo y la informaci\u00F3n de excepci\u00F3n siguiente\: {2}
A011=AVISO\: no se ha mencionado ning\u00FAn nombre de servidor/sistema principal LDAP en la propiedad {0}; se asume localhost\:389
XJ113.S=No se puede abrir el archivo {0} \: {1}
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener detalles.
XJ212.S=Sintaxis de atributo no v\u00E1lida\: {0}
XSCB9.S=Reservado para pruebas.
