#Thu May 16 17:55:33 BRT 2013
XN010.S=Le nom de la proc\u00E9dure ne peut pas \u00EAtre null.
42XA8=Vous ne pouvez pas renommer ''{0}'', car la clause de g\u00E9n\u00E9ration de la colonne ''{1}'' y fait r\u00E9f\u00E9rence.
XJ050.U=La base de donn\u00E9es n\u00E9cessite une mise \u00E0 niveau de la version {0}. D\u00E9finissez l''attribut ''upgrade\=true'' sur l''URL de connexion JDBC pour permettre une mise \u00E0 niveau en version {1}.
A020=Authentification non valide.
XSLA1.D=L''enregistrement de journal a \u00E9t\u00E9 envoy\u00E9 au flux de donn\u00E9es de journalisation, mais il ne peut pas \u00EAtre appliqu\u00E9 au stockage (Objet {0}).  Des probl\u00E8mes de reprise peuvent \u00E9galement en d\u00E9couler.
XJ104.S=La longueur de cl\u00E9 partag\u00E9e est incorrecte \: {0}.
58017.C=La valeur du param\u00E8tre du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas pris en charge.  Une variable h\u00F4te en entr\u00E9e ne se situe peut-\u00EAtre pas dans l''intervalle pris en charge par le serveur.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
XSDG3.D=Impossible d''acc\u00E9der aux m\u00E9tadonn\u00E9es de {0} pour {1} {2}
XJ203.S=Le nom de curseur ''{0}'' est d\u00E9j\u00E0 utilis\u00E9
XSDB8.D=AVERTISSEMENT \: Derby (instance {0}) tente d''initialiser la base de donn\u00E9es {1} m\u00EAme si Derby (instance {2}) est encore actif.  Une seule instance de Derby peut initialiser une base de donn\u00E9es \u00E0 la fois. Une corruption importante et irr\u00E9versible peut se produire si 2 instances de Derby lancent l''initialisation sur la m\u00EAme base de donn\u00E9es en m\u00EAme temps.  La propri\u00E9t\u00E9 derby.database.forceDatabaseLock\=true a \u00E9t\u00E9 d\u00E9finie, de sorte que la base de donn\u00E9es ne s''initialisera pas tant que db.lck est pr\u00E9sent.  En r\u00E8gle g\u00E9n\u00E9rale, ce fichier est supprim\u00E9 lorsque la premi\u00E8re instance de Derby proc\u00E8de \u00E0 l''initialisation lors de la fermeture de la base de donn\u00E9es, mais dans certains cas il ne l''est pas.  Il est alors n\u00E9cessaire de supprimer le fichier manuellement.  Il est important de v\u00E9rifier qu''aucune autre machine virtuelle n''acc\u00E8de \u00E0 la base de donn\u00E9es avant de supprimer le fichier db.lck manuellement.
XJ023.S=Le flux en entr\u00E9e ne comprenait pas exactement la m\u00EAme quantit\u00E9 de donn\u00E9es que la longueur requise.
XSAM0.S=Exception d\u00E9tect\u00E9e lors de la tentative d''amor\u00E7age du module pour ''{0}''.
XSDF4.S=Exception au cours de la suppression du fichier {0} pour le conteneur supprim\u00E9 ; le fichier n''a pas pu \u00EAtre supprim\u00E9 {1}.
XBM0R.D=Impossible de supprimer le fichier {0}.  
XSDA9.S=Classe introuvable au cours de la restauration d''un objet s\u00E9rialisable ou SQLData de classe {0}
XJ122.S=Aucune m\u00E9thode de mise \u00E0 jour XXX n''a \u00E9t\u00E9 appel\u00E9e sur cette ligne.
A002=FATAL \: Aucun service d''authentification n''existe pour la base de donn\u00E9es
XN001.S=La r\u00E9initialisation de la connexion n''est pas autoris\u00E9e \u00E0 l''int\u00E9rieur d''une unit\u00E9 de travail.
XSAJ3.U=Nombre de lignes supprim\u00E9es visit\u00E9es.
42915=La cl\u00E9 externe ''{0}'' n''est pas valide car ''{1}''. 
XIE0S.S=L''op\u00E9ration d''exportation n''a pas eu lieu, car le fichier de sortie sp\u00E9cifi\u00E9 ({0}) existe d\u00E9j\u00E0. Pour des raisons de s\u00E9curit\u00E9 et pour \u00E9viter tout risque accidentel d''endommager un fichier, la proc\u00E9dure d''exportation n''\u00E9crase pas un fichier existant, m\u00EAme si le processus dispose des droits d''\u00E9criture sur le fichier en question. Soit vous modifiez le nom du fichier de sortie dans les arguments de la proc\u00E9dure d''exportation afin qu''il diff\u00E8re de tout fichier existant, soit vous supprimez le fichier existant avant de recommencer l''op\u00E9ration d''exportation.
42ZB5=La classe ''{0}'' impl\u00E9mente VTICosting mais ne fournit pas de constructeur no-arg public.
42834=SET NULL ne peut \u00EAtre indiqu\u00E9 car la CLE EXTERNE ''{0}'' ne peut pas contenir de valeurs nulles.  
XJ014.S=Aucun nom pour les points de sauvegarde dont le nom n''est pas indiqu\u00E9.
C000=La classe {0} a \u00E9t\u00E9 enregistr\u00E9e dans le fichier {1}. Indiquez le fichier et les informations suivantes relatives \u00E0 l''exception au support technique \: {2}
A011=AVERTISSEMENT \: Aucun nom de serveur LDAP/d''h\u00F4te n''est mentionn\u00E9 dans la propri\u00E9t\u00E9 {0} ; adoption par d\u00E9faut du syst\u00E8me h\u00F4te local\:389
XJ113.S=Impossible d''ouvrir le fichier {0} \: {1}
XJ041.C=Echec de la cr\u00E9ation de la base de donn\u00E9es ''{0}'' ; pour plus de d\u00E9tails, voir l''exception suivante.
XJ212.S=Syntaxe d''attribut incorrecte \: {0}
XSCB9.S=R\u00E9serv\u00E9 pour les tests.
