#Thu May 16 17:55:33 BRT 2013
0100E=XX Tentativo di restituire un numero eccessivo di insiemi di risultati. 
XBCX5.S=Impossibile modificare la password di avvio in un carattere nullo.
XIE0T.S=L''operazione di esportazione non \u00E8 stata eseguita in quanto il file lob ausiliario specificato ({0}) esiste gi\u00E0. L''operazione di esportazione non sovrascrive i file esistenti anche quando il processo dispone delle necessarie autorizzazioni in scrittura, per ragioni di sicurezza e per impedire la perdita accidentale di dati. Modificare il nome del file lob ausiliario negli argomenti della procedura di esportazione oppure eliminare il file esistente e quindi ritentare la procedura.
42916=Il sinonimo ''{0}'' non pu\u00F2 essere creato per ''{1}'' in quanto il risultato sarebbe una catena di sinonimi circolare.
58009.C.19=Eccezione del protocollo di rete\: SECTKN non restituito.  La connessione \u00E8 stata terminata.
58009.C.18=Eccezione del protocollo di rete\: FDOCA LID non valido.  La connessione \u00E8 stata terminata.
58009.C.17=Eccezione del protocollo di rete\: interruzione del flusso durante la lettura di InputStream, parametro \#{0}.  La connessione \u00E8 stata terminata.
58009.C.16=Eccezione del protocollo di rete\: DSS concatenato con lo stesso id al termine della stessa analisi di catena id.  La connessione \u00E8 stata terminata.
3B001.S=SAVEPOINT, {0} non esistente o non attivo nella transazione corrente.
58009.C.15=Eccezione del protocollo di rete\: lunghezza DSS non 0 al termine della stessa analisi di catena id.  La connessione \u00E8 stata terminata.
58009.C.14=Eccezione del protocollo di rete\: stack di raccolta non vuoto al termine della stessa analisi della catena id.  La connessione \u00E8 stata terminata.
XSDB9.D=Il contenitore di flusso {0} \u00E8 corrotto.
58009.C.13=Eccezione del protocollo di rete\: la raccolta DDM contiene meno di 4 byte di dati.  La connessione \u00E8 stata terminata.
XJ114.S=Nome cursore non valido ''{0}''
XJ213.C=La propriet\u00E0 di connessione traceLevel non dispone di un formato valido per un numero.
58009.C.12=Eccezione del protocollo di rete\: il punto di codice reale, {0}, non corrisponde al punto di codice previsto, {1}.  La connessione \u00E8 stata terminata.
58009.C.11=La connessione \u00E8 stata terminata perch\u00E9 la codifica non \u00E8 supportata.
58009.C.10=Eccezione del protocollo di rete\: solo una lunghezza VCM, VCS pu\u00F2 essere maggiore di 0.  La connessione \u00E8 stata terminata.
42XA9=La colonna ''{0}'' richiede un tipo di dati esplicito. Il tipo di dati pu\u00F2 essere omesso solo per le colonne con clausole di generazione.
XN002.U=SECTKN non restituito.
XSCH4.S=Impossibile creare il conglomerato.
XSLA2.D=Il sistema verr\u00E0 arrestato, rilevata eccezione I/O durante l''accesso al file di log.
XN020.S=Errore durante l''ordinamento o l''annullamento dell''ordinamento di un tipo definito dall''utente\: {0} 
XJ015.M=Arresto sistema Derby.
XJ204.S=Impossibile aprire l''impostazione del risultato con holdability richiesto {0}.
XBM0S.D=Impossibile ridenominare il file ''{0}'' in ''{1}''
XJ105.S=La lunghezza della chiave DES non \u00E8 corretta, lunghezza prevista {0}, lunghezza acquisita {1}.
XSAJ4.U=Numero di righe completate
XJ123.S=Questo metodo deve essere richiamato per aggiornare i valori nella riga corrente o nella riga di inserimento.
58009.C.9=Eccezione del protocollo di rete\: lunghezza PKGNAMCSN, {0}, non valida in SQLAM {1}.  La connessione \u00E8 stata terminata.
C001=La classe {0} dispone di un tipo di certificato sconosciuto in jar {1}, previsto certificato X509.
58009.C.8=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per PKGID.  La connessione \u00E8 stata terminata.
XSLB1.S=L''operazione di log {0} riscontra degli errori durante la scrittura al di fuori del flusso di log; ci\u00F2 pu\u00F2 essere determinato da un''operazione di log errata o dal buffer log interno saturo a causa di un''operazione di log di dimensioni eccessive.
58009.C.7=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per RDBCOLID.  La connessione \u00E8 stata terminata.
XN011.S=La lunghezza del nome della procedura {0} non \u00E8 compresa nell''intervallo valido da 1 a {1}.
58009.C.21=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per RDBNAM.  La connessione \u00E8 stata terminata.
58009.C.20=Eccezione del protocollo di rete\: solo una lunghezza VCM, NVCS pu\u00F2 essere non nulla.  La connessione \u00E8 stata terminata.
XJ042.S=''{0}'' non \u00E8 un valore valido per la propriet\u00E0 ''{1}''.
