#Thu May 16 17:55:33 BRT 2013
0100E=XX Es wurde versucht, zu viele Ergebnislisten zur\u00FCckzugeben. 
XBCX5.S=Das Boot-Kennwort kann nicht in eine Nullzeichenfolge ge\u00E4ndert werden.
XIE0T.S=Der Exportvorgang wurde nicht ausgef\u00FChrt, weil die angegebene Large Object-Hilfsdatei ({0}) bereits vorhanden ist. Bei einem Export wird keine vorhandene Datei \u00FCberschrieben, auch dann nicht, wenn der Prozess das Recht zum Schreiben in diese Datei hat. Diese Vorgehensweise wurde aus Sicherheitsgr\u00FCnden \u00FCbernommen, und um unabsichtliche Dateibesch\u00E4digungen zu vermeiden. Bitte \u00E4ndern Sie den Namen der Large Object-Hilfsdatei in den Exportargumenten zu einem nicht vorhandenen Namen, oder l\u00F6schen Sie die vorhandene Datei und versuchen Sie dann erneut einen Export.
42916=Das Synonym ''{0}'' kann nicht f\u00FCr ''{1}'' erstellt werden, da dies zu einer Synonymkette in Form einer Schleife f\u00FChren w\u00FCrde.
58009.C.19=Netzprotokollausnahme\: SECTKN wurde nicht zur\u00FCckgegeben. Die Verbindung wurde beendet.
58009.C.18=Netzprotokollausnahme\: Ung\u00FCltiges FDOCA-LID. Die Verbindung wurde beendet.
58009.C.17=Netzprotokollausnahme\: Beim Lesen des Eingabedatenstroms (Parameter {0}) wurde das Ende des Datenstroms vorzeitig erreicht. Die Verbindung wurde beendet.
58009.C.16=Netzprotokollausnahme\: Das n\u00E4chste DDS-Segment der Kette hat dieselbe ID wie das aktuelle Segment. Die Verbindung wurde beendet.
3B001.S=Der Sicherungspunkt {0} ist nicht vorhanden oder in der aktuellen Transaktion nicht aktiv.
58009.C.15=Netzprotokollausnahme\: Die L\u00E4nge eines DDS-Segments war zum Ende der Syntaxanalyse der DDS-Kette gr\u00F6\u00DFer als 0. Die Verbindung wurde beendet.
58009.C.14=Netzprotokollausnahme\: Der Objekt-Stack ist zum Ende der Syntaxanalyse der DDS-Kette nicht leer. Die Verbindung wurde beendet.
XSDB9.D=Der Datenstromcontainer {0} ist besch\u00E4digt.
58009.C.13=Netzprotokollausnahme\: Die DDM-Objektgruppe enth\u00E4lt weniger als 4 Bytes Daten. Die Verbindung wurde beendet.
XJ114.S=Ung\u00FCltiger Cursorname ''{0}''
XJ213.C=Das Verbindungsmerkmal traceLevel hat kein g\u00FCltiges Format f\u00FCr eine Zahl.
58009.C.12=Netzprotokollausnahme\: Der tats\u00E4chliche Codepunkt {0} stimmt nicht mit dem erwarteten Codepunkt {1} \u00FCberein. Die Verbindung wurde beendet.
58009.C.11=Die Verbindung wurde beendet, weil die Codierung nicht unterst\u00FCtzt wird.
58009.C.10=Netzprotokollausnahme\: Nur die VCM-L\u00E4nge oder nur die VCS-L\u00E4nge darf gr\u00F6\u00DFer als 0 sein. Die Verbindung wurde beendet.
42XA9=Spalte ''{0}'' erfordert einen expliziten Datentyp. Der Datentyp kann nur f\u00FCr Spalten mit Erstellungsklauseln \u00FCbersprungen werden.
XN002.U=SECTKN wurde nicht zur\u00FCckgegeben.
XSCH4.S=Ein Konglomerat konnte nicht erstellt werden.
XSLA2.D=Das System wird heruntergefahren. Beim Zugriff auf die Protokolldatei wurde eine E/A-Ausnahme empfangen.
XN020.S=Fehler bei der Umwandlung oder R\u00FCckwandlung eines benutzerdefinierten Typs\: {0}
XJ015.M=Das Derby-System wird heruntergefahren.
XJ204.S=Die Ergebnisliste kann nicht mit der angeforderten Offenhaltungseinstellung {0} ge\u00F6ffnet werden.
XBM0S.D=Die Datei ''{0}'' kann nicht in ''{1}'' umbenannt werden.
XJ105.S=Der DES-Schl\u00FCssel hat die falsche L\u00E4nge. Erwartete L\u00E4nge\: {0}, empfangene L\u00E4nge\: {1}
XSAJ4.U=Anzahl der qualifizierten Zeilen
XJ123.S=Diese Methode muss aufgerufen werden, um Werte in der aktuellen Zeile oder der Einf\u00FCgezeile zu aktualisieren.
58009.C.9=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr SQLAM {1} ung\u00FCltig. Die Verbindung wurde beendet.
C001=Die Klasse {0} enth\u00E4lt in der JAR-Datei {1} einen unbekannten Zertifikattyp. Es wurde ein X509-Zertifikat erwartet.
58009.C.8=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr PKGID ung\u00FCltig. Die Verbindung wurde beendet.
XSLB1.S=Die Protokolloperation {0} hat beim Schreiben ihrer Daten in den Protokolldatenstrom einen Fehler festgestellt. Die Ursache kann eine falsche Protokolloperation oder die Ersch\u00F6pfung der Kapazit\u00E4t des internen Protokollpuffers durch eine zu umfangreiche Protokolloperation sein.
58009.C.7=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr RDBCOLID ung\u00FCltig. Die Verbindung wurde beendet.
XN011.S=Die L\u00E4nge {0} des Prozedurnamens liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
58009.C.21=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr RDBNAM ung\u00FCltig. Die Verbindung wurde beendet.
58009.C.20=Netzprotokollausnahme\: Nur NVCM oder nur NVCS darf ungleich null sein. Die Verbindung wurde beendet.
XJ042.S=''{0}'' ist kein g\u00FCltiger Wert f\u00FCr das Merkmal ''{1}''.
