#Thu May 16 17:55:33 BRT 2013
XJ123.S=Tato metoda mus\u00ED b\u00FDt vol\u00E1na, aby se aktualizovaly hodnoty v aktu\u00E1ln\u00EDm \u0159\u00E1dku nebo \u0159\u00E1dku pro vlo\u017Een\u00ED.
58009.C.8=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: d\u00E9lka SCLDTA, {0}, je neplan\u00E1 pro PKGID. Spojen\u00ED bylo ukon\u010Deno.
XN002.U=SECTKN nebylo vr\u00E1ceno.
58009.C.21=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: d\u00E9lka SCLDTA, {0}, je neplan\u00E1 pro RDBNAM. Spojen\u00ED bylo ukon\u010Deno.
58009.C.7=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: d\u00E9lka SCLDTA, {0}, je neplan\u00E1 pro RDBCOLID. Spojen\u00ED bylo ukon\u010Deno.
58009.C.20=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: pouze jedna z hodnot NVCM a NVCS m\u016F\u017Ee b\u00FDt nenulov\u00E1. Spojen\u00ED bylo ukon\u010Deno.
XSLB1.S=Operace protokolu {0} nar\u00E1\u017E\u00ED na chybu, kdy\u017E se zapisuje do toku dat protokolu. To m\u016F\u017Ee b\u00FDt zp\u016Fsobeno bludnou operac\u00ED protokolu nebo zapln\u011Bn\u00EDm vnit\u0159n\u00ED vyrovn\u00E1vac\u00ED pam\u011Bti protokolu kv\u016Fli nadm\u011Brn\u011B velk\u00E9 operaci protokolu.
XSCH4.S=Sm\u00ED\u0161en\u00FD objekt nebyl vytvo\u0159en.
XSAJ4.U=Po\u010Det kvalifikovan\u00FDch \u0159\u00E1dk\u016F
XJ042.S=''{0}'' nen\u00ED platnou hodnotou pro vlastnost ''{1}''.
0100E=Pokus XX o n\u00E1vrat p\u0159\u00EDli\u0161 mnoha mno\u017Ein v\u00FDsledk\u016F. 
3B001.S=BOD ULO\u017DEN\u00CD {0} neexistuje nebo nen\u00ED aktivn\u00ED v aktu\u00E1ln\u00ED transakci.
XJ114.S=Neplatn\u00E9 jm\u00E9no kurzoru ''{0}''
XJ015.M=Vypnut\u00ED syst\u00E9mu Derby.
58009.C.19=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: nebylo vr\u00E1ceno SECTKN. Spojen\u00ED bylo ukon\u010Deno.
58009.C.18=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: neplatn\u00FD FDOCA LID. Spojen\u00ED bylo ukon\u010Deno.
58009.C.17=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: byl p\u0159ed\u010Dasn\u011B dosa\u017Een konec toku dat p\u0159i \u010Dten\u00ED vstupn\u00EDho toku, parametr \#{0}. Spojen\u00ED bylo ukon\u010Deno.
58009.C.16=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: DSS je z\u0159et\u011Bzeno se stejn\u00FDm ID na konci anal\u00FDzy \u0159et\u011Bzu stejn\u00E9ho ID. Spojen\u00ED bylo ukon\u010Deno.
42916=Synonymum ''{0}'' nelze vytvo\u0159it pro ''{1}'', proto\u017Ee by m\u011Blo za n\u00E1sledek vznik kruhov\u00E9ho \u0159et\u011Bzu synonym.
58009.C.15=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: d\u00E9lka DSS nen\u00ED 0 na konci anal\u00FDzy \u0159et\u011Bzu stejn\u00E9ho ID. Spojen\u00ED bylo ukon\u010Deno.
58009.C.14=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: z\u00E1sobn\u00EDk kolekce nen\u00ED pr\u00E1zdn\u00FD na konci anal\u00FDzy \u0159et\u011Bzu stejn\u00E9ho ID. Spojen\u00ED bylo ukon\u010Deno.
58009.C.13=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: kolekce DDM obsahuje m\u00E9n\u011B ne\u017E 4 bajty dat. Spojen\u00ED bylo ukon\u010Deno.
XN011.S=D\u00E9lka jm\u00E9na procedury {0} nen\u00ED v platn\u00E9m rozsahu 1 a\u017E {1}.
58009.C.12=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: aktu\u00E1ln\u00ED identifika\u010Dn\u00ED bod {0} neodpov\u00EDd\u00E1 o\u010Dek\u00E1van\u00E9mu identifika\u010Dn\u00EDmu bodu {1}. Spojen\u00ED bylo ukon\u010Deno.
58009.C.11=Spojen\u00ED bylo ukon\u010Deno, proto\u017Ee zak\u00F3dov\u00E1n\u00ED nen\u00ED podporov\u00E1no.
58009.C.10=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: pouze jedna z d\u00E9lek VCM a VCS m\u016F\u017Ee b\u00FDt v\u011Bt\u0161\u00ED ne\u017E 0. Spojen\u00ED bylo ukon\u010Deno.
XJ213.C=Vlastnost p\u0159ipojen\u00ED traceLevel nem\u00E1 platn\u00FD form\u00E1t \u010D\u00EDsla.
XJ105.S=Kl\u00ED\u010D DES m\u00E1 chybnou d\u00E9lku. O\u010Dek\u00E1van\u00E1 d\u00E9lka {0}, obdr\u017Een\u00E1 d\u00E9lka {1}.
XSLA2.D=Syst\u00E9m se vypne, obdr\u017Eel v\u00FDjimku I/O p\u0159i p\u0159\u00EDstupu k souboru protokolu.
C001=T\u0159\u00EDda {0} m\u00E1 nezn\u00E1m\u00FD typ certifik\u00E1tu v souboru JAR {1}, byl o\u010Dek\u00E1v\u00E1n certifik\u00E1t X509.
XBCX5.S=Nelze zm\u011Bnit zav\u00E1d\u011Bc\u00ED heslo na hodnotu ''null''.
XJ204.S=Nelze otev\u0159\u00EDt mno\u017Einu v\u00FDsledk\u016F s po\u017Eadovanou zadr\u017Eitelnost\u00ED {0}.
XSDB9.D=Kontejner toku dat {0} je poru\u0161en.
58009.C.9=V\u00FDjimka s\u00ED\u0165ov\u00E9ho protokolu\: d\u00E9lka PKGNAMCSN, {0}, je neplan\u00E1 v SQLAM {1}. Spojen\u00ED bylo ukon\u010Deno.
XBM0S.D=Nelze p\u0159ejmenovat soubor ''{0}'' na ''{1}''
