#Thu May 16 17:55:33 BRT 2013
XJ123.S=Ta metoda musi by\u0107 wywo\u0142ana w celu zaktualizowania warto\u015Bci wiersza bie\u017C\u0105cego lub wstawianego.
58009.C.8=Wyj\u0105tek protoko\u0142u sieciowego\: d\u0142ugo\u015B\u0107 SCLDTA {0} jest niepoprawna dla PKGID. Po\u0142\u0105czenie zosta\u0142o przerwane.
XN002.U=Warto\u015B\u0107 SECTKN nie zosta\u0142a zwr\u00F3cona.
58009.C.21=Wyj\u0105tek protoko\u0142u sieciowego\: d\u0142ugo\u015B\u0107 SCLDTA {0} jest niepoprawna dla RDBNAM. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.7=Wyj\u0105tek protoko\u0142u sieciowego\: d\u0142ugo\u015B\u0107 SCLDTA {0} jest niepoprawna dla RDBCOLID. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.20=Wyj\u0105tek protoko\u0142u sieciowego\: tylko jedna warto\u015B\u0107 z NVCM, NVCS mo\u017Ce mie\u0107 warto\u015B\u0107 inn\u0105 ni\u017C null. Po\u0142\u0105czenie zosta\u0142o przerwane.
XSLB1.S=Operacja rejestrowania {0} napotka\u0142a b\u0142\u0119dy podczas zapisu do strumienia dziennika; mo\u017Ce to by\u0107 spowodowane b\u0142\u0119dn\u0105 operacj\u0105 rejestrowania lub zape\u0142nieniem wewn\u0119trznego buforu dziennika z powodu nadmiernie du\u017Cej operacji rejestrowania.
XSCH4.S=Nie mo\u017Cna utworzy\u0107 konglomeratu.
XSAJ4.U=Liczba zakwalifikowanych wierszy
XJ042.S=''{0}'' nie jest poprawn\u0105 warto\u015Bci\u0105 dla w\u0142a\u015Bciwo\u015Bci ''{1}''.
0100E=XX Pr\u00F3ba zwr\u00F3cenia zbyt du\u017Cej tabeli wynikowej. 
3B001.S=Punkt zapisu (SAVEPOINT) {0} nie istnieje lub nie jest aktywny dla bie\u017C\u0105cej transakcji.
XJ114.S=Niepoprawna nazwa kursora ''{0}''
XJ015.M=System Derby zosta\u0142 wy\u0142\u0105czony.
58009.C.19=Wyj\u0105tek protoko\u0142u sieciowego\: parametr SECTKN nie zosta\u0142 zwr\u00F3cony. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.18=Wyj\u0105tek protoko\u0142u sieciowego\: niepoprawny identyfikator FDOCA LID. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.17=Wyj\u0105tek protoko\u0142u sieciowego\: przedwcze\u015Bnie osi\u0105gni\u0119to koniec strumienia podczas odczytu strumienia InputStream, parametr nr {0}. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.16=Wyj\u0105tek protoko\u0142u sieciowego\: DSS po\u0142\u0105czone z tym samym identyfikatorem na ko\u0144cu tej samej analizy \u0142a\u0144cucha identyfikatora. Po\u0142\u0105czenie zosta\u0142o przerwane.
42916=Dla ''{1}'' nie mo\u017Cna utworzy\u0107 synonimu ''{0}'', gdy\u017C mo\u017Ce to spowodowa\u0107 powstanie zap\u0119tlonego szeregu synonim\u00F3w.
58009.C.15=Wyj\u0105tek protoko\u0142u sieciowego\: d\u0142ugo\u015B\u0107 DSS nie ma warto\u015Bci 0 na ko\u0144cu tej samej analizy \u0142a\u0144cucha identyfikatora. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.14=Wyj\u0105tek protoko\u0142u sieciowego\: stos kolekcji nie jest pusty na ko\u0144cu tej samej analizy \u0142a\u0144cucha identyfikatora. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.13=Wyj\u0105tek protoko\u0142u sieciowego\: kolekcja DDM zawiera mniej ni\u017C 4 bajty danych. Po\u0142\u0105czenie zosta\u0142o przerwane.
XN011.S=D\u0142ugo\u015B\u0107 nazwy procedury {0} nie zawiera si\u0119 w poprawnym zakresie od 1 do {1}.
58009.C.12=Wyj\u0105tek protoko\u0142u sieciowego\: bie\u017C\u0105cy punkt kodowy {0} nie zgadza si\u0119 z oczekiwanym punktem kodowym {1}. Po\u0142\u0105czenie zosta\u0142o przerwane.
58009.C.11=Po\u0142\u0105czenie zosta\u0142o przerwane, poniewa\u017C kodowanie nie jest obs\u0142ugiwane.
58009.C.10=Wyj\u0105tek protoko\u0142u sieciowego\: tylko jedna z d\u0142ugo\u015Bci VCM, VCS mo\u017Ce by\u0107 wi\u0119ksza od 0. Po\u0142\u0105czenie zosta\u0142o przerwane.
XJ213.C=W\u0142a\u015Bciwo\u015B\u0107 po\u0142\u0105czenia traceLevel nie ma poprawnego formatu dla liczby.
XJ105.S=Klucz DES ma z\u0142\u0105 d\u0142ugo\u015B\u0107. Oczekiwana d\u0142ugo\u015B\u0107 {0}, otrzymano {1}.
XSLA2.D=System zostanie zamkni\u0119ty. Wyst\u0105pi\u0142 wyj\u0105tek we/wy podczas dost\u0119pu do pliku dziennika.
C001=Klasa {0} ma nieznany typ certyfikatu w pliku jar {1}. Oczekiwano certyfikatu X509.
XBCX5.S=Nie mo\u017Cna zmieni\u0107 has\u0142a startowego na warto\u015B\u0107 null.
XJ204.S=Nie mo\u017Cna otworzy\u0107 tabeli wynikowej z \u017C\u0105dan\u0105 mo\u017Cliwo\u015Bci\u0105 wstrzymywania {0}.
XSDB9.D=Kontener strumienia {0} jest uszkodzony.
58009.C.9=Wyj\u0105tek protoko\u0142u sieciowego\: d\u0142ugo\u015B\u0107 PKGNAMCSN, {0}, jest niepoprawna dla SQLAM {1}. Po\u0142\u0105czenie zosta\u0142o przerwane.
XBM0S.D=Nie mo\u017Cna zmieni\u0107 nazwy pliku z ''{0}'' na ''{1}''
