#Thu May 16 17:55:33 BRT 2013
XJ123.S=\u042D\u0442\u043E\u0442 \u043C\u0435\u0442\u043E\u0434 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0434\u043B\u044F \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0441\u0442\u0440\u043E\u043A\u0435 \u0438\u043B\u0438 \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 \u0432\u0441\u0442\u0430\u0432\u043A\u0438.
58009.C.8=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0434\u043B\u0438\u043D\u0430 SCLDTA ({0}) \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u0434\u043B\u044F PKGID.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XN002.U=SECTKN \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D.
58009.C.21=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0434\u043B\u0438\u043D\u0430 SCLDTA ({0}) \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u0434\u043B\u044F RDBNAM.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.7=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0434\u043B\u0438\u043D\u0430 SCLDTA ({0}) \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u0434\u043B\u044F RDBCOLID.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.20=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u0430 \u0438\u0437 NVCM, NVCS \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043D\u0435\u043D\u0443\u043B\u0435\u0432\u043E\u0439.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XSLB1.S=\u041E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0436\u0443\u0440\u043D\u0430\u043B\u0430 {0} \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0438\u043B\u0430 \u043E\u0448\u0438\u0431\u043A\u0443 \u043F\u0440\u0438 \u0437\u0430\u043F\u0438\u0441\u0438 \u0441\u0430\u043C\u043E\u0439 \u0441\u0435\u0431\u044F \u0432 \u043F\u043E\u0442\u043E\u043A \u0436\u0443\u0440\u043D\u0430\u043B\u0430; \u044D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0432\u044B\u0437\u0432\u0430\u043D\u043E \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u0439 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0435\u0439 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0438\u043B\u0438 \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435\u043C \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0433\u043E \u0431\u0443\u0444\u0435\u0440\u0430 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0438\u0437-\u0437\u0430 \u0447\u0440\u0435\u0437\u043C\u0435\u0440\u043D\u043E\u0439 \u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \u0436\u0443\u0440\u043D\u0430\u043B\u0430.
XSCH4.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442.
XSAJ4.U=\u0427\u0438\u0441\u043B\u043E \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0445 \u0441\u0442\u0440\u043E\u043A
XJ042.S=''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \u0434\u043B\u044F \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 ''{1}''.
0100E=XX \u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u0442\u044C \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043C\u043D\u043E\u0433\u043E \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432. 
3B001.S=\u0422\u043E\u0447\u043A\u0430 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F (SAVEPOINT) {0} \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0438\u043B\u0438 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
XJ114.S=\u041D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0438\u043C\u044F \u043A\u0443\u0440\u0441\u043E\u0440\u0430 ''{0}''
XJ015.M=\u0421\u0438\u0441\u0442\u0435\u043C\u0430 Derby \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0430 \u0440\u0430\u0431\u043E\u0442\u0443.
58009.C.19=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D SECTKN.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.18=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 FDOCA LID.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.17=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u041F\u0440\u0435\u0436\u0434\u0435\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u0434\u043E\u0441\u0442\u0438\u0433\u043D\u0443\u0442 \u043A\u043E\u043D\u0435\u0446 \u043F\u043E\u0442\u043E\u043A\u0430 \u043F\u0440\u0438 \u0447\u0442\u0435\u043D\u0438\u0438 InputStream; \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \#{0}.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.16=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0418\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u043E\u043D\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0433\u043E \u0441\u0435\u0433\u043C\u0435\u043D\u0442\u0430 DSS \u0432 \u0446\u0435\u043F\u0438 DSS \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0435\u0442 \u0441 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u043E\u043D\u043D\u044B\u043C \u043D\u043E\u043C\u0435\u0440\u043E\u043C \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u0435\u0433\u043C\u0435\u043D\u0442\u0430.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
42916=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0441\u0438\u043D\u043E\u043D\u0438\u043C ''{0}'' \u0434\u043B\u044F ''{1}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E \u043F\u0440\u0438\u0432\u0435\u0434\u0435\u0442 \u043A \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u044E \u0437\u0430\u043C\u043A\u043D\u0443\u0442\u043E\u0433\u043E \u0446\u0438\u043A\u043B\u0430 \u0441\u0438\u043D\u043E\u043D\u0438\u043C\u043E\u0432.
58009.C.15=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0414\u043B\u0438\u043D\u0430 DSS \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0443\u043B\u0435\u0432\u043E\u0439 \u0432 \u043A\u043E\u043D\u0446\u0435 \u0430\u043D\u0430\u043B\u0438\u0437\u0430 \u0446\u0435\u043F\u0438.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.14=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0421\u0442\u0435\u043A \u0441\u043E\u0431\u0440\u0430\u043D\u0438\u044F \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0443\u0441\u0442\u044B\u043C \u0432 \u043A\u043E\u043D\u0446\u0435 \u0430\u043D\u0430\u043B\u0438\u0437\u0430 \u0446\u0435\u043F\u0438.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.13=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0421\u043E\u0431\u0440\u0430\u043D\u0438\u0435 DDM \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043C\u0435\u043D\u0435\u0435 4 \u0431\u0430\u0439\u0442 \u0434\u0430\u043D\u043D\u044B\u0445.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XN011.S=\u0414\u043B\u0438\u043D\u0430 \u0438\u043C\u0435\u043D\u0438 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u044B ({0}) \u043D\u0435 \u0443\u043A\u043B\u0430\u0434\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D (\u043E\u0442 1 \u0434\u043E {1}).
58009.C.12=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0444\u0430\u043A\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043A\u043E\u0434\u043E\u0432\u0430\u044F \u0442\u043E\u0447\u043A\u0430 {0} \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0435\u0442 \u0441 \u043E\u0436\u0438\u0434\u0430\u0435\u043C\u043E\u0439 \u043A\u043E\u0434\u043E\u0432\u043E\u0439 \u0442\u043E\u0447\u043A\u043E\u0439 {1}.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
58009.C.11=\u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E \u0438\u0437-\u0437\u0430 \u043D\u0435\u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u043E\u0439 \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0438.
58009.C.10=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0414\u043B\u0438\u043D\u0430 VCS \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435 \u043D\u0443\u043B\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 VCM 0.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XJ213.C=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442 \u0447\u0438\u0441\u043B\u0430 \u0432 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0435 \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F traceLevel.
XJ105.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0434\u043B\u0438\u043D\u0430 \u043A\u043B\u044E\u0447\u0430 DES; \u043E\u0436\u0438\u0434\u0430\u0435\u043C\u0430\u044F \u0434\u043B\u0438\u043D\u0430 \u0440\u0430\u0432\u043D\u0430 {0}, \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0430 \u0434\u043B\u0438\u043D\u0430, \u0440\u0430\u0432\u043D\u0430\u044F {1}.
XSLA2.D=\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0430\u0435\u0442 \u0440\u0430\u0431\u043E\u0442\u0443; \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0432\u0432\u043E\u0434\u0430-\u0432\u044B\u0432\u043E\u0434\u0430 \u043F\u0440\u0438 \u0434\u043E\u0441\u0442\u0443\u043F\u0435 \u043A \u0444\u0430\u0439\u043B\u0443 \u0436\u0443\u0440\u043D\u0430\u043B\u0430.
C001=\u0414\u043B\u044F \u043A\u043B\u0430\u0441\u0441\u0430 {0} \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0439 \u0442\u0438\u043F \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u0430 \u0432 \u0444\u0430\u0439\u043B\u0435 jar {1}; \u043E\u0436\u0438\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043A\u0430\u0442 X509.
XBCX5.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043F\u0430\u0440\u043E\u043B\u044C \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u043D\u0430 \u043D\u0443\u043B\u0435\u0432\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435.
XJ204.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u044C \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 \u0441 \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u044B\u043C \u0443\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u043D\u0438\u0435\u043C {0}.
XSDB9.D=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 \u043F\u043E\u0442\u043E\u043A\u043E\u0432 {0} \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D.
58009.C.9=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u0434\u043B\u0438\u043D\u0430 PKGNAMCSN ({0}) \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u0434\u043B\u044F SQLAM {1}.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XBM0S.D=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u0442\u044C \u0444\u0430\u0439\u043B ''{0}'' \u0432 ''{1}''
