#Thu May 16 17:55:33 BRT 2013
0100E=Intento de XX de devolver demasiados conjuntos de resultados. 
XBCX5.S=No se puede cambiar la contrase\u00F1a de arranque a nulo.
XIE0T.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo auxiliar de objetos grandes especificado ({0}). Como medida de seguridad, y para posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo auxiliar de objetos grandes en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.
42916=No se puede crear el sin\u00F3nimo ''{0}'' para ''{1}'' puesto que dar\u00EDa lugar a una cadena de sin\u00F3nimos circular.
58009.C.19=Excepci\u00F3n de protocolo de red\: no se ha devuelto SECTKN.  La conexi\u00F3n se ha finalizado.
58009.C.18=Excepci\u00F3n de protocolo de red\: FDOCA LID no v\u00E1lido.  La conexi\u00F3n se ha finalizado.
58009.C.17=Excepci\u00F3n de protocolo de red\: se ha alcanzado de forma prematura el final de la corriente al leer InputStream, par\u00E1metro \#{0}.  La conexi\u00F3n se ha finalizado.
58009.C.16=Excepci\u00F3n de protocolo de red\: DSS encadenado con el mismo id al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
3B001.S=SAVEPOINT, {0} no existe o no est\u00E1 activo en la transacci\u00F3n actual.
58009.C.15=Excepci\u00F3n de protocolo de red\: la longitud de DSS no es 0 al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.14=Excepci\u00F3n de protocolo de red\: la pila de la colecci\u00F3n no est\u00E1 vac\u00EDa al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
XSDB9.D=El contenedor de corriente {0} est\u00E1 da\u00F1ado.
58009.C.13=Excepci\u00F3n de protocolo de red\: la colecci\u00F3n DDM contiene menos de 4 bytes de datos.  La conexi\u00F3n se ha finalizado.
XJ114.S=Nombre de cursor no v\u00E1lido ''{0}''
XJ213.C=La propiedad de conexi\u00F3n traceLevel no tiene un formato v\u00E1lido para un n\u00FAmero.
58009.C.12=Excepci\u00F3n de protocolo de red\: el punto de c\u00F3digo real, {0}, no coincide con el punto de c\u00F3digo esperado, {1}.  La conexi\u00F3n se ha finalizado.
58009.C.11=La conexi\u00F3n se ha finalizado porque la codificaci\u00F3n no est\u00E1 soportada.
58009.C.10=Excepci\u00F3n de protocolo de red\: s\u00F3lo una longitud de VCM o VCS puede ser mayor que 0.  La conexi\u00F3n se ha finalizado.
42XA9=La columna ''{0}'' necesita un tipo de datos expl\u00EDcitos. El tipo de datos se puede omitir \u00FAnicamente en columnas con cl\u00E1usulas de generaci\u00F3n.
XN002.U=No se ha devuelto SECTKN.
XSCH4.S=No se puede crear el conglomerado.
XSLA2.D=Se concluir\u00E1 el sistema, se obtuvo una excepci\u00F3n de E/S al acceder al archivo de anotaciones cronol\u00F3gicas.
XN020.S=Error al calcular o resolver un tipo definido por el usuario\: {0}
XJ015.M=Conclusi\u00F3n del sistema Derby.
XJ204.S=No se puede abrir el conjunto de resultados con la capacidad de retenci\u00F3n solicitada {0}.
XBM0S.D=No es posible renombrar el archivo ''{0}'' como ''{1}''
XJ105.S=La clave DES tiene una longitud incorrecta; longitud esperada {0}, longitud obtenida {1}.
XSAJ4.U=N\u00FAmero de filas calificadas
XJ123.S=Este m\u00E9todo debe llamarse para actualizar los valores de la fila actual o de la fila de inserci\u00F3n.
58009.C.9=Excepci\u00F3n de protocolo de red\: la longitud PKGNAMCSN, {0}, no es v\u00E1lida en SQLAM {1}.  La conexi\u00F3n se ha finalizado.
C001=La clase {0} tiene un tipo de certificado desconocido en el jar {1}, se esperaba un certificado X509.
58009.C.8=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para PKGID.  La conexi\u00F3n se ha finalizado.
XSLB1.S=La operaci\u00F3n de anotaci\u00F3n cronol\u00F3gica {0} ha encontrado un error al grabarse en la corriente de anotaciones, que podr\u00EDa deberse a una operaci\u00F3n de anotaci\u00F3n errante o al llenado del almacenamiento intermedio interno para anotaciones debido a un exceso de operaciones de anotaci\u00F3n de gran tama\u00F1o.
58009.C.7=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBCOLID.  La conexi\u00F3n se ha finalizado.
XN011.S=La longitud del nombre de procedimiento {0} no est\u00E1 dentro del rango v\u00E1lido entre 1 y {1}.
58009.C.21=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBNAM.  La conexi\u00F3n se ha finalizado.
58009.C.20=Excepci\u00F3n de protocolo de red\: s\u00F3lo uno de NVCM o NVCS puede ser no nulo.  La conexi\u00F3n se ha finalizado.
XJ042.S=''{0}'' no es un valor v\u00E1lido para la propiedad ''{1}''.
