#Thu May 16 17:55:33 BRT 2013
XJ214.S=Une erreur d''entr\u00E9e/sortie s''est produite lors d''un appel de m\u00E9thode free() sur un objet CLOB ou BLOB.
40XL1.T.1=Aucun verrou n''a pu \u00EAtre obtenu dans le d\u00E9lai demand\u00E9.  La liste lockTable est \: {0}
XN012.S=Sur les plateformes {0}, XA prend en charge la version {1} et les versions ult\u00E9rieures ; il s''agit de la version {2}
42908=L''instruction CREATE VIEW n''inclut pas de liste de colonnes.
D010=Sauvegarde abandonn\u00E9e en raison d''une erreur
42962=Une colonne de type Long ou un param\u00E8tre ''{0}'' n''est pas autoris\u00E9 dans des tables temporaires globales d\u00E9clar\u00E9es, ni des d\u00E9finitions de proc\u00E9dure. 
XJ106.S=Pas de remplissage 
XSLA3.D=Fichier journal alt\u00E9r\u00E9 ; des donn\u00E9es non valides se trouvent dans le flux de donn\u00E9es de journalisation.
XBCX6.S=Impossible de modifier le mot de passe d''amor\u00E7age en un type s\u00E9rialisable qui ne soit pas de type cha\u00EEne.
XSDG5.D=La base de donn\u00E9es n''est pas en mode cr\u00E9ation lorsque createFinished est appel\u00E9.
XJ070.S=Un argument de position n\u00E9gatif ou \u00E9gal \u00E0 z\u00E9ro ''{0}'' a \u00E9t\u00E9 transmis dans une m\u00E9thode Blob ou Clob.
XSAM2.S=Aucun index ni conglom\u00E9rat ayant pour ID de conglom ''{0}'' n''est \u00E0 supprimer.
XJ025.S=La longueur du flux en entr\u00E9e ne peut pas \u00EAtre n\u00E9gative.
XSDF6.S=Impossible de trouver la page d''allocation {0}.
XBM0T.D=Sous-protocole ambigu pour le nom de la base de donn\u00E9es {0}.   
XJ124.S=Mise \u00E0 jour de la colonne impossible.
XSLB2.S=L''op\u00E9ration de journalisation {0} enregistre trop de donn\u00E9es ; elle a satur\u00E9 la m\u00E9moire tampon du journal interne.
XSCH5.S=Dans une table de base, le num\u00E9ro de colonne demand\u00E9 {0} et le nombre maximum de colonnes {1} ne concordaient pas.
XSAJ5.U=Nombre de colonnes extraites.
43X9A.U=ResultSet de nombre de lignes
40XL1=Aucun verrou n''a pu \u00EAtre obtenu dans le d\u00E9lai demand\u00E9
XN021.S=Un objet de type {0} ne peut pas \u00EAtre converti en objet de type {1}.
C002=Exception de s\u00E9curit\u00E9 \u00E9mise lors de l''acc\u00E8s \u00E0 la classe {0} dans le fichier JAR {1} \: {2}
XJ061.S=La m\u00E9thode ''{0}'' est uniquement autoris\u00E9e sur les curseurs de d\u00E9filement.
XJ016.S=La m\u00E9thode ''{0}'' n''est pas autoris\u00E9e sur une instruction pr\u00E9par\u00E9e.
3B002.S=Le nombre maximal de points de sauvegarde a \u00E9t\u00E9 atteint. 
D001=\:\nAmor\u00E7age de Derby version {0} \: instance {1} \ndans le r\u00E9pertoire de base de donn\u00E9es {2} avec le chargeur de classe {3}\n
XJ115.S=Impossible d''ouvrir le resultSet avec la stabilit\u00E9 {0} requise.
42818=Les comparaisons entre ''{0}'' et ''{1}'' ne sont pas prises en charge. Les types doivent \u00EAtre comparables. Les types cha\u00EEne doivent \u00E9galement disposer d''un interclassement identique. Si l''interclassement est diff\u00E9rent pour les deux cha\u00EEnes, une solution consiste \u00E0 forcer un type d''op\u00E9rande destin\u00E9 \u00E0 appliquer l''interclassement par d\u00E9faut (par ex., SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'').
