#Thu May 16 17:55:33 BRT 2013
XJ214.S=IO hiba t\u00F6rt\u00E9nt a free() f\u00FCggv\u00E9ny CLOB vagy BLOB met\u00F3duson megh\u00EDv\u00E1sa sor\u00E1n.
40XL1.T.1=A k\u00E9rt id\u0151n bel\u00FCl nem foganatos\u00EDthat\u00F3 z\u00E1rol\u00E1s.  A lockTable ki\u00EDrat\u00E1sa\: {0}
XN012.S={0} platformokon az XA {1} \u00E9s \u00FAjabb v\u00E1ltozatokat t\u00E1mogat. Ez a v\u00E1ltozat {2}
42908=A CREATE VIEW utas\u00EDt\u00E1s nem tartalmaz oszloplist\u00E1t.
D010=A ment\u00E9s hiba miatt megszak\u00EDt\u00E1sra ker\u00FClt
42962=''{0}'' hossz\u00FA oszlopt\u00EDpus vagy param\u00E9ter deklar\u00E1lt glob\u00E1lis ideiglenes t\u00E1bl\u00E1ban vagy elj\u00E1r\u00E1smeghat\u00E1roz\u00E1sokban nem megengedett. 
XJ106.S=Nincs ilyen kit\u00F6lt\u00E9s 
XSLA3.D=A napl\u00F3 s\u00E9r\u00FClt, a napl\u00F3 adatfolyam \u00E9rv\u00E9nytelen adatokat tartalmaz.
XBCX6.S=A rendszerind\u00EDt\u00F3 jelsz\u00F3 nem m\u00F3dos\u00EDthat\u00F3 soros\u00EDthat\u00F3, nem karaktersorozat t\u00EDpusra.
XSDG5.D=Az adatb\u00E1zis nincs l\u00E9trehoz\u00E1si m\u00F3dban a createFinished h\u00EDv\u00E1sakor.
XJ070.S=Negat\u00EDv vagy nulla poz\u00EDci\u00F3argumentum (''{0}'') ker\u00FClt \u00E1tad\u00E1sra a Blob vagy Clob met\u00F3dusban.
XSAM2.S=Nem l\u00E9tezik megsz\u00FCntethet\u0151 index vagy konglomer\u00E1tum a k\u00F6vetkez\u0151 conglom azonos\u00EDt\u00F3val\: ''{0}''.
XJ025.S=A bemen\u0151 folyam hossza nem lehet negat\u00EDv.
XSDF6.S=Nem tal\u00E1lhat\u00F3 a k\u00F6vetkez\u0151 lefoglal\u00E1si oldal\: {0}.
XBM0T.D=F\u00E9lre\u00E9rthet\u0151 alprotokoll a k\u00F6vetkez\u0151 adatb\u00E1zisn\u00E9vhez\: {0}.   
XJ124.S=Az oszlop nem friss\u00EDthet\u0151.
XSLB2.S=A(z) {0} napl\u00F3z\u00E1si m\u0171velet nagy mennyis\u00E9g\u0171 adatot napl\u00F3z, megt\u00F6lt\u00F6tte a bels\u0151 napl\u00F3puffert.
XSCH5.S=Az alapt\u00E1bl\u00E1zatban elt\u00E9r\u00E9s tal\u00E1lhat\u00F3 a k\u00E9rt oszlopsz\u00E1m ({0}) \u00E9s a maxim\u00E1lis oszlopsz\u00E1m ({1}) k\u00F6z\u00F6tt.
XSAJ5.U=Leh\u00EDvott oszlopok sz\u00E1ma
40XL1=A k\u00E9rt id\u0151n bel\u00FCl nem foganatos\u00EDthat\u00F3 z\u00E1rol\u00E1s
C002=Biztons\u00E1gi kiv\u00E9tel t\u00F6rt\u00E9nt a(z) {1} jar {0} oszt\u00E1ly\u00E1nak el\u00E9r\u00E9se sor\u00E1n\: {2}
XJ061.S=A(z) ''{0}'' met\u00F3dus csak g\u00F6rgethet\u0151 kurzorokon enged\u00E9lyezett.
XJ016.S=A(z) ''{0}'' met\u00F3dus el\u0151k\u00E9sz\u00EDtett \u00E1llapotban nem megengedett.
3B002.S=A ment\u00E9si pontok el\u00E9rt\u00E9k a maxim\u00E1lis sz\u00E1mot. 
D001=\:\n Derby {0} v\u00E1ltozat bet\u00F6lt\u00E9se\: {1} p\u00E9ld\u00E1ny\na(z) {2} adatb\u00E1zis-k\u00F6nyvt\u00E1ron\: {3} \n
XJ115.S=A resultSet a k\u00E9rt {0} tarthat\u00F3s\u00E1ggal nem nyithat\u00F3 meg.
42818=A(z) ''{0}'' \u00E9s ''{1}'' \u00F6sszehasonl\u00EDt\u00E1sa nem t\u00E1mogatott.
