#Thu May 16 17:55:33 BRT 2013
XJ214.S=Se ha producido un error de E/S al llamar a free() en un CLOB o BLOB.
40XL1.T.1=No se ha podido obtener un bloqueo dentro del tiempo solicitado.  El vuelco de lockTable es\: {0}
XN012.S=En plataformas {0}, XA soporta la versi\u00F3n {1} y superiores, \u00E9sta es la versi\u00F3n {2}
42908=La sentencia CREATE VIEW no incluye una lista de columnas.
D010=Copia de seguridad terminada anormalmente debido a un error
42962=En las definiciones de procedimientos o tablas temporales globales declaradas no se permite el par\u00E1metro ''{0}'' o la columna del tipo long. 
XJ106.S=No existe dicho relleno 
XSLA3.D=Anotaciones cronol\u00F3gicas da\u00F1adas, datos no v\u00E1lidos en la corriente de anotaciones.
XBCX6.S=No se puede cambiar la contrase\u00F1a de arranque a un tipo serializable distinto de serie.
XSDG5.D=La base de datos no estaba en modalidad de creaci\u00F3n cuando se ha llamado a createFinished.
XJ070.S=Se ha pasado un argumento de posici\u00F3n negativo o cero ''{0}'' en un m\u00E9todo Blob o Clob.
XSAM2.S=No existe un \u00EDndice o conglomerado con id de conglomerado ''{0}'' para eliminar.
XJ025.S=La corriente de entrada no puede tener una longitud negativa.
XSDF6.S=No se puede encontrar la p\u00E1gina de asignaci\u00F3n {0}.
XBM0T.D=Subprotocolo ambiguo para el nombre de base de datos {0}.   
XJ124.S=Columna no actualizable.
XSLB2.S=La operaci\u00F3n de anotaci\u00F3n cronol\u00F3gica {0} est\u00E1 registrando demasiados datos, ha llenado el almacenamiento intermedio interno para anotaciones.
XSCH5.S=Existe una discrepancia en la tabla base entre el n\u00FAmero de columna solicitado {0} y el n\u00FAmero m\u00E1ximo de columnas {1}.
XSAJ5.U=N\u00FAmero de columnas extra\u00EDdas
43X9A.U=Conjunto de resultados de recuento de filas
40XL1=No se ha podido obtener un bloqueo dentro del tiempo solicitado
XN021.S=Un objeto de tipo {0} no se puede convertir en un objeto de tipo {1}.
C002=Se ha generado una excepci\u00F3n de seguridad al acceder a la clase {0} del jar {1} \: {2}
XJ061.S=El m\u00E9todo ''{0}'' s\u00F3lo est\u00E1 permitido sobre cursores de desplazamiento.
XJ016.S=El m\u00E9todo ''{0}'' no est\u00E1 permitido en una sentencia preparada.
3B002.S=Se alcanz\u00F3 el n\u00FAmero m\u00E1ximo de SAVEPOINT. 
D001=\:\n Arrancando Derby versi\u00F3n {0}\: instancia {1} \nen el directorio de base de datos {2} con el cargador de clases {3}\n
XJ115.S=No se puede abrir resultSet con la capacidad de retenci\u00F3n solicitada {0}.
42818=No se admiten comparaciones entre ''{0}'' y ''{1}''. Los tipos deben ser comparables. Adem\u00E1s, los tipos de cadenas tambi\u00E9n deben tener un sistema de ordenaci\u00F3n coincidente. Si el sistema de ordenaci\u00F3n no coincide, una posible soluci\u00F3n es convertir (con CAST) los operandos para forzar el uso del sistema de ordenaci\u00F3n predeterminado (por ejemplo\: SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'')
