#Thu May 16 17:55:33 BRT 2013
XJ214.S=CLOB \u307E\u305F\u306F BLOB \u306B\u5BFE\u3059\u308B free() \u306E\u547C\u3073\u51FA\u3057\u4E2D\u306B IO \u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
40XL1.T.1=\u8981\u6C42\u6642\u9593\u5185\u306B\u30ED\u30C3\u30AF\u3092\u7372\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002  lockTable \u30C0\u30F3\u30D7\: {0}
XN012.S={0} \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u3067\u306F\u3001XA \u306F\u30D0\u30FC\u30B8\u30E7\u30F3 {1} \u4EE5\u964D\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u30D0\u30FC\u30B8\u30E7\u30F3 {2} \u3067\u3059\u3002
42908=CREATE VIEW \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306B\u5217\u30EA\u30B9\u30C8\u304C\u3042\u308A\u307E\u305B\u3093\u3002
D010=\u30A8\u30E9\u30FC\u306E\u305F\u3081\u3001\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u304C\u30A2\u30DC\u30FC\u30C8\u3055\u308C\u307E\u3057\u305F
42962=long \u5217\u578B\u306E\u5217\u307E\u305F\u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC ''{0}'' \u306F\u3001\u5BA3\u8A00\u6E08\u307F\u30B0\u30ED\u30FC\u30D0\u30EB\u4E00\u6642\u8868\u307E\u305F\u306F\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3067\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002 
XJ106.S=\u305D\u306E\u3088\u3046\u306A\u57CB\u3081\u8FBC\u307F\u306F\u3042\u308A\u307E\u305B\u3093\u3002 
XSLA3.D=\u30ED\u30B0\u304C\u7834\u58CA\u3055\u308C\u3066\u304A\u308A\u3001\u30ED\u30B0\u30FB\u30B9\u30C8\u30EA\u30FC\u30E0\u306B\u7121\u52B9\u306A\u30C7\u30FC\u30BF\u304C\u3042\u308A\u307E\u3059\u3002
XBCX6.S=\u30D6\u30FC\u30C8\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u3001\u975E\u30B9\u30C8\u30EA\u30F3\u30B0\u306E\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u53EF\u80FD\u306A\u30BF\u30A4\u30D7\u306B\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSDG5.D=createFinished \u306E\u547C\u3073\u51FA\u3057\u6642\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u4F5C\u6210\u30E2\u30FC\u30C9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XJ070.S=\u8CA0\u307E\u305F\u306F\u30BC\u30ED\u306E\u4F4D\u7F6E\u5F15\u6570 ''{0}'' \u304C BLOB \u307E\u305F\u306F CLOB \u30E1\u30BD\u30C3\u30C9\u306B\u6E21\u3055\u308C\u307E\u3057\u305F\u3002
XSAM2.S=\u30C9\u30ED\u30C3\u30D7\u3059\u308B\u3001conglom id ''{0}'' \u3092\u6301\u3064\u7D22\u5F15\u307E\u305F\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XJ025.S=\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u306F\u8CA0\u306E\u9577\u3055\u3092\u6301\u3064\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSDF6.S=\u5272\u308A\u632F\u308A\u30DA\u30FC\u30B8 {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
XBM0T.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u540D {0} \u306E\u30B5\u30D6\u30D7\u30ED\u30C8\u30B3\u30EB\u304C\u672A\u78BA\u5B9A\u3067\u3059\u3002   
XJ124.S=\u5217\u306F\u66F4\u65B0\u3067\u304D\u307E\u305B\u3093\u3002
XSLB2.S=\u30ED\u30B0\u30FB\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 {0} \u304C\u8D85\u904E\u30C7\u30FC\u30BF\u3092\u30ED\u30AE\u30F3\u30B0\u3057\u3066\u3044\u307E\u3059\u3002\u5185\u90E8\u30ED\u30B0\u30FB\u30D0\u30C3\u30D5\u30A1\u30FC\u304C\u6E80\u676F\u3067\u3059\u3002
XSCH5.S=\u57FA\u672C\u8868\u306B\u304A\u3044\u3066\u3001\u8981\u6C42\u3055\u308C\u305F\u5217\u6570 {0} \u3068\u6700\u5927\u5217\u6570 {1} \u3068\u306E\u9593\u306B\u30DF\u30B9\u30DE\u30C3\u30C1\u304C\u3042\u308A\u307E\u3057\u305F\u3002
XSAJ5.U=\u30D5\u30A7\u30C3\u30C1\u3055\u308C\u305F\u5217\u6570
43X9A.U=\u884C\u30AB\u30A6\u30F3\u30C8 ResultSet
40XL1=\u8981\u6C42\u6642\u9593\u5185\u306B\u30ED\u30C3\u30AF\u3092\u7372\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F
XN021.S=\u578B {0} \u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u578B {1} \u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u30AD\u30E3\u30B9\u30C8\u3067\u304D\u307E\u305B\u3093\u3002
C002=JAR {1} \u306E\u30AF\u30E9\u30B9 {0} \u306B\u30A2\u30AF\u30BB\u30B9\u4E2D\u306B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F \: {2}
XJ061.S=''{0}'' \u30E1\u30BD\u30C3\u30C9\u306F\u3001\u30B9\u30AF\u30ED\u30FC\u30EB\u30FB\u30AB\u30FC\u30BD\u30EB\u3067\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
XJ016.S=\u30E1\u30BD\u30C3\u30C9 ''{0}'' \u306F\u3001\u6E96\u5099\u6E08\u307F\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
3B002.S=\u30BB\u30FC\u30D6\u30DD\u30A4\u30F3\u30C8\u306E\u6700\u5927\u6570\u306B\u5230\u9054\u3057\u307E\u3057\u305F\u3002 
D001=\:\n Derby \u30D0\u30FC\u30B8\u30E7\u30F3 {0}\: \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {1} \u3092\n\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC {3} \u306B\u3088\u3063\u3066\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA {2} \u4E0A\u3067\u30D6\u30FC\u30C8\u4E2D \n\n
XJ115.S=\u8981\u6C42\u3055\u308C\u305F\u4FDD\u6301\u6A5F\u80FD {0} \u3067\u7D50\u679C\u30BB\u30C3\u30C8\u3092\u958B\u304F\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
42818=''{0}'' \u3068 ''{1}'' \u306E\u6BD4\u8F03\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u578B\u304C\u6BD4\u8F03\u53EF\u80FD\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 \u6587\u5B57\u5217\u578B\u306E\u5834\u5408\u306F\u3001\u7167\u5408\u9806\u5E8F\u306E\u4E00\u81F4\u3082\u5FC5\u8981\u3067\u3059\u3002 \u7167\u5408\u9806\u5E8F\u304C\u4E00\u81F4\u3057\u306A\u3044\u5834\u5408\u3001\u30AA\u30DA\u30E9\u30F3\u30C9\u3092\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u7167\u5408\u9806\u5E8F\u306B\u5F37\u5236\u7684\u306B\u30AD\u30E3\u30B9\u30C8\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059 (\u4F8B\: SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'')
