#Thu May 16 17:55:33 BRT 2013
XJ214.S=Podczas wywo\u0142ywania funkcji free() dla obiektu CLOB lub BLOB wyst\u0105pi\u0142 b\u0142\u0105d we/wy.
40XL1.T.1=Nie mo\u017Cna uzyska\u0107 blokady w czasie jej \u017C\u0105dania  Zrzut tabeli blokad\: {0}
XN012.S=Na platformach {0}, interfejs XA obs\u0142uguje wersj\u0119 {1} i nowsze, a to jest wersja {2}
42908=Instrukcja CREATE VIEW nie zawiera listy kolumn.
D010=Tworzenie kopii zapasowej zosta\u0142o przerwane z powodu b\u0142\u0119du
42962=Kolumna o typie kolumna d\u0142uga lub parametr ''{0}'' nie s\u0105 dozwolone w deklarowanych globalnych tabelach tymczasowych ani w definicjach procedur. 
XJ106.S=Brak takiego dope\u0142niania 
XSLA3.D=Dziennik jest uszkodzony. Niepoprawne dane w strumieniu dziennika.
XBCX6.S=Nie mo\u017Cna zmieni\u0107 has\u0142a startowego na typ szeregowalny inny ni\u017C \u0142a\u0144cuch.
XSDG5.D=Podczas wywo\u0142ywania metody createFinished baza danych nie znajduje si\u0119 w trybie tworzenia.
XJ070.S=W metodzie Blob lub Clob przekazany zosta\u0142 argument ''{0}'' ujemny lub r\u00F3wny zero.
XSAM2.S=Nie ma indeksu lub konglomeratu o identyfikatorze ''{0}'' do usuni\u0119cia.
XJ025.S=Strumie\u0144 wej\u015Bciowy nie mo\u017Ce mie\u0107 ujemnej d\u0142ugo\u015Bci.
XSDF6.S=Nie mo\u017Cna znale\u017A\u0107 strony alokacji {0}.
XBM0T.D=Niejednoznaczny podprotok\u00F3\u0142 dla nazwy bazy danych {0}. 
XJ124.S=Kolumna nie mo\u017Ce by\u0107 aktualizowana.
XSLB2.S=Operacja rejestrowania {0} zapisa\u0142a nadmiern\u0105 ilo\u015B\u0107 danych i wype\u0142ni\u0142a wewn\u0119trzny bufor dziennika.
XSCH5.S=W tabeli podstawowej by\u0142a niezgodno\u015B\u0107 mi\u0119dzy \u017C\u0105danym numerem kolumny, {0}, a maksymaln\u0105 liczb\u0105 kolumn r\u00F3wn\u0105 {1}.
XSAJ5.U=Liczba pobranych kolumn
40XL1=Nie mo\u017Cna uzyska\u0107 blokady w czasie jej \u017C\u0105dania
C002=Podczas dost\u0119pu do klasy {0} w pliku jar {1} \: {2} zg\u0142oszony zosta\u0142 wyj\u0105tek bezpiecze\u0144stwa
XJ061.S=Metoda ''{0}'' jest dozwolona tylko dla kursor\u00F3w typu scroll.
XJ016.S=Metoda ''{0}'' nie jest dozwolona dla przygotowanej instrukcji.
3B002.S=Osi\u0105gni\u0119to maksymaln\u0105 liczb\u0119 punkt\u00F3w zapisu. 
D001=\:\n Uruchamianie wersji {0} systemu Derby\: instancja {1}\nw katalogu bazy danych {2} {3} \n
XJ115.S=Nie mo\u017Cna otworzy\u0107 obiektu ResultSet z \u017C\u0105dan\u0105 mo\u017Cliwo\u015Bci\u0105 wstrzymania {0}.
42818=Por\u00F3wnania mi\u0119dzy ''{0}'' i ''{1}'' nie s\u0105 obs\u0142ugiwane.
