#Thu May 16 17:55:33 BRT 2013
XJ214.S=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u0432\u0432\u043E\u0434\u0430-\u0432\u044B\u0432\u043E\u0434\u0430 \u043F\u0440\u0438 \u0432\u044B\u0437\u043E\u0432\u0435 \u043C\u0435\u0442\u043E\u0434\u0430 free() \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u0430 CLOB \u0438\u043B\u0438 BLOB.
40XL1.T.1=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0443 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0435 \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0438.  \u0414\u0430\u043C\u043F lockTable\: {0}
XN012.S=\u041D\u0430 \u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0430\u0445 {0} XA \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u0432\u0435\u0440\u0441\u0438\u044E {1} \u0438 \u043D\u043E\u0432\u0435\u0435; \u043D\u043E\u043C\u0435\u0440 \u0434\u0430\u043D\u043D\u043E\u0439 \u0432\u0435\u0440\u0441\u0438\u0438 - {2}
42908=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 CREATE VIEW \u043D\u0435 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0441\u043F\u0438\u0441\u043A\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432.
D010=\u0420\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0435 \u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E \u0438\u0437-\u0437\u0430 \u043E\u0448\u0438\u0431\u043A\u0438
42962=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 \u0438\u043B\u0438 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \u0442\u0438\u043F\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0441 \u0434\u043B\u0438\u043D\u043D\u044B\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u043C\u0438 (''{0}'') \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u0433\u043B\u043E\u0431\u0430\u043B\u044C\u043D\u044B\u0445 \u043E\u0431\u044A\u044F\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0445 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0445 \u0438\u043B\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F\u0445 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440. 
XJ106.S=\u0422\u0430\u043A\u043E\u0433\u043E \u0437\u0430\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u043D\u0435\u0442 
XSLA3.D=\u0416\u0443\u0440\u043D\u0430\u043B \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D; \u0432 \u043F\u043E\u0442\u043E\u043A\u0435 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435.
XBCX6.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043F\u0430\u0440\u043E\u043B\u044C \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u043D\u0430 \u043D\u0435\u0441\u0442\u0440\u043E\u0447\u043D\u044B\u0439 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0443\u0435\u043C\u044B\u0439 \u0442\u0438\u043F.
XSDG5.D=\u0411\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0435 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u043F\u0440\u0438 \u0432\u044B\u0437\u043E\u0432\u0435 createFinished.
XJ070.S=\u0412 \u043C\u0435\u0442\u043E\u0434\u0435 BLOB \u0438\u043B\u0438 CLOB \u043F\u0435\u0440\u0435\u0434\u0430\u043D \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u0439 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442 \u0438\u043B\u0438 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442 \u043D\u0443\u043B\u0435\u0432\u043E\u0439 \u043F\u043E\u0437\u0438\u0446\u0438\u0438 (''{0}'').
XSAM2.S=\u041D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0438 \u0438\u043D\u0434\u0435\u043A\u0441\u0430, \u043D\u0438 \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442\u0430 \u0441 ID \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442\u0430 ''{0}'', \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0431\u044B \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C.
XJ025.S=\u0414\u043B\u0438\u043D\u0430 \u0432\u0445\u043E\u0434\u043D\u043E\u0433\u043E \u043F\u043E\u0442\u043E\u043A\u0430 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0439.
XSDF6.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043D\u0430\u0439\u0442\u0438 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F {0}.
XBM0T.D=\u041D\u0435\u043E\u0434\u043D\u043E\u0437\u043D\u0430\u0447\u043D\u044B\u0439 \u0441\u0443\u0431\u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B \u0434\u043B\u044F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C {0}.   
XJ124.S=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 \u043D\u0435 \u043F\u043E\u0434\u043B\u0435\u0436\u0438\u0442 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E.
XSLB2.S=\u041E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0436\u0443\u0440\u043D\u0430\u043B\u0430 {0} \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442 \u0432 \u0436\u0443\u0440\u043D\u0430\u043B \u0438\u0437\u0431\u044B\u0442\u043E\u0447\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435; \u043E\u043D\u0430 \u0437\u0430\u043F\u043E\u043B\u043D\u0438\u043B\u0430 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0439 \u0431\u0443\u0444\u0435\u0440 \u0436\u0443\u0440\u043D\u0430\u043B\u0430.
XSCH5.S=\u0417\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ({0}) \u0432 \u0431\u0430\u0437\u043E\u0432\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u043D\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u043C\u0443 \u0447\u0438\u0441\u043B\u0443 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 ({1}).
XSAJ5.U=\u0427\u0438\u0441\u043B\u043E \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0445 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432
40XL1=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0443 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0435 \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0438
C002=\u0421\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0437\u0430\u0449\u0438\u0442\u044B \u043F\u0440\u0438 \u0434\u043E\u0441\u0442\u0443\u043F\u0435 \u043A \u043A\u043B\u0430\u0441\u0441\u0443 {0} \u0432 \u0444\u0430\u0439\u043B\u0435 jar {1} \: {2}
XJ061.S=\u041C\u0435\u0442\u043E\u0434 ''{0}'' \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043A\u0443\u0440\u0441\u043E\u0440\u0430\u0445 \u0441 \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u043E\u0439.
XJ016.S=\u041C\u0435\u0442\u043E\u0434 ''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430.
3B002.S=\u0414\u043E\u0441\u0442\u0438\u0433\u043D\u0443\u0442\u043E \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u0442\u043E\u0447\u0435\u043A \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F. 
D001=\:\n \u041F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442\u0441\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0430 Derby \u0432\u0435\u0440\u0441\u0438\u0438 {0}\: \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 {1}\n\u0432 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0435 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 {2} {3} \n
XJ115.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u044C \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u043D\u0430\u0431\u043E\u0440\u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441 \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u044B\u043C \u0443\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u043D\u0438\u0435\u043C {0}.
42818=\u0421\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044F \u043C\u0435\u0436\u0434\u0443 ''{0}'' \u0438 ''{1}'' \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442\u0441\u044F.
