#Thu May 16 17:55:33 BRT 2013
XJ214.S=Ocorreu um erro de E/S ao chamar ''free()'' para um CLOB ou BLOB.
40XL1.T.1=N\u00E3o foi poss\u00EDvel obter o bloqueio dentro do tempo requerido. O dump de lockTable \u00E9\: {0}
XN012.S=Nas plataformas {0}, o XA suporta a vers\u00E3o {1} ou mais recente, esta vers\u00E3o \u00E9 a {2}
42908=A instru\u00E7\u00E3o CREATE VIEW n\u00E3o inclui uma lista de colunas.
D010=C\u00F3pia de seguran\u00E7a interrompida devido a erro
42962=N\u00E3o \u00E9 permitido usar tipo de coluna longo ou par\u00E2metro (''{0}'') em tabela tempor\u00E1ria global declarada, ou em defini\u00E7\u00E3o de procedimento.
XJ106.S=N\u00E3o existe este tipo de preenchimento
XSLA3.D=Log corrompido, h\u00E1 dados inv\u00E1lidos no fluxo de log.
XBCX6.S=N\u00E3o \u00E9 poss\u00EDvel alterar a senha de inicializa\u00E7\u00E3o para um tipo seri\u00E1vel que n\u00E3o seja cadeia de caracteres.
XSDG5.D=O banco de dados n\u00E3o estava no modo de cria\u00E7\u00E3o quando createFinished foi chamado.
XJ070.S=Argumento de posi\u00E7\u00E3o zero ou negativa ''{0}'' passado para um m\u00E9todo Blob ou Clob.
XSAM2.S=N\u00E3o h\u00E1 nenhum \u00EDndice ou conglomerado com id de conglomerado ''{0}'' para remover.
XJ025.S=O fluxo de entrada n\u00E3o pode ter comprimento negativo.
XSDF6.S=N\u00E3o foi poss\u00EDvel encontrar a p\u00E1gina de aloca\u00E7\u00E3o {0}.
XBM0T.D=Subprotocolo amb\u00EDguo para o banco de dados de nome {0}.
XJ124.S=A coluna n\u00E3o \u00E9 atualiz\u00E1vel.
XSLB2.S=Opera\u00E7\u00E3o de log {0} registrando dados em excesso, enchendo o buffer interno do log.
XSCH5.S=Em uma tabela base n\u00E3o houve correspond\u00EAncia entre o n\u00FAmero da coluna requisitada {0} e o n\u00FAmero m\u00E1ximo de colunas {1}.
XSAJ5.U=N\u00FAmero de colunas buscadas
40XL1=N\u00E3o foi poss\u00EDvel obter o bloqueio dentro do tempo requerido.
C002=Lan\u00E7ada uma exce\u00E7\u00E3o de seguran\u00E7a ao acessar a classe {0} no jar {1} \: {2}
XJ061.S=O m\u00E9todo ''{0}'' \u00E9 permitido apenas nos cursores com rolamento.
XJ016.S=N\u00E3o permitido o m\u00E9todo ''{0}'' em instru\u00E7\u00E3o preparada.
3B002.S=Foi atingido o n\u00FAmero m\u00E1ximo de pontos de salvamentos.
D001=\:\n Inicializando o Derby vers\u00E3o {0}\: inst\u00E2ncia {1}\nno diret\u00F3rio de banco de dados {2} \n
XJ115.S=N\u00E3o foi poss\u00EDvel abrir o resultSet com a capacidade de reten\u00E7\u00E3o requisitada {0}.
42818=N\u00E3o s\u00E3o suportadas compara\u00E7\u00F5es entre ''{0}'' e ''{1}''.
