#Thu May 16 17:55:33 BRT 2013
XJ071.S=Se ha pasado un argumento de longitud negativo ''{0}'' en un m\u00E9todo BLOB o CLOB.
BIN01=(No se muestra el valor de datos binarios)
XSAM3.S=No existe un \u00EDndice o conglomerado con id de conglomerado ''{0}''.
42846=No se pueden convertir los tipos ''{0}'' a ''{1}''.
XSDF7.S=No se ha podido enclavar la p\u00E1gina que  se acaba de crear {0}
XJ125.S=Este m\u00E9todo s\u00F3lo debe llamarse en objetos ResultSet que sean desplazables (tipo TYPE_SCROLL_INSENSITIVE).
42909=La sentencia CREATE TABLE no incluye ninguna lista de columnas.
XSCH6.S=El contenedor heap con id de contenedor {0} est\u00E1 cerrado.
XSAJ6.U=Bit establecido de columnas extra\u00EDdas
XJ044.S=''{0}'' no es una escala v\u00E1lida.
43X9B.U=Recuento de filas
D011=se ha eliminado la copia de seguridad antigua de {0}
42Z9A=lectura no comprometida
XJ062.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para ResultSet.setFetchSize(int rows).
XJ017.S=No se permite el mandato SAVEPOINT dentro de un c\u00F3digo de desencadenantes.
XJ116.S=No se puede a\u00F1adir m\u00E1s de {0} mandatos a un \u00FAnico proceso por lotes.
XJ215.S=No puede llamar a otro m\u00E9todo java.sql.Clob o java.sql.Blob despu\u00E9s de haber llamado al m\u00E9todo free() ni despu\u00E9s de haber finalizado (COMMIT) o cancelado (ROLLBACK) la transacci\u00F3n de Blob/Clob.
XJ080.S=USING execute statement ha pasado {0} par\u00E1metros en lugar de {1}.
42837=ALTER TABLE ''{0}'' ha especificado atributos para la columna ''{1}'' que no son compatibles con la columna existente.
XN013.S=Orientaci\u00F3n de desplazamiento no v\u00E1lida.
XBM0U.S=No se han registrado clases para el identificador {0}.
C003=Excepci\u00F3n al cargar el jar de base de datos {0} - {1}
XJ008.S=No se puede retrotraer o liberar un SAVEPOINT en modalidad AutoCommit.
XSLA4.D=No se puede grabar en las anotaciones cronol\u00F3gicas, puede que est\u00E9n llenas.  Suprima archivos innecesarios.  Tambi\u00E9n es posible que el sistema de archivos sea de s\u00F3lo lectura, que el disco tenga error o alg\u00FAn otro problema con el soporte.  
XJ107.S=Relleno incorrecto
D002=\:\nCerrando la instancia {0} en el directorio de base de datos {1} con cargador de clases {2}
XBCX7.S=Formato incorrecto para cambiar la contrase\u00F1a de arranque.  El formato debe ser\: contrase\u00F1a_arranque_anterior, contrase\u00F1a_arranque_nueva.
XSDG6.D=No se encontr\u00F3 el directorio de segmentos de datos al restaurar la copia de seguridad {0}. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
XJ206.S=El texto SQL ''{0}'' no contiene se\u00F1ales.
