#Thu May 16 17:55:33 BRT 2013
XJ071.S=\u0412 \u043C\u0435\u0442\u043E\u0434\u0435 BLOB \u0438\u043B\u0438 CLOB \u043F\u0435\u0440\u0435\u0434\u0430\u043D \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0439 \u0434\u043B\u0438\u043D\u044B (''{0}'').
XSAM3.S=\u041D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0438 \u0438\u043D\u0434\u0435\u043A\u0441\u0430, \u043D\u0438 \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442\u0430 \u0441 ID \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442\u0430 ''{0}''.
42846=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u0442\u044C \u0442\u0438\u043F\u044B ''{0}'' \u0432 ''{1}''.
XSDF7.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0437\u0430\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0437\u0430\u043D\u043E\u0432\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u0443\u044E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 {0}
XJ125.S=\u042D\u0442\u043E\u0442 \u043C\u0435\u0442\u043E\u0434 \u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u0432\u044B\u0437\u044B\u0432\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet), \u043F\u043E\u0434\u043B\u0435\u0436\u0430\u0449\u0438\u0445 \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u0435 (\u0442\u0438\u043F\u0430 TYPE_SCROLL_INSENSITIVE).
XSCH6.S=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 \u043A\u0443\u0447\u0438 \u0441 ID \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 {0} \u0437\u0430\u043A\u0440\u044B\u0442.
XSAJ6.U=\u0411\u0438\u0442\u043E\u0432\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0445 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432
XJ044.S=''{0}'' - \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u043E\u0431\u043B\u0430\u0441\u0442\u044C.
D011=\u0443\u0434\u0430\u043B\u0435\u043D\u0430 \u0441\u0442\u0430\u0440\u0430\u044F \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u0430\u044F \u043A\u043E\u043F\u0438\u044F \u0432 {0}
42Z9A=\u0447\u0442\u0435\u043D\u0438\u0435 \u0431\u0435\u0437 \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u044F
XJ062.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 ''{0}'' \u0434\u043B\u044F ResultSet.setFetchSize(int rows).
XJ017.S=\u0412\u043D\u0443\u0442\u0440\u0438 \u043A\u043E\u0434\u0430 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430 \u043A\u043E\u043C\u0430\u043D\u0434\u0430 savepoint \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F.
XJ116.S=\u0412 \u043E\u0434\u043D\u043E \u043F\u0430\u043A\u0435\u0442\u043D\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435 \u043C\u043E\u0436\u043D\u043E \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u043D\u0435 \u0431\u043E\u043B\u0435\u0435 {0} \u043A\u043E\u043C\u0430\u043D\u0434(\u044B).
XJ215.S=\u041F\u043E\u0441\u043B\u0435 \u0432\u044B\u0437\u043E\u0432\u0430 \u043C\u0435\u0442\u043E\u0434\u0430 free() \u043D\u0435\u043B\u044C\u0437\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0434\u0440\u0443\u0433\u0438\u0435 \u043C\u0435\u0442\u043E\u0434\u044B java.sql.Clob/java.sql.Blob.
XJ080.S=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F USING \u043F\u0435\u0440\u0435\u0434\u0430\u043B {0} \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440(\u0430/\u043E\u0432) \u0432\u043C\u0435\u0441\u0442\u043E {1}.
42837=\u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435 ALTER TABLE ''{0}'' \u0437\u0430\u0434\u0430\u0435\u0442 \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{1}'' \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043D\u0435\u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C\u044B\u043C\u0438 \u0441 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u043C \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u043C.
XN013.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u0438.
XBM0U.S=\u0414\u043B\u044F \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 {0} \u043D\u0435 \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u043D\u0438\u043A\u0430\u043A\u043E\u0433\u043E \u043A\u043B\u0430\u0441\u0441\u0430.
C003=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0435 \u0444\u0430\u0439\u043B\u0430 jar \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445\: {0} - {1}
XJ008.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u043E\u0442\u043A\u0430\u0442 \u0438\u043B\u0438 \u0432\u044B\u0441\u0432\u043E\u0431\u043E\u0436\u0434\u0435\u043D\u0438\u0435 \u0442\u043E\u0447\u043A\u0438 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u044F.
XSLA4.D=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0437\u0430\u043F\u0438\u0441\u044C \u0432 \u0436\u0443\u0440\u043D\u0430\u043B; \u0432\u0435\u0440\u043E\u044F\u0442\u043D\u0435\u0435 \u0432\u0441\u0435\u0433\u043E, \u0436\u0443\u0440\u043D\u0430\u043B \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D.  \u0423\u0434\u0430\u043B\u0438\u0442\u0435 \u043D\u0435\u043D\u0443\u0436\u043D\u044B\u0435 \u0444\u0430\u0439\u043B\u044B.  \u0422\u0430\u043A\u0436\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0447\u0442\u043E \u0444\u0430\u0439\u043B\u043E\u0432\u0430\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u0430 \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F, \u043B\u0438\u0431\u043E \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u043D\u0430 \u0434\u0438\u0441\u043A\u0435, \u043B\u0438\u0431\u043E \u0432\u043E\u0437\u043D\u0438\u043A\u043B\u0438 \u043A\u0430\u043A\u0438\u0435-\u043B\u0438\u0431\u043E \u0434\u0440\u0443\u0433\u0438\u0435 \u043E\u0448\u0438\u0431\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0438\u0442\u0435\u043B\u0435.  
XJ107.S=\u041D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0437\u0430\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435
D002=\:\n\u0417\u0430\u0432\u0435\u0440\u0448\u0430\u0435\u0442\u0441\u044F \u0440\u0430\u0431\u043E\u0442\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 {0}
XBCX7.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442 \u0434\u043B\u044F \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438.  \u0414\u043E\u043B\u0436\u0435\u043D \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u0444\u043E\u0440\u043C\u0430\u0442\: \u043F\u0440\u0435\u0436\u043D\u0438\u0439_\u043F\u0430\u0440\u043E\u043B\u044C_\u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438, \u043D\u043E\u0432\u044B\u0439_\u043F\u0430\u0440\u043E\u043B\u044C_\u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438.
XSDG6.D=\u0412\u043E \u0432\u0440\u0435\u043C\u044F \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u0432 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0439 \u043A\u043E\u043F\u0438\u0438 {0} \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0441\u0435\u0433\u043C\u0435\u043D\u0442\u0430 \u0434\u0430\u043D\u043D\u044B\u0445. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u044D\u0442\u043E \u043D\u0443\u0436\u043D\u0430\u044F \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u0430\u044F \u043A\u043E\u043F\u0438\u044F \u0438 \u0447\u0442\u043E \u043E\u043D\u0430 \u043D\u0435 \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D\u0430.
XJ206.S=\u0423 \u0442\u0435\u043A\u0441\u0442\u0430 SQL ''{0}'' \u043D\u0435\u0442 \u043C\u0430\u0440\u043A\u0435\u0440\u043E\u0432.
