#Thu May 16 17:55:33 BRT 2013
XJ071.S=\u8CA0\u306E\u9577\u3055\u5F15\u6570 ''{0}'' \u304C BLOB \u307E\u305F\u306F CLOB \u30E1\u30BD\u30C3\u30C9\u306B\u6E21\u3055\u308C\u307E\u3057\u305F\u3002
BIN01=(\u30D0\u30A4\u30CA\u30EA\u30C7\u30FC\u30BF\u5024\u306F\u8868\u793A\u3055\u308C\u3066\u3044\u307E\u305B\u3093)
XSAM3.S=conglom id ''{0}'' \u3092\u6301\u3064\u7D22\u5F15\u307E\u305F\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
42846=\u578B ''{0}'' \u3092 ''{1}'' \u306B\u5909\u63DB\u3067\u304D\u307E\u305B\u3093\u3002
XSDF7.S=\u65B0\u3057\u304F\u4F5C\u6210\u3055\u308C\u305F\u30DA\u30FC\u30B8\u3092\u30E9\u30C3\u30C1\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: {0}
XJ125.S=\u3053\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u30B9\u30AF\u30ED\u30FC\u30EB\u53EF\u80FD\u306A ResultSet \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 (TYPE_SCROLL_SENSITIVE \u578B\u307E\u305F\u306F TYPE_SCROLL_INSENSITIVE \u578B) \u306B\u5BFE\u3057\u3066\u306E\u307F\u547C\u3073\u51FA\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
42909=CREATE TABLE \u6587\u306B\u5217\u30EA\u30B9\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XSCH6.S=\u30D2\u30FC\u30D7\u30FB\u30B3\u30F3\u30C6\u30CA\u30FC (\u30B3\u30F3\u30C6\u30CA\u30FC ID {0}) \u304C\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u307E\u3057\u305F\u3002
XSAJ6.U=\u30D5\u30A7\u30C3\u30C1\u3055\u308C\u305F\u30D3\u30C3\u30C8\u5217\u30BB\u30C3\u30C8
XJ044.S=''{0}'' \u306F\u7121\u52B9\u306A\u76EE\u76DB\u308A\u3067\u3059\u3002
43X9B.U=\u884C\u30AB\u30A6\u30F3\u30C8
D011={0} \u306B\u3042\u308B\u53E4\u3044\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30B3\u30D4\u30FC\u3092\u9664\u53BB\u3057\u307E\u3057\u305F
42Z9A=\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u8AAD\u307F\u53D6\u308A
XJ062.S=ResultSet.setFetchSize(int rows) \u306B\u5BFE\u3059\u308B\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u5024 ''{0}''\u3002
XJ017.S=savepoint \u30B3\u30DE\u30F3\u30C9\u306F\u3001\u30C8\u30EA\u30AC\u30FC\u30FB\u30B3\u30FC\u30C9\u5185\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
XJ116.S=\u5358\u4E00\u306E\u30D0\u30C3\u30C1\u306B\u8FFD\u52A0\u3067\u304D\u308B\u30B3\u30DE\u30F3\u30C9\u306F {0} \u500B\u4EE5\u4E0B\u3067\u3059\u3002
XJ215.S=free() \u30E1\u30BD\u30C3\u30C9\u306E\u547C\u3073\u51FA\u3057\u5F8C\u3001\u307E\u305F\u306F BLOB/CLOB \u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30B3\u30DF\u30C3\u30C8\u307E\u305F\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u5F8C\u306B\u3001\u305D\u306E\u4ED6\u306E java.sql.Clob/java.sql.Blob \u30E1\u30BD\u30C3\u30C9\u3092\u547C\u3073\u51FA\u3059\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XJ080.S=USING \u5B9F\u884C\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C {1} \u3067\u306F\u306A\u304F {0} \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u6E21\u3057\u307E\u3057\u305F\u3002
42837=\u5217 ''{1}'' \u306B\u6307\u5B9A\u3055\u308C\u305F ALTER TABLE ''{0}'' \u5C5E\u6027\u306F\u3001\u65E2\u5B58\u306E\u5217\u3068\u4E92\u63DB\u6027\u304C\u3042\u308A\u307E\u305B\u3093\u3002
XN013.S=\u7121\u52B9\u306A\u30B9\u30AF\u30ED\u30FC\u30EB\u65B9\u5411\u3067\u3059\u3002
XBM0U.S=ID {0} \u306B\u5BFE\u3057\u3066\u30AF\u30E9\u30B9\u304C\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
C003=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 JAR {0} \u306E\u30ED\u30FC\u30C9\u4E2D\u306B\u4F8B\u5916 - {1}
XJ008.S=\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u30FB\u30E2\u30FC\u30C9\u3067\u306F\u3001\u30BB\u30FC\u30D6\u30DD\u30A4\u30F3\u30C8\u306E\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u307E\u305F\u306F\u30EA\u30EA\u30FC\u30B9\u3092\u884C\u3046\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
XSLA4.D=\u30ED\u30B0\u306B\u66F8\u304D\u8FBC\u3081\u307E\u305B\u3093\u3002\u30ED\u30B0\u304C\u6E80\u676F\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002  \u4E0D\u5FC5\u8981\u306A\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002  \u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u304C\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3042\u308B\u3001\u30C7\u30A3\u30B9\u30AF\u306B\u969C\u5BB3\u304C\u3042\u308B\u3001\u307E\u305F\u306F\u30E1\u30C7\u30A3\u30A2\u306B\u4F55\u3089\u304B\u306E\u554F\u984C\u304C\u3042\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002  
XJ107.S=\u6B63\u3057\u304F\u306A\u3044\u57CB\u3081\u8FBC\u307F\u3067\u3059\u3002
D002=\:\n\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC {2} \u3092\u6301\u3064\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA {1} \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {0} \u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u3066\u3044\u307E\u3059
XBCX7.S=\u30D6\u30FC\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u5909\u66F4\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u304C\u8AA4\u308A\u3067\u3059\u3002  \u6B63\u3057\u3044\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u306F\u6B21\u306E\u901A\u308A\u3067\u3059\: old_boot_password, new_boot_password\u3002
XSDG6.D=\u30EA\u30B9\u30C8\u30A2\u306E\u9593\u3001\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u4E2D\u306B\u30C7\u30FC\u30BF\u30FB\u30BB\u30B0\u30E1\u30F3\u30C8\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002 \u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30B3\u30D4\u30FC\u304C\u6B63\u3057\u3044\u3082\u306E\u3067\u3042\u308A\u3001\u305D\u308C\u304C\u7834\u58CA\u3055\u308C\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XJ206.S=SQL \u30C6\u30AD\u30B9\u30C8 ''{0}'' \u306B\u30C8\u30FC\u30AF\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
