#Thu May 16 17:55:33 BRT 2013
XJ018.S=Der Spaltenname muss ungleich null sein.
XJ117.S=Gem\u00E4\u00DF J2EE k\u00F6nnen Abfragen nicht im Batch-Modus verarbeitet werden.
XJ216.S=Die L\u00E4nge dieses BLOB/CLOB ist noch nicht verf\u00FCgbar. Wenn ein BLOB oder CLOB als ein Datenstrom zug\u00E4nglich ist, wird die L\u00E4nge erst dann verf\u00FCgbar, nachdem der gesamte Datenstrom verarbeitet wurde.
XJ081.S=An die Methode ''{2}'' wurde der ung\u00FCltige Wert ''{0}'' als Parameter ''{1}'' \u00FCbergeben.
D012=Die Sicherung ist abgeschlossen. Protokolladresse\: {0} \n
42Z9B=Die externe virtuelle Tabellenschnittstelle unterst\u00FCtzt keine BLOB- oder CLOB-Spalten. ''{0}''-Spalte ''{1}''. 
XN014.S=Beim Lesen aus einem durch den Parameter \#{0} festgelegten Stream ist eine Ausnahme aufgetreten.  Die verbleibenden vom Server erwarteten Daten wurden mit 0x0 aufgef\u00FCllt. Die Ausnahme generierte folgende Meldung\: {1}.
XBM0V.S=Beim Laden der f\u00FCr die ID {0} registrierten Klasse {1} wurde eine Ausnahme ausgel\u00F6st.
XJ009.S=F\u00FCr das Aufrufen einer gespeicherten Prozedur ist die Verwendung von CallableStatement oder von Ausgabeparametern erforderlich\: {0}
XJ108.S=Unzul\u00E4ssige Blockgr\u00F6\u00DFe
XSLA5.D=Der Protokolldatenstrom f\u00FCr das Zur\u00FCcksetzen der Transaktion {0} kann nicht gelesen werden.
XBCX8.S=Das Boot-Kennwort f\u00FCr eine nicht verschl\u00FCsselte Datenbank kann nicht ge\u00E4ndert werden.
XJ081.C=Es wurde in Konflikt stehende Erstellungs-/Wiederherstellungsattribute angegeben.
XJ207.S=Die Methode executeQuery kann nicht f\u00FCr ein Update verwendet werden.
XSDG7.D=Bei der Wiederherstellung konnte das Verzeichnis {0} nicht entfernt werden. Vergewissern Sie sich, dass die notwendigen Berechtigungen vorliegen.
XJ072.S=An eine BLOB- oder CLOB-Methode wurde ein Nullmuster oder eine Nullsuchzeichenfolge \u00FCbergeben.
XSAM4.S=Es gibt keine Sortierung mit der Bezeichnung ''{0}''.
XSDF8.S=Die wiederzuverwendende Seite {0} wurde nicht gefunden.
XJ126.S=Diese Methode sollte nicht f\u00FCr sensitive dynamische Cursor aufgerufen werden.
C004=Veraltetes Klassenladeprogramm f\u00FCr die Klasse {0}
XSCH7.S=Die Suche ist nicht positioniert.
XSLB4.S=truncationLWM {0} wurde nicht gefunden.
XJ090.S=Ung\u00FCltiger Parameter\: calendar ist null.
XSAJ7.U=Tiefe der Baumstruktur
XJ045.S=An Connection.setTransactionIsolation() wurde die ung\u00FCltige oder (derzeit) nicht unterst\u00FCtzte Isolationsstufe ''{0}'' \u00FCbergeben. Derzeit unterst\u00FCtzte Werte sind java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED und java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
43X9C.U=Fenster-ResultSet\: 
XJ063.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr Statement.setMaxRows(int maxRows). Der Parameterwert muss >\= 0 sein.
