#Thu May 16 17:55:33 BRT 2013
XJ018.S=Le nom de colonne ne peut pas \u00EAtre nul.
XJ117.S=Le traitement par lots des requ\u00EAtes est interdit de fa\u00E7on \u00E0 permettre la conformit\u00E9 \u00E0 la sp\u00E9cification J2EE.
XJ216.S=La longueur de cet objet BLOB/CLOB n''est pas encore disponible. Lorsque vous acc\u00E9dez \u00E0 un objet BLOB ou CLOB en tant que flux, sa longueur est disponible seulement apr\u00E8s le traitement complet du flux.
XJ081.S=Valeur non valide ''{0}'' transmise en tant que param\u00E8tre ''{1}'' \u00E0 la m\u00E9thode ''{2}''
D012=Sauvegarde termin\u00E9e, l''instant de journalisation est situ\u00E9 \u00E0 {0} \n
42Z9B=L''interface VTI (Virtual Table Interface) externe ne prend pas en charge les colonnes BLOB ou CLOB. ''{0}'' colonne ''{1}''. 
XN014.S=Une exception a \u00E9t\u00E9 trouv\u00E9e lors de la lecture \u00E0 partir du flux sp\u00E9cifi\u00E9 par le param\u00E8tre \#{0}.  Les donn\u00E9es restantes attendues par le serveur ont \u00E9t\u00E9 remplies avec 0x0. L''exception pr\u00E9sentait ce message \: {1}.
XBM0V.S=Une exception a \u00E9t\u00E9 \u00E9mise lors du chargement de la classe {1} enregistr\u00E9e pour l''identificateur {0}.
XJ009.S=Utilisation de CallableStatement requise pour un appel de proc\u00E9dure stock\u00E9e ou l''utilisation de param\u00E8tres de sortie \: {0}
XJ108.S=Taille de bloc non conforme
XSLA5.D=Impossible de lire le flux de donn\u00E9es de journalisation dans le but d''annuler la transaction {0}.
XBCX8.S=Impossible de modifier le mot de passe d''amor\u00E7age pour une base de donn\u00E9es non chiffr\u00E9e.
XJ081.C=Des attributs de cr\u00E9ation/restauration/r\u00E9cup\u00E9ration incompatibles ont \u00E9t\u00E9 sp\u00E9cifi\u00E9s.
XJ207.S=La m\u00E9thode executeQuery ne peut pas \u00EAtre utilis\u00E9e pour la mise \u00E0 jour.
XSDG7.D=Le r\u00E9pertoire {0} n''a pas pu \u00EAtre supprim\u00E9 pendant la restauration. Assurez-vous que les droits d''acc\u00E8s sont corrects.
XJ072.S=Un sch\u00E9ma ou un searchStr nul a \u00E9t\u00E9 transmis dans une m\u00E9thode de position BLOB ou CLOB.
XSAM4.S=Il n''existe aucun tri ayant pour nom ''{0}''.
XSDF8.S=Impossible de trouver la page {0} \u00E0 r\u00E9utiliser.
XJ126.S=Cette m\u00E9thode ne doit pas \u00EAtre appel\u00E9e sur les curseurs dynamiques sensibles.
C004=Chargeur de classe p\u00E9rim\u00E9 pour la classe {0}
XSCH7.S=L''analyse n''est pas positionn\u00E9e.
XSLB4.S=Impossible de trouver truncationLWM {0}.
XJ090.S=Param\u00E8tre incorrect \: l''agenda est null.
XSAJ7.U=Hauteur de l''arborescence
XJ045.S=Un niveau d''isolement non valide ou non pris en charge (actuellement), ''{0}'', a \u00E9t\u00E9 transmis \u00E0 Connection.setTransactionIsolation(). Les valeurs actuellement prises ne charge sont java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED et java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
43X9C.U=Fen\u00EAtre ResultSet \: 
XJ063.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setMaxRows(int maxRows).  La valeur du param\u00E8tre doit \u00EAtre >\= 0.
