#Thu May 16 17:55:33 BRT 2013
XJ018.S=El nombre de columna no puede ser nulo.
XJ117.S=El proceso por lotes de consultas no est\u00E1 permitido por conformidad a J2EE.
XJ216.S=La longitud de este BLOB/CLOB a\u00FAn no est\u00E1 disponible. Cuando se accede a BLOB o CLOB como una secuencia de datos, la longitud no est\u00E1 disponible hasta que se ha procesado la secuencia completa.
XJ081.S=Se ha pasado el valor ''{0}'' no v\u00E1lido como par\u00E1metro ''{1}'' al m\u00E9todo ''{2}''
D012=Copia de seguridad completada, instancia de anotaci\u00F3n cronol\u00F3gica en {0} \n
42Z9B=La interfaz de tabla virtual externa no da soporte a columnas BLOB o CLOB. ''{0}'' columna ''{1}''. 
XN014.S=Se ha detectado una excepci\u00F3n al leer en el flujo especificado por el par\u00E1metro \#{0}.  Los datos restantes esperados por el servidor se han llenado con 0x0. La excepci\u00F3n ten\u00EDa el mensaje siguiente\: {1}.
XBM0V.S=Se ha generado una excepci\u00F3n al cargar la clase {1} registrada para el identificador {0}.
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00E1metros de salida\: {0}
XJ108.S=Tama\u00F1o de bloque no permitido
XSLA5.D=No se puede leer la corriente de datos para las anotaciones cronol\u00F3gicas por alguna raz\u00F3n para retrotraer la transacci\u00F3n {0}.
XBCX8.S=No se puede cambiar la contrase\u00F1a de arranque de una base de datos no cifrada.
XJ081.C=Se han especificado atributos de creaci\u00F3n/restauraci\u00F3n/recuperaci\u00F3n que entran en conflicto.
XJ207.S=No se puede utilizar el m\u00E9todo executeQuery para la actualizaci\u00F3n.
XSDG7.D=No ha sido posible eliminar el directorio {0} durante la restauraci\u00F3n. Aseg\u00FArese de que los permisos son los adecuados.
XJ072.S=Se ha pasado un patr\u00F3n o searchStr nulo a un m\u00E9todo de posici\u00F3n BLOB o CLOB.
XSAM4.S=No existe una clasificaci\u00F3n llamada ''{0}''.
XSDF8.S=No se puede encontrar la p\u00E1gina {0} para reutilizar.
XJ126.S=Este m\u00E9todo no debe llamarse en cursores din\u00E1micos sensibles.
C004=Cargador de clases obsoleto para la clase {0}
XSCH7.S=La exploraci\u00F3n no est\u00E1 posicionada.
XSLB4.S=No se puede encontrar truncationLWM {0}.
XJ090.S=Par\u00E1metro no v\u00E1lido\: el calendario es nulo.
XSAJ7.U=Altura del \u00E1rbol
XJ045.S=Se ha pasador un nivel de aislamiento no v\u00E1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolation(). Los valores a los que actualmente se da soporte son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
43X9C.U=ResultSet de ventana\: 
XJ063.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxRows(int maxRows).  El valor del par\u00E1metro debe ser >\= 0.
