#Thu May 16 17:55:33 BRT 2013
XSLA6.D=N\u00E3o foi poss\u00EDvel recuperar o banco de dados.
XBCX9.S=N\u00E3o \u00E9 poss\u00EDvel alterar a senha de inicializa\u00E7\u00E3o de um banco de dados apenas-de-leitura.
XSDG8.D=N\u00E3o foi poss\u00EDvel copiar o diret\u00F3rio ''{0}'' para ''{1}'' durante a restaura\u00E7\u00E3o. Certifique-se de haver espa\u00E7o suficiente, e que as permiss\u00F5es est\u00E3o corretas.
XJ208.S=Falha de lote n\u00E3o at\u00F4mica.  O lote foi submetido, mas ocorreu pelo menos uma exce\u00E7\u00E3o em um membro individual do lote. Utilize getNextException() para obter as exce\u00E7\u00F5es para os elementos do lote espec\u00EDficos.
XJ073.S=Os dados neste BLOB ou CLOB n\u00E3o est\u00E3o mais dispon\u00EDveis.  A transa\u00E7\u00E3o do BLOB ou CLOB pode ter sido efetivada, ou sua conex\u00E3o est\u00E1 fechada.
XSAM5.S=A varredura deve ser aberta e posicionada chamando next() antes de fazer outras chamadas.
D013=ADVERT\u00CANCIA\: O banco de dados foi inicializado com {0}\={1}. Neste modo \u00E9 poss\u00EDvel que o banco de dados n\u00E3o seja capaz de realizar recupera\u00E7\u00F5es, sejam perdidas transa\u00E7\u00F5es efetivadas, e que o banco de dados fique em um estado inconsistente. Utilize este modo somente quando estas conseq\u00FC\u00EAncias forem aceit\u00E1veis.\n
XSLB5.S=Inst\u00E2ncia truncationLWM {1} ilegal para o ponto de truncamento {0}. A faixa permitida \u00E9 de {2} a {3}.
XSCH8.S=Funcionalidade n\u00E3o implementada.
XSAJ8.U=Tipo de classifica\u00E7\u00E3o
XJ091.S=Argumento inv\u00E1lido\: o \u00EDndice do par\u00E2metro {0} n\u00E3o \u00E9 um par\u00E2metro OUT ou INOUT.
42884=N\u00E3o foi encontrada nenhuma rotina autorizada com nome ''{0}'', do tipo ''{1}'', contendo argumentos compat\u00EDveis.
XJ028.C=A URL ''{0}'' n\u00E3o est\u00E1 adequadamente formada.
XJ064.S=Valor de par\u00E2metro inv\u00E1lido ''{0}'' para setFetchDirection(int direction).
XJ118.S=Consulta em lote requisitada em uma instru\u00E7\u00E3o que n\u00E3o \u00E9 de consulta.
XJ082.U=N\u00E3o s\u00E3o permitidos valores BLOB/CLOB como par\u00E2metros ou receptores de m\u00E9todos.
C005=Carregador de classe do banco de dados iniciado - derby.database.classpath\=''{0}''
XN015.S=Erro do protocolo de rede\: o tamanho da InputStream especificado, par\u00E2metro n\u00BA{0}, \u00E9 menor que o comprimento da InputStream verdadeira.
XBM0W.S=Foi lan\u00E7ada uma exce\u00E7\u00E3o ao criar uma inst\u00E2ncia da classe {1} registrada para o identificador {0}.
D004=Iniciada a c\u00F3pia de seguran\u00E7a do banco de dados localizado em {0}
