#Thu May 16 17:55:33 BRT 2013
XSLA6.D=Nie mo\u017Cna odzyska\u0107 bazy danych.
XBCX9.S=Nie mo\u017Cna zmieni\u0107 has\u0142a startowego dla bazy danych tylko do odczytu. 
XSDG8.D=Nie mo\u017Cna skopiowa\u0107 katalogu ''{0}'' do ''{1}'' podczas odtwarzania. Upewnij si\u0119, czy jest wystarczaj\u0105ca ilo\u015B\u0107 miejsca, a uprawnienia s\u0105 poprawne. 
XJ208.S=Niepowodzenie nieatomowego zadania wsadowego. Zadanie wsadowe zosta\u0142o wprowadzone, ale wyst\u0105pi\u0142 przynajmniej jeden wyj\u0105tek dla pojedynczego elementu zadania wsadowego. Aby pobra\u0107 wyj\u0105tki dla okre\u015Blonych element\u00F3w zadania wsadowego, u\u017Cyj metody getNextException().
XJ073.S=Dane w metodzie Blob lub Clob nie s\u0105 ju\u017C dost\u0119pne. Transakcja BLOB/CLOB mog\u0142a zosta\u0107 zatwierdzona lub jej po\u0142\u0105czenie zosta\u0142o zamkni\u0119te.
XSAM5.S=Zanim zostan\u0105 utworzone inne wywo\u0142ania, skanowanie musi by\u0107 otwarte i ustawione za pomoc\u0105 wywo\u0142ania funkcji next().
D013=OSTRZE\u017BENIE\: Baza danych jest uruchamiana w trybie {0}\={1}. W tym trybie mo\u017Cliwy jest brak odzyskania bazy danych, utrata zatwierdzonych transakcji, a baza danych mo\u017Ce znale\u017A\u0107 si\u0119 w stanie niesp\u00F3jnym. Tego trybu nale\u017Cy u\u017Cywa\u0107, gdy te konsekwencje s\u0105 akceptowalne \n
XSLB5.S=Niedozwolony moment truncationLWM {1} dla punktu obci\u0119cia {0}. Dozwolony jest zakres od {2} do {3}.
XSCH8.S=Opcja nie jest zaimplementowana.
XSAJ8.U=Typ sortowania
XJ091.S=Niepoprawny argument\: indeks parametru {0} nie jest parametrem OUT lub INOUT.
42884=Nie znaleziono autoryzowanej procedury o nazwie ''{0}'' typu ''{1}'' maj\u0105cej kompatybilne argumenty.
XJ028.C=Adres URL ''{0}'' nie jest poprawnie sformu\u0142owany.
XJ064.S=Niepoprawna warto\u015B\u0107 parametru ''{0}'' dla funkcji setFetchDirection.setFetchSize(int direction).
XJ118.S=Za\u017C\u0105dano zadania wsadowego z zapytaniem dla instrukcji nieb\u0119d\u0105cej zapytaniem.
XJ082.U=Warto\u015Bci BLOB/CLOB nie s\u0105 dozwolone jako parametry metody lub odbiornik.
C005=Uruchomiono program \u0142aduj\u0105cy klas\u0119 bazy danych - derby.database.classpath\=''{0}''
XN015.S=B\u0142\u0105d protoko\u0142u sieciowego\: podana wielko\u015B\u0107 obiektu InputStream, parametr numer {0}, jest mniejszy ni\u017C rzeczywista d\u0142ugo\u015B\u0107 obiektu InputStream.
XBM0W.S=Podczas tworzenia instancji klasy {1} zarejestrowanej dla identyfikatora {0} zosta\u0142 zg\u0142oszony wyj\u0105tek.
D004=Rozpocz\u0119to tworzenie kopii zapasowej dla bazy danych po\u0142o\u017Conej w {0} do {1}.
