#Thu May 16 17:55:33 BRT 2013
XSLA6.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u30EA\u30AB\u30D0\u30EA\u30FC\u3067\u304D\u307E\u305B\u3093\u3002
XBCX9.S=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30D6\u30FC\u30C8\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u306F\u5909\u66F4\u3067\u304D\u307E\u305B\u3093\u3002  
XSDG8.D=\u30EA\u30B9\u30C8\u30A2\u306E\u9593\u3001\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC ''{0}'' \u3092 ''{1}'' \u306B\u30B3\u30D4\u30FC\u3067\u304D\u307E\u305B\u3093\u3002 \u5341\u5206\u306A\u30B9\u30DA\u30FC\u30B9\u304C\u3042\u308A\u3001\u8A31\u53EF\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
XJ208.S=\u975E\u30A2\u30C8\u30DF\u30C3\u30AF\u30FB\u30D0\u30C3\u30C1\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002  \u30D0\u30C3\u30C1\u306F\u5B9F\u884C\u4F9D\u983C\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u30D0\u30C3\u30C1\u306E\u500B\u5225\u30E1\u30F3\u30D0\u30FC\u306E\u3044\u305A\u308C\u304B\u3067 1 \u3064\u4EE5\u4E0A\u306E\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002 \u7279\u5B9A\u306E\u30D0\u30C3\u30C1\u51E6\u7406\u6E08\u307F\u30A8\u30EC\u30E1\u30F3\u30C8\u306B\u304A\u3051\u308B\u4F8B\u5916\u3092\u53D6\u5F97\u3059\u308B\u306B\u306F getNextException() \u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XJ073.S=\u3053\u306E BLOB \u307E\u305F\u306F CLOB \u306E\u30C7\u30FC\u30BF\u306F\u3082\u3046\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002  BLOB/CLOB \u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u3066\u3044\u308B\u304B\u3001\u305D\u306E\u63A5\u7D9A\u304C\u9589\u3058\u3066\u3044\u308B\u304B\u3001\u307E\u305F\u306F\u89E3\u653E\u3055\u308C\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
XSAM5.S=\u30B9\u30AD\u30E3\u30F3\u3092\u30AA\u30FC\u30D7\u30F3\u3057\u3001next() \u3092\u547C\u3073\u51FA\u3057\u3066\u4F4D\u7F6E\u3092\u79FB\u52D5\u3057\u3066\u304B\u3089\u4ED6\u306E\u547C\u3073\u51FA\u3057\u3092\u884C\u3046\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
D013=\u8B66\u544A\: \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F {0}\={1} \u3067\u30D6\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u3059\u3002 \u3053\u306E\u30E2\u30FC\u30C9\u3067\u306F\u3001\u305D\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u30EA\u30AB\u30D0\u30EA\u3067\u304D\u306A\u3044\u3053\u3068\u3001\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u5931\u308F\u308C\u3066\u3044\u308B\u3053\u3068\u3001\u304A\u3088\u3073\u305D\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u4E0D\u6574\u5408\u306A\u72B6\u614B\u306B\u306A\u3063\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002 \u3053\u308C\u3089\u306E\u7D50\u679C\u3092\u8A31\u5BB9\u3067\u304D\u308B\u5834\u5408\u306B\u306E\u307F\u3001\u3053\u306E\u30E2\u30FC\u30C9\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044  \n
XSLB5.S=\u5207\u308A\u6368\u3066\u30DD\u30A4\u30F3\u30C8 {0} \u306B\u4E0D\u6B63\u306A truncationLWM \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {1}\u3002 \u6B63\u3057\u3044\u7BC4\u56F2\u306F {2} \u304B\u3089 {3} \u3067\u3059\u3002
XSCH8.S=\u30D5\u30A3\u30FC\u30C1\u30E3\u30FC\u306F\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XSAJ8.U=\u30BD\u30FC\u30C8\u30FB\u30BF\u30A4\u30D7
XJ091.S=\u7121\u52B9\u306A\u5F15\u6570\: \u30D1\u30E9\u30E1\u30FC\u30BF\u7D22\u5F15 {0} \u306F OUT \u30D1\u30E9\u30E1\u30FC\u30BF\u3067\u3082 INOUT \u30D1\u30E9\u30E1\u30FC\u30BF\u3067\u3082\u3042\u308A\u307E\u305B\u3093\u3002
42884=\u4E92\u63DB\u6027\u306E\u3042\u308B\u5F15\u6570\u3092\u6301\u3064\u3001\u578B ''{1}'' \u306E ''{0}'' \u3068\u3044\u3046\u540D\u524D\u306E\u8A31\u53EF\u30EB\u30FC\u30C1\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
XJ028.C=URL ''{0}'' \u306E\u5F62\u5F0F\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
XJ064.S=setFetchDirection(int direction) \u306B\u5BFE\u3059\u308B\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u5024 ''{0}''\u3002
XJ118.S=\u975E\u7167\u4F1A\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306B\u5BFE\u3057\u3066\u7167\u4F1A\u30D0\u30C3\u30C1\u304C\u8981\u6C42\u3055\u308C\u307E\u3057\u305F\u3002
XJ082.U=BLOB/CLOB \u5024\u306F\u3001\u30E1\u30BD\u30C3\u30C9\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u307E\u305F\u306F\u53D7\u4FE1\u5074\u3068\u3057\u3066\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
XJ217.S=\u3053\u306E CLOB/BLOB \u306B\u6307\u5B9A\u3055\u308C\u305F\u30ED\u30B1\u30FC\u30BF\u30FC\u306F\u7121\u52B9\u3067\u3059
C005=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u958B\u59CB\u3055\u308C\u307E\u3057\u305F - derby.database.classpath\=''{0}''
XN015.S=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D7\u30ED\u30C8\u30B3\u30EB\u30A8\u30E9\u30FC\: \u6307\u5B9A\u3055\u308C\u305F InputStream \u306E\u30B5\u30A4\u30BA (\u30D1\u30E9\u30E1\u30FC\u30BF \#{0}) \u304C\u5B9F\u969B\u306E InputStream \u306E\u9577\u3055\u3088\u308A\u77ED\u304F\u306A\u3063\u3066\u3044\u307E\u3059\u3002
XBM0W.S=ID {0} \u306B\u5BFE\u3057\u3066\u767B\u9332\u3055\u308C\u305F\u30AF\u30E9\u30B9 {1} \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u4E2D\u306B\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F
D004={0} \u306B\u914D\u7F6E\u3055\u308C\u3066\u3044\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304B\u3089 {1} \u3078\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u304C\u958B\u59CB\u3055\u308C\u307E\u3057\u305F
