#Thu May 16 17:55:33 BRT 2013
XSLA6.D=No se puede recuperar la base de datos.
XBCX9.S=No se puede cambiar la contrase\u00F1a de arranque de una base de datos de solo lectura.  
XSDG8.D=No es posible copiar el directorio ''{0}'' en ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
XJ208.S=Anomal\u00EDa de proceso por lotes no at\u00F3mico.  Se ha sometido el proceso por lotes, pero se ha producido como m\u00EDnimo una excepci\u00F3n en un miembro individual del proceso por lotes. Utilice getNextException() para recuperar las excepciones para elementos procesados por lotes espec\u00EDficos.
XJ073.S=Los datos de este BLOB o CLOB ya no est\u00E1n disponibles.  La transacci\u00F3n BLOB / CLOB''s puede confirmarse, su conexi\u00F3n puede cerrarse o se ha liberado.
XSAM5.S=La exploraci\u00F3n debe abrirse y colocarse llamando a next() antes de realizar otras llamadas.
D013=AVISO\: La base de datos se ha arrancado mediante {0}\={1}. En esta modalidad, es posible que la base de datos no se pueda recuperar, las transacciones comprometidas se podr\u00EDan perder, y la base de datos podr\u00EDa estar en un estado no coherente. Por favor, utilice esta modalidad \u00FAnicamente cuando estas consecuencias sean aceptables.  \n
XSLB5.S=Instante de truncationLWM {1} no permitido para el punto de truncamiento {0}. El rango permitido es de {2} a {3}.
XSCH8.S=La caracter\u00EDstica no est\u00E1 implementada.
XSAJ8.U=Tipo de ordenaci\u00F3n
XJ091.S=Argumento no v\u00E1lido\: el \u00EDndice de par\u00E1metro {0} no es un par\u00E1metro OUT o INOUT.
42884=No se encontr\u00F3 ninguna rutina autorizada con el nombre ''{0}'' del tipo ''{1}'' que tuviese argumentos compatibles.
XJ028.C=El URL ''{0}'' no est\u00E1 formado correctamente.
XJ064.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para setFetchDirection(int direction).
XJ118.S=Se ha solicitado un proceso por lotes de consulta en una sentencia que no referente a una consulta.
XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00E1metros de m\u00E9todo.
XJ217.S=El localizador suministrado para este CLOB/LOB no es v\u00E1lido.
C005=Cargador de clases de base de datos iniciado - derby.database.classpath\=''{0}''
XN015.S=Error de protocolo de red\: el tama\u00F1o especificado de InputStream, par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XBM0W.S=Se ha generado una excepci\u00F3n al crear una instancia de la clase {1} registrada para el identificador {0}.
D004=Copia de seguridad iniciada para la base de datos situada en {0} a {1}.
