#Thu May 16 17:55:33 BRT 2013
XSLA6.D=Az adatb\u00E1zis nem \u00E1ll\u00EDthat\u00F3 helyre.
XBCX9.S=\u00CDr\u00E1sv\u00E9dett adatb\u00E1zis rendszerind\u00EDt\u00F3 jelszava nem m\u00F3dos\u00EDthat\u00F3.  
XSDG8.D=Vissza\u00E1ll\u00EDt\u00E1s sor\u00E1n a(z) ''{0}'' k\u00F6nyvt\u00E1r nem m\u00E1solhat\u00F3 a(z) ''{1}'' helyre. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy elegend\u0151 ter\u00FClet \u00E1ll rendelkez\u00E9sre \u00E9s megfelel\u0151k a jogosults\u00E1gok. 
XJ208.S=Nem atomi k\u00F6teghiba.  A k\u00F6teg elk\u00FCld\u00E9sre ker\u00FClt, de legal\u00E1bb egy kiv\u00E9tel t\u00F6rt\u00E9nt a k\u00F6teg egyik egyedi tagj\u00E1n. A getNextException() seg\u00EDts\u00E9g\u00E9vel lek\u00E9rheti a kiv\u00E9teleket az adott k\u00F6tegelt elemekhez.
XJ073.S=A BLOB vagy CLOB adatai m\u00E1r nem el\u00E9rhet\u0151k.  A BLOB/CLOB tranzakci\u00F3ja v\u00E9gleges\u00EDtve lett, vagy kapcsolata lez\u00E1rult.
XSAM5.S=Az elemz\u00E9st a next() m\u00E1s h\u00EDv\u00E1sok el\u0151tti h\u00EDv\u00E1s\u00E1val kell megnyitni \u00E9s poz\u00EDcion\u00E1lni.
D013=FIGYELMEZTET\u00C9S\: Az adatb\u00E1zis {0}\={1} \u00E9rt\u00E9kkel ker\u00FClt bet\u00F6lt\u00E9sre. Ebben a m\u00F3dban elk\u00E9pzelhet\u0151, hogy az adatb\u00E1zis nem \u00E1ll\u00EDthat\u00F3 helyre, a v\u00E9gleges\u00EDtett tranzakci\u00F3k elveszhetnek, az adatb\u00E1zis inkonzisztens \u00E1llapotba ker\u00FClhet. Csak akkor haszn\u00E1lja ezt a m\u00F3dot, ha a k\u00F6vetkezm\u00E9nyek alfogadhat\u00F3k \n
XSLB5.S=Illeg\u00E1lis truncationLWM id\u0151pillanat ({1}) a(z) {0} csonkol\u00E1si ponthoz. Az \u00E9rv\u00E9nyes tartom\u00E1ny\: {2} - {3}.
XSCH8.S=A szolg\u00E1ltat\u00E1s nincs megval\u00F3s\u00EDtva.
XSAJ8.U=Rendez\u00E9s t\u00EDpusa
XJ091.S=\u00C9rv\u00E9nytelen argumentum\: a(z) {0} param\u00E9terindex nem kimen\u0151 (OUT) vagy bej\u00F6v\u0151 (INOUT) param\u00E9ter.
42884=Nem tal\u00E1lhat\u00F3 olyan ''{0}'' nev\u0171, ''{1}'' t\u00EDpus\u00FA enged\u00E9lyezett rutin, amely kompatibilis argumentumokkal rendelkezik.
XJ028.C=A(z) ''{0}'' URL nem megfelel\u0151en form\u00E1zott.
XJ064.S=\u00C9rv\u00E9nytelen ''{0}'' param\u00E9ter\u00E9rt\u00E9k a setFetchDirection(int direction) met\u00F3dushoz.
XJ118.S=A lek\u00E9rdez\u00E9s k\u00F6tegel\u00E9st nem lek\u00E9rdez\u00E9s utas\u00EDt\u00E1son k\u00E9rt\u00E9k.
XJ082.U=A BLOB/CLOB \u00E9rt\u00E9kek met\u00F3dusparam\u00E9terk\u00E9nt vagy fogad\u00F3k\u00E9nt nem megengedettek.
C005=Az adatb\u00E1zis-oszt\u00E1lybet\u00F6lt\u0151 elindult - derby.database.classpath\=''{0}''
XN015.S=H\u00E1l\u00F3zati protokoll hiba\: az InputStream megadott m\u00E9rete (\#{0} param\u00E9ter) az aktu\u00E1lis InputStream hosszn\u00E1l kisebb.
XBM0W.S=Kiv\u00E9tel t\u00F6rt\u00E9nt a(z) {0} azonos\u00EDt\u00F3hoz bejegyzett {1} oszt\u00E1ly p\u00E9ld\u00E1ny\u00E1nak l\u00E9trehoz\u00E1sa sor\u00E1n.
D004=A ment\u00E9s elindult a(z) {0} helyen tal\u00E1lhat\u00F3 adatb\u00E1zishoz a(z) {1} helyre.
