#Thu May 16 17:55:33 BRT 2013
XSLA6.D=Impossible de r\u00E9cup\u00E9rer la base de donn\u00E9es.
XBCX9.S=Impossible de modifier le mot de passe d''amor\u00E7age pour une base de donn\u00E9es en lecture seule.  
XSDG8.D=Impossible de copier le r\u00E9pertoire ''{0}'' dans ''{1}'' lors de la restauration. Assurez-vous que l''espace est suffisant et que les droits d''acc\u00E8s sont corrects. 
XJ208.S=Echec de lot non atomique.  Le lot a \u00E9t\u00E9 soumis, mais au moins une exception s''est produite sur un membre individuel du lot. Utilisez la m\u00E9thode getNextException() pour extraire les exceptions pour des \u00E9l\u00E9ments sp\u00E9cifiques trait\u00E9s par lot.
XJ073.S=Les donn\u00E9es de data de ce BLOB ou CLOB ne sont plus disponibles.  La transaction des BLOB/CLOB est peut \u00EAtre valid\u00E9e, sa connexion est peut \u00EAtre ferm\u00E9e ou elle a \u00E9t\u00E9 lib\u00E9r\u00E9e.
XSAM5.S=L''analyse doit \u00EAtre ouverte et positionn\u00E9e par un appel de la m\u00E9thode next() avant la lancement d''autres appels.
D013=AVERTISSEMENT \: La base de donn\u00E9es est initialis\u00E9e avec {0}\={1}. Lorsque ce mode est utilis\u00E9, il est possible que la base de donn\u00E9es ne puisse pas \u00EAtre restaur\u00E9e, que des transactions valid\u00E9es soient perdues et que la base de donn\u00E9es soit dans un \u00E9tat incoh\u00E9rent. Utilisez ce mode uniquement lorsque ces cons\u00E9quences sont acceptables  \n
XSLB5.S=Instant de truncationLWM {1} incorrect pour le point de troncature {0}. La plage autoris\u00E9e est comprise entre {2} et {3}.
XSCH8.S=Fonction non impl\u00E9ment\u00E9e.
XSAJ8.U=Type de tri
XJ091.S=Argument incorrect \: l''index de param\u00E8tre {0} n''est pas un param\u00E8tre OUT ou INOUT.
42884=Une routine non autoris\u00E9e, nomm\u00E9e ''{0}'' de type ''{1}'' et comportant des arguments compatibles a \u00E9t\u00E9 trouv\u00E9e.
XJ028.C=L''URL ''{0}'' n''est pas au format correct.
XJ064.S=Valeur de param\u00E8tre non admise ''{0}'' pour setFetchDirection(int direction).
XJ118.S=Le traitement par lots des requ\u00EAtes est requis sur une instruction qui n''est pas une requ\u00EAte.
XJ082.U=Les valeurs BLOB/CLOB ne sont pas autoris\u00E9es en tant que param\u00E8tres de m\u00E9thode ou r\u00E9cepteur.
XJ217.S=Le localisateur fourni pour cet objet CLOB/BLOB est incorrect
C005=Chargeur de classe de la base de donn\u00E9es d\u00E9marr\u00E9 - derby.database.classpath\=''{0}''
XN015.S=Erreur de protocole r\u00E9seau \: la taille d\u00E9finie de l''InputStream, param\u00E8tre n\u00B0{0}, est inf\u00E9rieure \u00E0 la longueur r\u00E9elle de l''InputStream.
XBM0W.S=Une exception a \u00E9t\u00E9 \u00E9mise lors de la cr\u00E9ation d''une instance de la classe {1} enregistr\u00E9e pour l''identificateur {0}.
D004=La sauvegarde de la base de donn\u00E9es situ\u00E9e \u00E0 l''emplacement {0}, vers l''emplacement {1}, a commenc\u00E9.
