#Thu May 16 17:55:33 BRT 2013
XSLA6.D=Die Datenbank kann nicht wiederhergestellt werden.
XBCX9.S=Das Boot-Kennwort f\u00FCr eine schreibgesch\u00FCtzte Datenbank kann nicht ge\u00E4ndert werden. 
XSDG8.D=Bei der Wiederherstellung konnte das Verzeichnis ''{0}'' nicht nach ''{1}'' kopiert werden. Vergewissern Sie sich, dass genug Speicherplatz verf\u00FCgbar ist und dass die notwendigen Berechtigungen vorliegen. 
XJ208.S=Fehler bei nicht atomarer Batch-Operation. Der Batch wurde \u00FCbergeben. Bei einem Batch-Member ist jedoch mindestens eine Ausnahme eingetreten. Mit getNextException() k\u00F6nnen Sie die Ausnahmen f\u00FCr bestimmte Batch-Elemente abrufen.
XJ073.S=Die Daten in diesem BLOB oder CLOB sind nicht mehr verf\u00FCgbar. M\u00F6glicherweise wurde die Transaktion des BLOB/CLOB festgeschrieben, die Verbindung geschlossen oder freigegeben.
XSAM5.S=Sie m\u00FCssen die Suche \u00F6ffnen und positionieren, indem Sie vor allen anderen Methoden next() aufrufen.
D013=WARNUNG\: Die Datenbank wird mit {0}\={1} gebootet. Bei Verwendung dieses Modus kann die Datenbank m\u00F6glicherweise nicht wiederhergestellt werden. Festgeschriebene Transaktionen k\u00F6nnen verloren gehen. Es ist m\u00F6glich, dass die Datenbank einen inkonsistenten Status hat. Verwenden Sie diesen Modus nur, wenn Sie die genannten Folgen bewusst in Kauf nehmen m\u00F6chten.  \n
XSLB5.S=Unzul\u00E4ssiger truncationLWM-Zeitpunkt {1} f\u00FCr Abschneidepunkt {0}. Der g\u00FCltige Bereich liegt zwischen {2} und {3}.
XSCH8.S=Das Feature ist nicht implementiert.
XSAJ8.U=Sortiertyp
XJ091.S=Ung\u00FCltiges Argument\: Der Parameterindex {0} ist kein OUT- oder INOUT-Parameter.
42884=Es wurde keine autorisierte Routine ''{0}'' des Typs ''{1}'' mit kompatiblen Argumenten gefunden.
XJ028.C=Der URL ''{0}'' hat nicht das richtige Format.
XJ064.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr setFetchDirection(int direction).
XJ118.S=F\u00FCr eine Nicht-Abfrageanweisung wurde eine Abfrage-Batch-Verarbeitung angefordert.
XJ082.U=BLOB/CLOB-Werte sind als Methodenparameter oder Empf\u00E4nger nicht zul\u00E4ssig.
XJ217.S=Der f\u00FCr diesen CLOB/BLOB angegebene Locator ist ung\u00FCltig
C005=Das Ladeprogramm f\u00FCr Datenbankklassen wurde gestartet - derby.database.classpath\=''{0}''
XN015.S=Netzprotokollfehler\: Die angegebene Gr\u00F6\u00DFe des Eingabedatenstroms (Parameter {0}) liegt unter der tats\u00E4chlichen L\u00E4nge des Eingabedatenstroms.
XBM0W.S=Beim Erstellen einer Instanz der f\u00FCr die ID {0} registrierten Klasse {1} wurde eine Ausnahme ausgel\u00F6st.
D004=Die Sicherung f\u00FCr die Datenbank in {0} wurde unter {1} gestartet.
