#Thu May 16 17:55:33 BRT 2013
XJ065.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 ''{0}'' \u0434\u043B\u044F Statement.setFetchSize(int rows).
42939=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043E\u0431\u044A\u0435\u043A\u0442 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C \u0441\u0445\u0435\u043C\u044B ''{0}''.
D014=\u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0422\u041E\u041B\u042C\u041A\u041E \u0427\u0422\u0415\u041D\u0418\u0415
XJ083.U=''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u043D\u043E\u0432\u043B\u044F\u0435\u043C\u044B\u043C \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432. 
42Z9D=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u044B ''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0432 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430\u0445 ''{1}''.
XSAS0.S=\u0412\u044B\u0437\u0432\u0430\u043D \u043C\u0435\u0442\u043E\u0434 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435 \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u0442 \u0434\u043B\u044F \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043F\u0440\u0438 \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0435.
XN016.S=\u041E\u0448\u0438\u0431\u043A\u0430 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\: \u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0435 \u0434\u043B\u0438\u043D\u044B \u043F\u043E\u0442\u043E\u043A\u0430; \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \#{0}.  \u0421\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\: {1}.
3B501.S=\u0422\u043E\u0447\u043A\u0430 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F (SAVEPOINT) \u0441 \u043F\u0435\u0440\u0435\u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043C\u0435\u043D\u0435\u043C \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
XJ056.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C AUTOCOMMIT ON \u0432 \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438 XA.
XSLA7.D=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u043E\u0432\u0442\u043E\u0440\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044E {0} \u0432 \u0436\u0443\u0440\u043D\u0430\u043B\u0435.
XJ209.S=\u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u0430\u044F \u0445\u0440\u0430\u043D\u0438\u043C\u0430\u044F \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u0430 \u043D\u0435 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0430 \u043D\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0435.
XJ074.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 ''{0}'' \u0434\u043B\u044F Statement.setQueryTimeout(int seconds).
C006={0} \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043D(\u0430/\u043E) \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 jar \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 {1}
XSAM6.S=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u0430 \u0437\u0430\u043F\u0438\u0441\u044C {2} \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 {1} \u0432 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0435 {0}.
XBM0X.D=\u0412\u0432\u0435\u0434\u0435\u043D\u043D\u043E\u0435 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0438 ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u043C; \u043E\u0436\u0438\u0434\u0430\u0435\u0442\u0441\u044F ln[_CO[_variant]]\nln\=\u0434\u0432\u0443\u0445\u0441\u0438\u043C\u0432\u043E\u043B\u043D\u044B\u0439 \u043A\u043E\u0434 \u044F\u0437\u044B\u043A\u0430 ISO-639 \u0432 \u043D\u0438\u0436\u043D\u0435\u043C \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0435, CO\=\u0434\u0432\u0443\u0445\u0441\u0438\u043C\u0432\u043E\u043B\u044C\u043D\u044B\u0435 \u043A\u043E\u0434\u044B \u0441\u0442\u0440\u0430\u043D ISO-3166 \u0432 \u0432\u0435\u0440\u0445\u043D\u0435\u043C \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0435; \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 java.util.Locale.
XJ128.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044E unwrap \u0434\u043B\u044F ''{0}''
42Z9D.S.1=\u041F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u0443\u044E\u0442 \u0434\u0430\u043D\u043D\u044B\u0435 SQL, \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0432 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430\u0445 BEFORE.
42894=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 DEFAULT \u0438\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 IDENTITY \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}''.
XSLB6.S=\u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0432\u043D\u0435\u0441\u0442\u0438 \u0432 \u0436\u0443\u0440\u043D\u0430\u043B \u0437\u0430\u043F\u0438\u0441\u044C \u043D\u0443\u043B\u0435\u0432\u043E\u0439 \u0434\u043B\u0438\u043D\u044B \u0438\u043B\u0438 \u0434\u043B\u0438\u043D\u044B -ve.
D005=\u043F\u0440\u0435\u0436\u043D\u044F\u044F \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u0430\u044F \u043A\u043E\u043F\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u0449\u0435\u043D\u0430 \u0438\u0437 {0} \u0432 {1}
