#Thu May 16 17:55:33 BRT 2013
XJ065.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setFetchSize(int rows).
42939=Un objet ne peut pas \u00EAtre cr\u00E9\u00E9 avec le nom du sch\u00E9ma ''{0}''.
D014=en mode LECTURE SEULE
XJ083.U=''{0}'' n''est pas admis car le ResultSet n''est pas un ResultSet pouvant \u00EAtre mis \u00E0 jour. 
42Z9D=Les instructions ''{0}'' ne sont pas admises dans les d\u00E9clencheurs ''{1}''.
XSAS0.S=Une m\u00E9thode de l''interface de contr\u00F4leur d''analyse inad\u00E9quate pour une analyse de tri a \u00E9t\u00E9 appel\u00E9e.
XN016.S=Une exception a \u00E9t\u00E9 trouv\u00E9e lors de la tentative de v\u00E9rification de la longueur du flux sp\u00E9cifi\u00E9 par le param\u00E8tre \#{0}.  L''exception pr\u00E9sentait ce message \: {1}.
3B501.S=Un POINT DE SAUVEGARDE portant le nom transmis existe d\u00E9j\u00E0 dans la transaction en cours.
XJ056.S=Impossible de d\u00E9finir AUTOCOMMIT sur ON dans une connexion XA.
XSLA7.D=Impossible de r\u00E9p\u00E9ter l''op\u00E9ration {0} dans le fichier journal.
XJ209.S=La proc\u00E9dure m\u00E9moris\u00E9e requise n''est pas install\u00E9e sur le serveur.
XSDG9.D=Le thread Derby a re\u00E7u une interruption lors d''une op\u00E9ration d''E/S du disque ; consultez votre application pour conna\u00EEtre la source de l''interruption.
XJ074.S=Valeur de param\u00E8tre ''{0}'' incorrecte pour le param\u00E8tre Statement.setQueryTimeout(int secondes).
C006={0} a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du fichier JAR de la base de donn\u00E9es {1}
XSAM6.S=L''enregistrement {2} de la page {1} du conteneur {0} n''a pas \u00E9t\u00E9 trouv\u00E9.
XBM0X.D=La description d''environnement du territoire fournie ''{0}'' n''est pas valide ; ln[_CO[_variant]] doit \u00EAtre indiqu\u00E9\nln\=code de langue ISO-639 en minuscules et en deux lettres, CO\=codes pays ISO-3166 en majuscules et en deux lettres, voir java.util.Locale.
XJ128.S=D\u00E9sencapsulation impossible pour ''{0}''
42Z9D.S.1=Les proc\u00E9dures modifiant les donn\u00E9es SQL ne sont pas autoris\u00E9es dans les d\u00E9clencheurs BEFORE.
42894=La valeur DEFAULT ou la valeur de l''attribut IDENTITY n''est pas valide pour la colonne ''{0}''.
XSLB6.S=Tentative de consignation d''un enregistrement de longueur 0 ou -ve.
D005=l''ancienne copie de sauvegarde a \u00E9t\u00E9 d\u00E9plac\u00E9e de {0} vers {1}
