#Thu May 16 17:55:33 BRT 2013
XJ065.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setFetchSize(int rows).
42939=No se puede crear un objeto con el nombre de esquema ''{0}''.
D014=en modalidad S\u00D3LO LECTURA
XJ083.U=''{0}'' no permitido porque el ResultSet no es un ResultSet actualizable. 
42Z9D=Las sentencias ''{0}'' no est\u00E1n permitidas en desencadenantes ''{1}''.
XSAS0.S=Se ha llamado a un m\u00E9todo de interfaz de controlador de exploraci\u00F3n que no es apropiado para una exploraci\u00F3n sobre una clasificaci\u00F3n.
XN016.S=Encountered an Exception while trying to verify the length of the stream specified by parameter \#{0}.  The Exception had this message\: {1}.
3B501.S=Ya existe un SAVEPOINT con el nombre que se ha pasado en la transacci\u00F3n actual.
XJ056.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n XA.
XSLA7.D=No se puede rehacer la operaci\u00F3n {0} en el archivo de anotaciones cronol\u00F3gicas.
XJ209.S=El proceso almacenado necesario no est\u00E1 instalado en el servidor.
XSDG9.D=El subproceso Derby sufri\u00F3 una interrupci\u00F3n durante una operaci\u00F3n de E/S de disco; revise la aplicaci\u00F3n para localizar la fuente de la interrupci\u00F3n.
XJ074.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setQueryTimeout(int segundos).
C006=Se ha cargado {0} desde el jar de base de datos {1}
XSAM6.S=Registro {2} de la p\u00E1gina {1} del contenedor {0} no encontrado.
XBM0X.D=La descripci\u00F3n de territorio suministrada ''{0}'' no es v\u00E1lida, se esperaba ln[_CO[_variante]]\nln\=c\u00F3digo de idioma ISO-639 de dos letras en min\u00FAsculas, CO\=c\u00F3digo de pa\u00EDs ISO-3166 de dos letras en may\u00FAsculas, consulte java.util.Locale.
XJ128.S=No se ha podido deshacer el recorte para ''{0}''
42Z9D.S.1=Los procedimientos que modifican datos SQL no se permiten en desencadenantes BEFORE.
42894=El valor DEFAULT o el valor del atributo IDENTITY no es v\u00E1lido para la columna ''{0}''.
XSLB6.S=Intentado anotar un 0 o registro de anotaci\u00F3n cronol\u00F3gica de longitud -ve.
D005=se ha movido la copia de seguridad antigua de {0} a {1}
