#Thu May 16 17:55:33 BRT 2013
3B502.S=RELEASE \u307E\u305F\u306F ROLLBACK TO SAVEPOINT \u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u30BB\u30FC\u30D6\u30DD\u30A4\u30F3\u30C8\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
XJ057.S=Connection \u3092\u4F7F\u3063\u3066\u30B0\u30ED\u30FC\u30D0\u30EB\u30FB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30B3\u30DF\u30C3\u30C8\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u30B3\u30DF\u30C3\u30C8\u30FB\u30D7\u30ED\u30BB\u30B9\u306F\u3001XAResource \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
42877=\u5217\u306E\u4FEE\u98FE\u540D ''{0}'' \u306F\u3001ORDER BY \u6587\u7BC0\u306B\u306F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
2200H.S=\u30B7\u30FC\u30B1\u30F3\u30B9\u30B8\u30A7\u30CD\u30EC\u30FC\u30BF ''{0}.{1}'' \u306F\u5FAA\u74B0\u3057\u307E\u305B\u3093\u3002\u3053\u306E\u30B7\u30FC\u30B1\u30F3\u30B9\u30B8\u30A7\u30CD\u30EC\u30FC\u30BF\u304B\u3089\u306F\u3001\u3053\u308C\u4EE5\u4E0A\u5024\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002
XSLA8.D=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 {0} \u3092\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3067\u304D\u307E\u305B\u3093\u3002{2} \u3067 {1} \u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u306E\u88DC\u6B63\u3092\u8A66\u884C\u3057\u307E\u3059\u3002
01J01=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306F\u4F5C\u6210\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u4EE3\u308F\u308A\u306B\u65E2\u5B58\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u63A5\u7D9A\u3055\u308C\u307E\u3057\u305F\u3002
D015=\u5225\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u3063\u3066\u5024\u304C\u5909\u66F4\u3055\u308C\u305F\u305F\u3081\u3001\u3053\u308C\u4EE5\u4E0A\u8AAD\u307F\u8FBC\u3080\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42Z9E=\u5236\u7D04 ''{0}'' \u306F\u3001{1} \u5236\u7D04\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XBM0Y.D=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002 \u6307\u5B9A\u3057\u305F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30D1\u30B9\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XN008.S=\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u306E\u30A8\u30E9\u30FC\u306B\u3088\u308A\u7167\u4F1A\u306E\u51E6\u7406\u304C\u7D42\u4E86\u3057\u307E\u3057\u305F\u3002
42886=''{0}'' \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC ''{1}'' \u306B\u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u30FB\u30DE\u30FC\u30AB\u30FC ''?'' \u304C\u5FC5\u8981\u3067\u3059\u3002
XJ093.S=BLOB/CLOB \u306E\u9577\u3055 {0} \u304C\u9577\u3059\u304E\u307E\u3059\u3002  \u9577\u3055\u304C {1} \u3092\u8D85\u3048\u3066\u306F\u306A\u308A\u307E\u305B\u3093\u3002
01J10=\u30B9\u30AF\u30ED\u30FC\u30EB\u30FB\u30BB\u30F3\u30B7\u30C6\u30A3\u30D6\u7D50\u679C\u30BB\u30C3\u30C8\u306F\u30B5\u30FC\u30D0\u30FC\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u524D\u65B9\u30B9\u30AF\u30ED\u30FC\u30EB\u5C02\u7528\u30AB\u30FC\u30BD\u30EB\u306B\u518D\u30DE\u30C3\u30D7\u3057\u3066\u3044\u307E\u3059\u3002
XJ066.S=Statement.setMaxFieldSize(int max) \u306B\u5BFE\u3059\u308B\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u5024 ''{0}''\u3002
C007=JAR {1} \u304B\u3089\u30AF\u30E9\u30B9 {0} \u3092\u30ED\u30FC\u30C9\u4E2D\u306B\u4F8B\u5916  - {2}
XJ048.C=\u7AF6\u5408\u3059\u308B\u30D6\u30FC\u30C8\u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\: {0}
4250A=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 ''{2}''.''{3}'' \u306B\u5BFE\u3059\u308B {1} \u8A31\u53EF\u3092\u4E0E\u3048\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XJ084.U=\u5217\u304C\u57FA\u672C\u8868\u306E\u5217\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002 \u3053\u306E\u5217\u306B\u5BFE\u3057\u3066 ''{0}'' \u3092\u767A\u884C\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSAS1.S=\u30BD\u30FC\u30C8\u306E\u958B\u59CB\u524D\u307E\u305F\u306F\u30BD\u30FC\u30C8\u306E\u7D42\u4E86\u5F8C\u306B\u884C\u3092\u30D5\u30A7\u30C3\u30C1\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u3002
D006={0} \u3078\u306E\u30C7\u30FC\u30BF\u30FB\u30BB\u30B0\u30E1\u30F3\u30C8\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002 
XN017.S=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC \#{0} \u304C\u6307\u5B9A\u3057\u305F\u30B9\u30C8\u30EA\u30FC\u30E0\u304B\u3089\u306E\u8AAD\u307F\u53D6\u308A\u4E2D\u306B\u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u7D42\u7AEF\u306B\u9054\u3057\u307E\u3057\u305F\u3002 \u30B5\u30FC\u30D0\u30FC\u304C\u4E88\u671F\u3057\u3066\u3044\u305F\u6B8B\u308A\u306E\u30C7\u30FC\u30BF\u306B\u306F 0x0 \u304C\u57CB\u3081\u8FBC\u307E\u308C\u307E\u3057\u305F\u3002
