#Thu May 16 17:55:33 BRT 2013
3B502.S=Une LIBERATION ou ANNULATION JUSQU''AU POINT DE SAUVEGARDE a \u00E9t\u00E9 indiqu\u00E9e mais le point de sauvegarde n''existe pas.
XJ057.S=Impossible de valider une transaction globale qui utilise la connexion ; le traitement de la validation doit passer par l''interface XAResource.
42877=Un nom de colonne complet ''{0}'' n''est pas admis dans la clause ORDER BY.
2200H.S=Le g\u00E9n\u00E9rateur de s\u00E9quence ''{0}.{1}'' ne fonctionne pas. Aucune autre valeur ne peut \u00EAtre obtenue de ce g\u00E9n\u00E9rateur de s\u00E9quence.
XSLA8.D=Impossible d''annuler la transaction {0} ; tentative de compensation de l''op\u00E9ration {1} par {2}
01J01=La base de donn\u00E9es ''{0}'' n''est pas cr\u00E9\u00E9e, la connexion a donc \u00E9t\u00E9 \u00E9tablie avec une base de donn\u00E9es existante.
D015=Impossible de poursuivre la lecture car une autre transaction a modifi\u00E9 la valeur.
42Z9E=La contrainte ''{0}'' n''est pas une contrainte {1}.
XBM0Y.D=Le r\u00E9pertoire de sauvegarde de la base de donn\u00E9es {0} est introuvable. Assurez-vous que le chemin de sauvegarde indiqu\u00E9 est correct.
XN008.S=Le traitement de la requ\u00EAte a \u00E9t\u00E9 arr\u00EAt\u00E9 en raison d''une erreur sur le serveur.
42886=Le param\u00E8tre ''{0}'' ''{1}'' requiert un marqueur de param\u00E8tre ''?''.
XJ093.S=La longueur de BLOB/CLOB, {0}, est trop importante.  La longueur ne peut d\u00E9passer {1}.
01J10=Les ensembles de r\u00E9sultats sensibles au d\u00E9filement ne sont pas pris en charge par le serveur ; r\u00E9affectation des touches au curseur permettant uniquement d''avancer
XJ066.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setMaxFieldSize(int max).
C007=Exception lors du chargement de la classe {0} \u00E0 partir du fichier JAR {1} - {2}
XJ048.C=Conflit d''attributs sp\u00E9cifi\u00E9s d''initialisation \: {0}
4250A=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur l''objet ''{2}''.''{3}''.
XJ084.U=La colonne ne correspond pas \u00E0 une colonne de la table de base. Impossible d''\u00E9mettre {0} sur cette colonne.
XSAS1.S=Une tentative d''extraction d''une ligne avant le d\u00E9but d''un tri ou apr\u00E8s la fin d''un tri a \u00E9t\u00E9 effectu\u00E9e.
D006=La sauvegarde du segment de donn\u00E9es vers l''emplacement {0} est termin\u00E9e. 
XN017.S=La fin du flux a \u00E9t\u00E9 atteinte pr\u00E9matur\u00E9ment lors de la lecture du flux sp\u00E9cifi\u00E9 par le param\u00E8tre \#{0}.  Les donn\u00E9es restantes attendues par le serveur ont \u00E9t\u00E9 remplies avec 0x0.
