#Thu May 16 17:55:33 BRT 2013
01J02=Kurzory citliv\u00E9 na posuv nejsou moment\u00E1ln\u011B implementov\u00E1ny.
XJ067.S=Ukazatel na text SQL m\u00E1 hodnotu ''null''.
J010=za\u0161ifrovat datab\u00E1zi na disku
42Z9F=P\u0159\u00EDli\u0161 mnoho index\u016F ({0}) v tabulce {1}. Limit je {2}. 
42995=Po\u017Eadovan\u00E1 funkce se nevztahuje na glob\u00E1ln\u00ED do\u010Dasn\u00E9 tabulky.
XJ049.C=Byly uvedeny konfliktn\u00ED atributy vytvo\u0159en\u00ED.
XJ085.S=Tok dat ji\u017E byl p\u0159e\u010Dten, byl dosa\u017Een konec souboru a tok dat nelze pou\u017E\u00EDt znovu.
J100=Nelze nal\u00E9zt t\u0159\u00EDdu s\u00ED\u0165ov\u00E9ho serveru {0}. Va\u0161e cesta ke t\u0159\u00EDd\u011B by m\u011Bla obsahovat soubor derbynet.jar.
XN018.S=Chyba s\u00ED\u0165ov\u00E9ho protokolu\: uveden\u00E1 velikost Reader, parametr \#{0}, je men\u0161\u00ED ne\u017E skute\u010Dn\u00E1 d\u00E9lka InputStream.
XJ058.S=Nelze rolovat zp\u011Bt glob\u00E1ln\u00ED transakci pomoc\u00ED p\u0159ipojen\u00ED. Zpracov\u00E1n\u00ED potvrzen\u00ED mus\u00ED proj\u00EDt rozhran\u00EDm XAResource.
XSTB0.M=Do\u0161lo k v\u00FDjimce b\u011Bhem p\u0159ed\u010Dasn\u00E9ho ukon\u010Den\u00ED transakce.
4250B=Neplatn\u00E1 vlastnost autorizace datab\u00E1ze ''{0}\={1}''.
XJ076.S=Argument pozice ''{0}'' p\u0159ekra\u010Duje velikost BLOB/CLOB.
D007=byl upraven soubor service.properties datab\u00E1ze, aby se pou\u017E\u00EDvalo p\u0159edvolen\u00E9 za\u0159\u00EDzen\u00ED protokolu
XSDAA.S=Neplatn\u00E9 \u010Dasov\u00E9 ozna\u010Den\u00ED {0}. \u010Casov\u00E9 ozna\u010Den\u00ED bu\u010F poch\u00E1z\u00ED z odli\u0161n\u00E9 str\u00E1nky, nebo z nekompatibiln\u00ED implementace.
XBM0Z.D=Nelze kop\u00EDrovat soubor ''{0}'' do ''{1}''. Ujist\u011Bte se, \u017Ee v m\u00EDst\u011B ur\u010Den\u00ED je dostatek prostoru a \u017Ee m\u00E1te spr\u00E1vn\u00E1 povolen\u00ED. 
XN009.S=Chyba p\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED d\u00E9lky objektu BLOB/CLOB. N\u00E1sleduje v\u00FDjimka.
XSLB8.S=Pokou\u0161\u00EDte se resetovat skenov\u00E1n\u00ED na {0}, mimo limit {1}.
