#Thu May 16 17:55:33 BRT 2013
42878=La clause ORDER BY d''une instruction SELECT UNION prend uniquement en charge les r\u00E9f\u00E9rences de colonne non qualifi\u00E9es et les num\u00E9ros de position des colonnes. Les autres expressions ne sont pas prises en charge pour l''instant.
01J02=Les curseurs sensibles au d\u00E9filement ne sont pas impl\u00E9ment\u00E9s actuellement.
4251A=L''instruction {0} ne peut \u00EAtre \u00E9mise que par le propri\u00E9taire de la base de donn\u00E9es.
XJ067.S=Le pointeur de texte SQL est nul.
J010=chiffrer la base de donn\u00E9es sur disque
42Z9F=Trop d''index ({0}) pour la table {1}. La limite est {2}.  
42995=La fonction demand\u00E9e ne s''applique pas aux tables temporaires globales.
XJ049.C=Des attributs de cr\u00E9ation incompatibles ont \u00E9t\u00E9 sp\u00E9cifi\u00E9s.
XJ085.S=Le flux a d\u00E9j\u00E0 \u00E9t\u00E9 lu et la fin du fichier atteinte, donc le flux ne peut pas \u00EAtre r\u00E9utilis\u00E9.
J100=Impossible de trouver la classe de serveur de r\u00E9seau, {0}. Votre chemin d''acc\u00E8s aux classes doit contenir le fichier derbynet.jar.
XN018.S=Erreur de protocole r\u00E9seau \: la taille d\u00E9finie de l''objet Reader, param\u00E8tre n\u00B0{0}, est inf\u00E9rieure \u00E0 la longueur r\u00E9elle de Reader.
XJ058.S=Impossible d''annuler une transaction globale qui utilise la connexion ; le traitement de la validation doit passer par l''interface XAResource.
XSTB0.M=Une exception a \u00E9t\u00E9 \u00E9mise au cours de l''abandon de la transaction.
4250B=Propri\u00E9t\u00E9 d''autorisation de la base de donn\u00E9es incorrecte ''{0}\={1}''.
XJ076.S=L''argument de position ''{0}'' d\u00E9passe la taille du BLOB/CLOB.
D007=la base de donn\u00E9es service.properties a \u00E9t\u00E9 \u00E9dit\u00E9e pour utiliser l''unit\u00E9 de journalisation par d\u00E9faut
XSDAA.S=Horodatage {0} non valide ; il provient soit d''une page diff\u00E9rente, soit d''une impl\u00E9mentation incompatible
XBM0Z.D=Impossible de copier le fichier ''{0}'' dans ''{1}''. Assurez-vous que l''espace est suffisant et que les droits d''acc\u00E8s sont corrects. 
XN009.S=Erreur d''obtention de la longueur de l''objet BLOB/CLOB, l''exception est la suivante.
XSLB8.S=Tentative de r\u00E9initialisation d''une analyse \u00E0 {0}, au-del\u00E0 de sa limite de {1}.
