#Thu May 16 17:55:33 BRT 2013
42878=La cl\u00E1usula ORDER BY de las sentencias SELECT UNION s\u00F3lo admite referencias de columnas sin cualificar y n\u00FAmeros de posici\u00F3n de columna. En este momento no se admiten otras expresiones.
01J02=Los cursores sensibles al desplazamiento no est\u00E1n implementados actualmente.
4251A=La sentencia {0} s\u00F3lo la puede emitir el propietario de la base de datos.
XJ067.S=El puntero de texto SQL es nulo.
J010=cifrar base de datos en disco
42Z9F=Demasiados \u00EDndices ({0}) en la tabla {1}. El l\u00EDmite es {2}.  
42995=La funci\u00F3n solicitada no se aplica a tablas temporales globales.
XJ049.C=Se han especificado atributos de creaci\u00F3n que entran en conflicto.
XJ085.S=La corriente ya se ha le\u00EDdo, se ha alcanzado el fin de archivo y no se puede volver a utilizar.
J100=No se puede encontrar la clase del servidor de red, {0}. La v\u00EDa de acceso a la clase deber\u00EDa contener derbynet.jar.
XN018.S=Error de protocolo de red\: el tama\u00F1o especificado de Reader (Lector), par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XJ058.S=No se puede retrotraer una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de comprometer debe ir a trav\u00E9s de la interfaz XAResource.
XSTB0.M=Se ha generado una excepci\u00F3n al terminar anormalmente la transacci\u00F3n.
4250B=Propiedad de autorizaci\u00F3n de base de datos no v\u00E1lida ''{0}\={1}''.
XJ076.S=El argumento de posici\u00F3n ''{0}'' supera el tama\u00F1o del BLOB/CLOB.
D007=se ha editado service.properties de la base de datos para utilizar el dispositivo de anotaci\u00F3n cronol\u00F3gica por omisi\u00F3n
XSDAA.S=Indicaci\u00F3n de la hora {0} no permitida, bien procede de una p\u00E1gina diferente o de una implementaci\u00F3n incompatible
XBM0Z.D=No es posible copiar el archivo ''{0}'' como ''{1}''. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
XN009.S=Error al obtener la longitud del objeto BLOB/CLOB, a continuaci\u00F3n se obtiene una excepci\u00F3n.
XSLB8.S=Intentando restablecer la exploraci\u00F3n en {0}, m\u00E1s all\u00E1 de su l\u00EDmite de {1}.
