#Thu May 16 17:55:33 BRT 2013
42Y95=El operador ''{0}'' con un tipo de operando izquierdo de ''{1}'' y un tipo de operando derecho de ''{2}'' no est\u00E1 soportado.
42Z85.U=tabla
43X95.U=proyecci\u00F3n
XIE0I.S=Se ha producido una excepci\u00F3n de E/S al grabar datos en el archivo.
42X87=Al menos una expresi\u00F3n de resultado (THEN o ELSE) de la expresi\u00F3n ''{0}'' no debe ser un ''?''. 
43Y49.U=Insertar VTI
42500=El usuario ''{0}'' no tiene el permiso de {1} en la tabla ''{2}''.''{3}''.
XSRSA.S=No se puede realizar una copia de seguridad de la base de datos cuando existen operaciones sin registrar no comprometidas. Comprometa las transacciones con operaciones de bloqueo de copia de seguridad. 
42Z58.U=Ejecuci\u00F3n detenida despu\u00E9s de generar mediante el distintivo de depuraci\u00F3n StopAfterGenerating.
54002=Una constante de serie que comienza por ''{0}'' es demasiado larga.
43X68.U=Filas insertadas
42X69=No est\u00E1 permitido hacer referencia a un campo (''{0}'') utilizando una expresi\u00F3n de referencia del tipo primitivo Java ''{1}''.
01505=Es posible que el valor {0} est\u00E9 truncado.
42X96=La v\u00EDa de acceso de clase (classpath) de la base de datos contiene un archivo jar ''{0}'' desconocido.
43X86.U=Uni\u00F3n de bucle anidado
08003.C.3=La conexi\u00F3n f\u00EDsica subyacente est\u00E1 obsoleta o cerrada.
08003.C.2=El m\u00E9todo Lob llamado despu\u00E9s de una conexi\u00F3n se ha cerrado
08003.C.1=getConnection() no v\u00E1lido en una Conexi\u00F3nAgrupada cerrada.
42Y59=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashInitialCapacity. El valor debe ser mayor que 0.
07004=El par\u00E1metro {0} es un par\u00E1metro de procedimiento {1} y por tanto debe registrarse con CallableStatement.registerOutParameter antes de la ejecuci\u00F3n.
54011=Se han especificado demasiadas columnas ({0}) para la tabla o vista {1}. El l\u00EDmite es {2}.
22007.S.181=La sintaxis de la representaci\u00F3n de serie de un valor de fecha y hora es incorrecta.
38000=Se he generado la excepci\u00F3n ''{0}'' al evaluar una expresi\u00F3n.
22007.S.180=La representaci\u00F3n de serie de un valor de fecha y hora queda fuera de rango.
43X59.U=todo
42X78=La columna ''{0}'' no est\u00E1 en el resultado de la expresi\u00F3n de consulta.
22025=El car\u00E1cter de escape debe ir seguido del car\u00E1cter de escape, ''_'' o ''%''. No puede ir seguido de ning\u00FAn otro car\u00E1cter o ir al final del patr\u00F3n.
43Y58.U=Intersect ResultSet
08003=Sin conexi\u00F3n actual.
42Z76=No se permiten m\u00FAltiples elementos de contexto XML.
43X77.U=tiempo de creaci\u00F3n de conglomerado temporal (milisegundos)
XBM0H.D=No se puede crear el directorio {0}.
46001=Excepci\u00F3n al acceder al archivo jar mediante el URL ''{0}''.
