#Thu May 16 17:55:33 BRT 2013
42Y95=L''op\u00E9rateur ''{0}'' ayant comme type d''op\u00E9rande de gauche ''{1}'' et comme type d''op\u00E9rande de droite ''{2}'' n''est pas prise en charge.
42Z85.U=table
43X95.U=projection
XIE0I.S=Une exception d''E/S s''est produite lors de l''\u00E9criture de donn\u00E9es dans le fichier.
42X87=Au moins une expression de r\u00E9sultat (THEN ou ELSE) de l''expression ''{0}'' ne doit pas \u00EAtre un caract\u00E8re ''?''. 
43Y49.U=Ins\u00E9rer le VTI
42500=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la table ''{2}''.''{3}''.
XSRSA.S=Impossible de sauvegarder la base de donn\u00E9es lorsque des op\u00E9rations non consign\u00E9es ne sont pas valid\u00E9es. Veuillez valider les transactions contenant des op\u00E9rations qui emp\u00EAchent de sauvegarder. 
42Z58.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s la g\u00E9n\u00E9ration par l''indicateur de d\u00E9bogage StopAfterGenerating.
54002=Une constante de cha\u00EEne commen\u00E7ant par ''{0}'' est trop longue.
43X68.U=Lignes ins\u00E9r\u00E9es
42X69=Il n''est pas permis de r\u00E9f\u00E9rencer une zone (''{0}'') \u00E0 l''aide d''une expression de r\u00E9f\u00E9rencement du type primitif Java ''{1}''.
01505=La valeur {0} est peut-\u00EAtre tronqu\u00E9e.
42X96=Le chemin d''acc\u00E8s aux classes de la base de donn\u00E9es contient un fichier jar inconnu ''{0}''.
43X86.U=Jointure en boucle imbriqu\u00E9e
08003.C.3=La connexion physique sous-jacente est p\u00E9rim\u00E9e ou ferm\u00E9e.
08003.C.2=Appel de m\u00E9thode d''objet LOB apr\u00E8s fermeture de la connexion
08003.C.1=La m\u00E9thode getConnection() est incorrecte sur un objet PooledConnection ferm\u00E9.
42Y59=Valeur non valide, ''{0}'', indiqu\u00E9e pour l''\u00E9l\u00E9ment de substitution hashInitialCapacity. La valeur doit \u00EAtre sup\u00E9rieure \u00E0 0.
07004=Le param\u00E8tre {0} est un param\u00E8tre de proc\u00E9dure {1} et doit \u00EAtre enregistr\u00E9 avec CallableStatement.registerOutParameter avant son ex\u00E9cution.
54011=Trop de colonnes ({0}) ont \u00E9t\u00E9 sp\u00E9cifi\u00E9es pour la table ou la vue {1}. La limite est {2}.
22007.S.181=La syntaxe de la repr\u00E9sentation de la cha\u00EEne d''une valeur date/heure n''est pas correcte.
38000=L''exception ''{0}'' a \u00E9t\u00E9 \u00E9mise lors de l''\u00E9valuation d''une expression.
22007.S.180=La repr\u00E9sentation de la cha\u00EEne d''une valeur date/heure se situe hors de la fourchette admise.
43X59.U=tous
42X78=La colonne ''{0}'' ne figure pas dans le r\u00E9sultat de l''expression de requ\u00EAte.
22025=Le caract\u00E8re d''\u00E9chappement doit \u00EAtre suivi d''un caract\u00E8re d''\u00E9chappement, ''_'' ou ''%''. Il ne peut \u00EAtre suivi d''aucun autre caract\u00E8re, ni se trouver \u00E0 la fin du masque.
43Y58.U=ResultSet Intersect
08003=Aucune connexion en cours.
42Z76=Les \u00E9l\u00E9ments contextuels multiples ne sont pas autoris\u00E9s.
43X77.U=dur\u00E9e de cr\u00E9ation du conglom\u00E9rat temporaire (millisecondes)
XBM0H.D=Impossible de cr\u00E9er le r\u00E9pertoire {0}.
46001=Exception lors de l''acc\u00E8s au fichier jar \u00E0 l''aide de l''URL ''{0}''.
