#Thu May 16 17:55:33 BRT 2013
42Y95=Operator ''{0}'' z operandem typu ''{1}'' po lewej stronie i operandem typu ''{2}'' po prawej nie jest obs\u0142ugiwany.
42Z85.U=tabela
43X95.U=projektowanie
XIE0I.S=Podczas zapisu danych do pliku wyst\u0105pi\u0142 wyj\u0105tek we/wy.
42X87=Przynajmniej jedno wyra\u017Cenie wynikowe (THEN lub ELSE) wyra\u017Cenia ''{0}'' nie mo\u017Ce by\u0107 parametrem ''?''. 
43Y49.U=Wstaw interfejs VTI
42500=U\u017Cytkownik ''{0}'' nie ma uprawnienia {1} do tabeli ''{2}''.''{3}''.
XSRSA.S=Nie mo\u017Cna utworzy\u0107 kopii zapasowej bazy danych, je\u015Bli niezarejestrowane operacje nie zosta\u0142y zatwierdzone. Zatwierd\u017A transakcje z operacjami blokuj\u0105cymi tworzenie kopii zapasowej. 
42Z58.U=Wykonywanie zatrzymane przez opcj\u0119 debugowania StopAfterGenerating po wygenerowaniu.
54002=Sta\u0142a \u0142a\u0144cuchowa rozpoczynaj\u0105ca si\u0119 od ''{0}'' jest za d\u0142uga.
43X68.U=Wstawione wiersze
42X69=Odwo\u0142ywanie si\u0119 do pola (''{0}'') za pomoc\u0105 wyra\u017Cenia odwo\u0142ania o typie podstawowym Java ''{1}'' nie jest dozwolone.
01505=Warto\u015B\u0107 {0} mo\u017Ce zosta\u0107 obci\u0119ta.
42X96=\u015Acie\u017Cka klasy bazy danych zawiera nieznany plik jar ''{0}''.
43X86.U=\u0141\u0105czenie zagnie\u017Cd\u017Cone
08003.C.3=Bazowe po\u0142\u0105czenie fizyczne jest nieaktualne lub zamkni\u0119te.
08003.C.2=Metoda Lob wywo\u0142ana po po\u0142\u0105czeniu zosta\u0142a zamkni\u0119ta
08003.C.1=Metoda getConnection() nie jest poprawna dla zamkni\u0119tego obiektu PooledConnection.
42Y59=Niepoprawna warto\u015B\u0107 ''{0}'' okre\u015Blona dla nadpisania hashInitialCapacity. Warto\u015B\u0107 musi by\u0107 wi\u0119ksza od 0.
07004=Parametr {0} jest parametrem procedury {1} i przed wykonaniem musi by\u0107 zarejestrowany za pomoc\u0105 funkcji CallableStatement.registerOutParameter.
54011=Dla tabeli lub widoku {1} okre\u015Blono zbyt wiele kolumn ({0}). Limit wynosi {2}.
22007.S.181=Sk\u0142adnia reprezentacji \u0142a\u0144cucha warto\u015Bci data-godzina jest niepoprawna.
38000=Podczas szacowania wyra\u017Cenia zg\u0142oszony zosta\u0142 wyj\u0105tek ''{0}''.
22007.S.180=Reprezentacja \u0142a\u0144cucha warto\u015Bci data-godzina jest spoza zakresu.
43X59.U=wszystkie
42X78=Kolumny ''{0}'' nie ma w wyniku wyra\u017Cenia zapytania.
22025=Po znaku zmiany znaczenia musi nast\u0119powa\u0107 znak zmiany znaczenia ''_'' lub ''%''. Nie mo\u017Ce po nim nast\u0119powa\u0107 \u017Caden inny znak ani nie mo\u017Ce si\u0119 on znajdowa\u0107 na ko\u0144cu wzorca.
43Y58.U=Interfejs ResultSet dla przeci\u0119cia
08003=Brak bie\u017C\u0105cego po\u0142\u0105czenia.
42Z76=Wiele element\u00F3w kontekstu XML nie jest dozwolonych.
43X77.U=czas tworzenia konglomeratu tymczasowego (milisekundy)
XBM0H.D=Nie mo\u017Cna utworzy\u0107 katalogu {0}.
46001=Wyj\u0105tek podczas dost\u0119pu do pliku jar przy u\u017Cyciu adresu URL ''{0}''.
