#Thu May 16 17:55:33 BRT 2013
42879=\uCFFC\uB9AC\uC5D0 DISTINCT\uAC00 \uC9C0\uC815\uB418\uACE0 \uD574\uB2F9 \uC5F4\uC774 \uCFFC\uB9AC \uACB0\uACFC\uC5D0 \uD45C\uC2DC\uB418\uC9C0 \uC54A\uC73C\uBBC0\uB85C ORDER BY \uC808\uC5D0 \uC5F4 ''{0}''\uC774(\uAC00) \uD3EC\uD568\uB418\uC9C0 \uC54A\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
2D521.S.2=COMMIT \uB610\uB294 ROLLBACK\uC740 \uC751\uC6A9\uD504\uB85C\uADF8\uB7A8 \uC2E4\uD589 \uD658\uACBD\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. 
XN019.S={0}\uC744(\uB97C) \uC2E4\uD589\uD558\uB294 \uC911\uC5D0 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC73C\uBA70, \uC11C\uBC84\uC5D0\uC11C {1}\uC744(\uB97C) \uB9AC\uD134\uD588\uC2B5\uB2C8\uB2E4.
2D521.S.1=\uC804\uC5ED \uD2B8\uB79C\uC7AD\uC158 \uC911\uC5D0 setAutoCommit(true)\uB294 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
4251B=PUBLIC\uC740 \uC608\uC57D\uB418\uC5B4 \uC788\uC73C\uBBC0\uB85C \uC0AC\uC6A9\uC790 \uC2DD\uBCC4\uC790\uB098 \uC5ED\uD560 \uC774\uB984\uC73C\uB85C \uC0AC\uC6A9\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ059.S=\uAE00\uB85C\uBC8C \uD2B8\uB79C\uC7AD\uC158\uC774 \uACC4\uC18D \uD65C\uC131 \uC0C1\uD0DC\uC77C \uB54C \uC5F0\uACB0\uC744 \uC885\uB8CC\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSDBA.D={0} \uC624\uBE0C\uC81D\uD2B8 \uD560\uB2F9 \uC2DC\uB3C4\uAC00 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
XJ077.S=getBytes/getSubString\uC744 \uC0AC\uC6A9\uD558\uC5EC BLOB/CLOB \uD328\uD134\uC758 \uCCAB \uBC88\uC9F8 \uBC14\uC774\uD2B8/\uBB38\uC790\uB97C \uC77D\uC73C\uB824\uACE0 \uD560 \uB54C \uC608\uC678\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
J101=\uB124\uD2B8\uC6CC\uD06C \uC11C\uBC84 \uD074\uB798\uC2A4 {0}\uC744(\uB97C) \uB85C\uB4DC\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. {1}  derbynet.jar \uD30C\uC77C\uC758 \uBB34\uACB0\uC131\uC744 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
XSDAB.S=\uB110 \uC2DC\uAC04 \uC18C\uC778\uC744 \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSTA2.S=\uB2E4\uB978 \uD2B8\uB79C\uC7AD\uC158\uC744 \uD65C\uC131\uD654\uD558\uB824\uACE0 \uC2DC\uB3C4\uD588\uC744 \uB54C \uD2B8\uB79C\uC7AD\uC158\uC774 \uC774\uBBF8 \uD65C\uC131 \uC0C1\uD0DC\uC600\uC2B5\uB2C8\uB2E4.
01J12=\uC11C\uBC84\uC5D0\uC11C \uBA54\uC2DC\uC9C0 \uD14D\uC2A4\uD2B8\uB97C \uAC00\uC838\uC62C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uB2E4\uC74C \uC608\uC678\uB97C \uCC38\uC870\uD558\uC2ED\uC2DC\uC624. \uC2A4\uD1A0\uC5B4\uB4DC \uD504\uB85C\uC2DC\uC800 SYSIBM.SQLCAMESSAGE\uAC00 \uC11C\uBC84\uC5D0 \uC124\uCE58\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4. \uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uAD00\uB9AC\uC790\uC5D0\uAC8C \uBB38\uC758\uD558\uC2ED\uC2DC\uC624.
40XT0=RawStore \uBAA8\uB4C8\uC5D0 \uC758\uD574 \uB0B4\uBD80 \uC624\uB958\uAC00 \uC2DD\uBCC4\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
XSLB9.S=\uB354 \uC774\uC0C1 \uBCC0\uACBD\uC744 \uBC1C\uD589\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uB85C\uADF8 \uD329\uD1A0\uB9AC\uAC00 \uC911\uC9C0\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
XJ095.S=\uAD8C\uD55C \uC788\uB294 \uC870\uCE58\uB97C \uC2E4\uD589\uD558\uB824\uB294 \uC2DC\uB3C4\uAC00 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
J020=\uBE44\uBC00 \uC554\uD638\uD654 \uD0A4
XJ068.S=executeBatch \uBC0F clearBatch\uB9CC\uC774 \uC77C\uAD04\uCC98\uB9AC \uC911\uAC04\uC5D0 \uD5C8\uC6A9\uB429\uB2C8\uB2E4.
4250C=''{0}'' \uC0AC\uC6A9\uC790\uB294 \uC77D\uAE30 \uC804\uC6A9 \uBC0F \uC804\uCCB4 \uC561\uC138\uC2A4 \uAD8C\uD55C \uBAA9\uB85D\uC5D0 \uBAA8\uB450 \uC788\uC5B4\uC11C\uB294 \uC548\uB429\uB2C8\uB2E4.
J110=\uBCF4\uC548 \uBA54\uCEE4\uB2C8\uC998\uC774 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
D008=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 service.properties \uD3B8\uC9D1 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBC31\uC5C5\uC774 \uC911\uB2E8\uB418\uC5C8\uC2B5\uB2C8\uB2E4. {0}
XJ086.S=\uC774 \uBA54\uC18C\uB4DC\uB294 \uCEE4\uC11C\uAC00 \uC0BD\uC785 \uD589\uC5D0 \uC5C6\uAC70\uB098 \uC774 ResultSet \uC624\uBE0C\uC81D\uD2B8\uC758 \uB3D9\uC2DC\uC131\uC774 CONCUR_READ_ONLY\uC778 \uACBD\uC6B0 \uD638\uCD9C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSAS3.S=\uC815\uB82C\uC5D0 \uC0BD\uC785\uB41C \uD589\uC758 \uC720\uD615\uC774 \uC815\uB82C\uC758 \uD15C\uD50C\uB9AC\uD2B8\uC640 \uC77C\uCE58\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
42XAA=\uC0DD\uC131\uB41C \uC5F4 ''{0}''\uC758 NEW \uAC12\uC774 \uD2B8\uB9AC\uAC70\uC758 BEFORE \uC791\uC5C5\uC5D0 \uC5B8\uAE09\uB418\uC5B4 \uC788\uC2B5\uB2C8\uB2E4. \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
