#Thu May 16 17:55:33 BRT 2013
2D521.S.2=COMMIT ou ROLLBACK inv\u00E1lido para o ambiente de execu\u00E7\u00E3o do aplicativo.
XN019.S=Erro ao executar {0}, o servidor retornou {1}.
2D521.S.1=setAutoCommit(true) n\u00E3o \u00E9 v\u00E1lido durante uma transa\u00E7\u00E3o global.
XJ059.S=N\u00E3o \u00E9 poss\u00EDvel fechar uma conex\u00E3o enquanto uma transa\u00E7\u00E3o global ainda est\u00E1 ativa.
XSDBA.D=Falha na tentativa de alocar o objeto {0}.
XJ077.S=Ocorreu uma exce\u00E7\u00E3o ao tentar ler o primeiro byte/caractere do padr\u00E3o BLOB/CLOB utilizando getBytes/getSubString.
J101=Imposs\u00EDvel carregar a classe de servidor de rede, {0}. {1}  Verifique a integridade de seu arquivo derbynet.jar.
XSDAB.S=n\u00E3o \u00E9 poss\u00EDvel definir um carimbo do tempo nulo
XSTA2.S=J\u00E1 havia uma transa\u00E7\u00E3o ativa quando foi feita a tentativa de tornar outra transa\u00E7\u00E3o ativa.
01J12=N\u00E3o foi poss\u00EDvel obter o texto da mensagem no servidor. Consulte a pr\u00F3xima exce\u00E7\u00E3o. O procedimento armazenado SYSIBM.SQLCAMESSAGE n\u00E3o est\u00E1 instalado no servidor. Por favor contacte o administrador do banco de dados.
40XT0=Foi identificado um erro interno pelo m\u00F3dulo RawStore.
XSLB9.S=N\u00E3o \u00E9 poss\u00EDvel fazer nenhuma altera\u00E7\u00E3o, a cria\u00E7\u00E3o de logs foi encerrada.
XJ095.S=Falha na tentativa de executar uma a\u00E7\u00E3o privilegiada.
J020=chave secreta criptografada
XJ068.S=Somente s\u00E3o permitidos ''executeBatch'' e ''clearBatch'' no meio de um lote.
4250C=O(s) usu\u00E1rio(s) ''{0}'' n\u00E3o deve(m) estar tanto na lista de autoriza\u00E7\u00E3o apenas-de-leitura quanto na de acesso completo.
J110=mecanismo de seguran\u00E7a n\u00E3o suportado
D008=erro ao editar o arquivo service.properties do banco de dados, c\u00F3pia de seguran\u00E7a interrompida\: {0}
XJ086.S=Este m\u00E9todo n\u00E3o pode ser chamado, a n\u00E3o ser que o cursor esteja posicionado na linha de inser\u00E7\u00E3o.
XSAS3.S=O tipo da linha inserida na classifica\u00E7\u00E3o n\u00E3o corresponde ao modelo da classifica\u00E7\u00E3o.
