#Thu May 16 17:55:33 BRT 2013
2D521.S.2=A COMMIT vagy ROLLBACK \u00E9rv\u00E9nytelen alkalmaz\u00E1sv\u00E9grehajt\u00E1si k\u00F6rnyezetben. 
XN019.S=A(z) {0} v\u00E9grehajt\u00E1s\u00E1hoz a kiszolg\u00E1l\u00F3 {1} \u00E9rt\u00E9ket adott vissza.
2D521.S.1=A setAutoCommit(true) \u00E9rv\u00E9nytelen glob\u00E1lis tranzakci\u00F3 sor\u00E1n.
XJ059.S=A glob\u00E1lis kapcsolat nem z\u00E1rhat\u00F3 le, am\u00EDg van akt\u00EDv tranzakci\u00F3.
XSDBA.D=A(z) {0} objektum lefoglal\u00E1s\u00E1ra tett k\u00EDs\u00E9rlet meghi\u00FAsult.
XJ077.S=Kiv\u00E9tel \u00E9rkezett a BLOB/CLOB minta els\u0151 byte-j\u00E1nak/karakter\u00E9nek getBytes/getSubString paranccsal val\u00F3 olvas\u00E1sa sor\u00E1n.
J101=A h\u00E1l\u00F3zati kiszolg\u00E1l\u00F3oszt\u00E1ly nem t\u00F6lthet\u0151 be, {0}. {1}  Ellen\u0151rizze a derbynet.jar f\u00E1jl integrit\u00E1s\u00E1t.
XSDAB.S=Nem \u00E1ll\u00EDthat\u00F3 be null\u00E9rt\u00E9k\u0171 id\u0151pecs\u00E9t
XSTA2.S=Egy tranzakci\u00F3 m\u00E1r akt\u00EDv volt, amikor k\u00EDs\u00E9rlet t\u00F6rt\u00E9nt egy m\u00E1sik tranzakci\u00F3 akt\u00EDvv\u00E1 t\u00E9tel\u00E9re.
01J12=A kiszolg\u00E1l\u00F3r\u00F3l nem k\u00E9rdezhet\u0151 le sz\u00F6veg. Tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt. A SYSIBM.SQLCAMESSAGE t\u00E1rolt elj\u00E1r\u00E1s a kiszolg\u00E1l\u00F3n nem t\u00E1mogatott. L\u00E9pjen kapcsolatba az adatb\u00E1zis-adminisztr\u00E1torral.
40XT0=A RawStore modul bels\u0151 hib\u00E1t azonos\u00EDtott.
XSLB9.S=Nem adhat\u00F3 ki t\u00F6bb m\u00F3dos\u00EDt\u00E1s, a napl\u00F3z\u00F3 gy\u00E1r le\u00E1llt.
XJ095.S=A privilegiz\u00E1lt tev\u00E9kenys\u00E9g v\u00E9grehajt\u00E1s\u00E1ra t\u00F6rt\u00E9nt k\u00EDs\u00E9rlet meghi\u00FAsult.
J020=titkos kriptogr\u00E1fiai kulcs
XJ068.S=A k\u00F6teg k\u00F6zep\u00E9n csak executeBatch \u00E9s clearBatch megengedett.
4250C=''{0}'' felhaszn\u00E1l\u00F3 nem lehet csak olvashat\u00F3 \u00E9s teljes hozz\u00E1f\u00E9r\u00E9si jogosults\u00E1gi list\u00E1ban egyar\u00E1nt.
J110=biztons\u00E1gi mechanizmus nem t\u00E1mogatott
D008=hiba az adatb\u00E1zis service.properties szerkeszt\u00E9se sor\u00E1n, a ment\u00E9s megszak\u00EDt\u00E1sra ker\u00FClt\: {0}
XJ086.S=A met\u00F3dus nem h\u00EDvhat\u00F3 meg, am\u00EDg a kurzor nem a k\u00E9rd\u00E9ses soron van, vagy ha a ResultSet objektum p\u00E1rhuzamoss\u00E1ga CONCUR_READ_ONLY.
XSAS3.S=A rendez\u00E9sbe besz\u00FArt sor t\u00EDpusa nem egyezik a rendez\u00E9s sablonj\u00E1val.
