#Thu May 16 17:55:33 BRT 2013
42879=La cl\u00E1usula ORDER BY no puede contener la columna ''{0}'', ya que la consulta contiene la clave DISTINCT y esa columna no aparece en el resultado de la consulta.
2D521.S.2=COMMIT o ROLLBACK no v\u00E1lido para el entorno de ejecuci\u00F3n de aplicaci\u00F3n. 
XN019.S=Error al ejecutar {0}, el servidor ha devuelto {1}.
2D521.S.1=setAutoCommit(true) no v\u00E1lido durante una transacci\u00F3n global.
4251B=PUBLIC est\u00E1 reservado y no se puede utilizar como identificador de usuario ni nombre de funci\u00F3n.
XJ059.S=No se puede cerrar una conexi\u00F3n mientras siga activa una transacci\u00F3n global.
XSDBA.D=Anomal\u00EDa al intentar asignar el objeto {0}.
XJ077.S=Se ha obtenido una excepci\u00F3n al intentar leer el primer byte/car\u00E1cter del patr\u00F3n BLOB/CLOB mediante getBytes/getSubString.
J101=No se puede cargar la clase del servidor de red, {0}. {1}  Compruebe la integridad del archivo derbynet.jar.
XSDAB.S=no se puede establecer una indicaci\u00F3n de la hora nula
XSTA2.S=Ya estaba activa una transacci\u00F3n cuando se intent\u00F3 activar otra transacci\u00F3n.
01J12=No se puede obtener el texto de mensaje desde el servidor. Consulte la excepci\u00F3n siguiente. El procedimiento almacenado SYSIBM.SQLCAMESSAGE no est\u00E1 instalado en el servidor. P\u00F3ngase en contacto con el administrador de bases de datos.
40XT0=El m\u00F3dulo RawSotre ha identificado un error interno.
XSLB9.S=No se pueden emitir m\u00E1s cambios, la f\u00E1brica de anotaci\u00F3n cronol\u00F3gica se ha detenido.
XJ095.S=Ha fallado un intento de ejecutar una acci\u00F3n privilegiada.
J020=clave de cifrado secreta
XJ068.S=S\u00F3lo est\u00E1n permitidos executeBatch y clearBatch en mitad de un proceso por lotes.
4250C=Los usuarios ''{0}'' no pueden estar a la vez en listas de autorizaci\u00F3n de s\u00F3lo lectura y de acceso total.
J110=mecanismo de seguridad no soportado
D008=error editando service.properties de la base de datos, copia de seguridad terminada anormalmente\: {0}
XJ086.S=Este m\u00E9todo no se puede invocar mientras el cursor no est\u00E1 en la fila de inserci\u00F3n o si la concurrencia de este objeto ResultSet es CONCUR_READ_ONLY.
XSAS3.S=El tipo de fila insertada en la clasificaci\u00F3n no coincide con la plantilla de clasificaci\u00F3n.
42XAA=El valor NEW de la columna generada ''{0}'' se menciona en la acci\u00F3n BEFORE de un activador. No est\u00E1 permitido.
