#Thu May 16 17:55:33 BRT 2013
2D521.S.2=Operace COMMIT nebo ROLOV\u00C1N\u00CD ZP\u011AT jsou neplatn\u00E9 pro prost\u0159ed\u00ED prov\u00E1d\u011Bn\u00ED aplikace. 
XN019.S=Chyba p\u0159i prov\u00E1d\u011Bn\u00ED p\u0159\u00EDkazu {0}, server vr\u00E1til\: {1}.
2D521.S.1=setAutoCommit(true) je neplatn\u00E9 b\u011Bhem glob\u00E1ln\u00ED transakce.
XJ059.S=Nelze zav\u0159\u00EDt spojen\u00ED, kdy\u017E je glob\u00E1ln\u00ED transakce st\u00E1le aktivn\u00ED.
XSDBA.D=Selh\u00E1n\u00ED pokusu o alokaci objektu {0}.
XJ077.S=Do\u0161lo k v\u00FDjimce p\u0159i pokusu o na\u010Dten\u00ED prvn\u00EDho bajtu/znaku vzoru BLOB/CLOB pomoc\u00ED getBytes/getSubString.
J101=Nelze zav\u00E9st t\u0159\u00EDdu s\u00ED\u0165ov\u00E9ho serveru {0}. {1}  Zkontrolujte integritu va\u0161eho souboru derbynet.jar.
XSDAB.S=Nelze nastavit \u010Dasov\u00E9 ozna\u010Den\u00ED s hodnotou ''null''
XSTA2.S=Transakce ji\u017E byla aktivn\u00ED, kdy\u017E byl u\u010Din\u011Bn pokus o zaktivov\u00E1n\u00ED dal\u0161\u00ED transakce.
01J12=Nelze z\u00EDskat text zpr\u00E1vy ze serveru. Prohl\u00E9dn\u011Bte si dal\u0161\u00ED v\u00FDjimku. Ulo\u017Een\u00E1 procedura SYSIBM.SQLCAMESSAGE nen\u00ED instalov\u00E1na na serveru. Obra\u0165te se na va\u0161eho administr\u00E1tora datab\u00E1ze, pros\u00EDm.
40XT0=Modul RawStore identifikoval vnit\u0159n\u00ED chybu.
XSLB9.S=Nelze zadat \u017E\u00E1dn\u00E9 dal\u0161\u00ED zm\u011Bny, tov\u00E1rna protokolu byla zastavena.
XJ095.S=Selh\u00E1n\u00ED pokusu o proveden\u00ED p\u0159ednostn\u00ED akce.
J020=tajn\u00FD \u0161ifrovac\u00ED kl\u00ED\u010D
XJ068.S=Uprost\u0159ed d\u00E1vky je povoleno pouze executeBatch a clearBatch.
4250C=U\u017Eivatel\u00E9 ''{0}'' nesm\u011Bj\u00ED b\u00FDt z\u00E1rove\u0148 v seznamu opr\u00E1vn\u011Bn\u00ED pouze pro \u010Dten\u00ED a seznamu opr\u00E1vn\u011Bn\u00ED pro \u00FApln\u00FD p\u0159\u00EDstup.
J110=mechanizmus zabezpe\u010Den\u00ED nen\u00ED podporov\u00E1n
D008=chyba p\u0159i \u00FAprav\u011B souboru service.properties datab\u00E1ze, z\u00E1lohov\u00E1n\u00ED bylo p\u0159ed\u010Dasn\u011B ukon\u010Deno\: {0}
XJ086.S=Tuto metodu nelze vyvolat, kdy\u017E kurzor nen\u00ED na \u0159\u00E1dku pro vlo\u017Een\u00ED nebo kdy\u017E soub\u011B\u017Enost tohoto objektu mno\u017Einy v\u00FDsledk\u016F je CONCUR_READ_ONLY.
XSAS3.S=Typ \u0159\u00E1dku vlo\u017Een\u00E9ho do t\u0159\u00EDd\u011Bn\u00ED neodpov\u00EDd\u00E1 \u0161ablon\u011B t\u0159\u00EDd\u011Bn\u00ED.
