#Thu May 16 17:55:33 BRT 2013
42879=Die ORDER BY-Klausel enth\u00E4lt eventuell keine Spalte ''{0}'', die die Abfrage DISTINCT angibt und diese Spalte nicht im Abfrageergebnis erscheint.
2D521.S.2=COMMIT oder ROLLBACK ist f\u00FCr eine Anwendungsausf\u00FChrungsumgebung ung\u00FCltig. 
XN019.S=Fehler beim Ausf\u00FChren von {0}. Der Server hat Folgendes zur\u00FCckgegeben\: {1}
2D521.S.1=setAutoCommit(true) ist f\u00FCr eine globale Transaktion ung\u00FCltig.
4251B=PUBLIC ist reserviert und kann nicht als Benutzer-ID oder Rollenname verwendet werden.
XJ059.S=Eine Verbindung kann nicht beendet werden, solange noch eine globale Transaktion aktiv ist.
XSDBA.D=Der Versuch, das Objekt {0} zuzuordnen, ist gescheitert.
XJ077.S=Bei dem Versuch, mit getBytes/getSubString das erste Byte/Zeichen des BLOB/CLOB-Musters zu lesen, wurde eine Ausnahme empfangen.
J101=Die Netzserverklasse {0} konnte nicht geladen werden. {1}. \u00DCberpr\u00FCfen Sie die Integrit\u00E4t Ihrer Datei derbynet.jar.
XSDAB.S=Eine Nullzeitmarke kann nicht gesetzt werden.
XSTA2.S=Es wurde versucht, eine Transaktion zu aktivieren, obwohl bereits eine andere Transaktion aktiv war.
01J12=Vom Server kann kein Nachrichtentext abgerufen werden. Lesen Sie die n\u00E4chste Ausnahme. Die gespeicherte Prozedur SYSIBM.SQLCAMESSAGE ist nicht auf dem Server installiert. Wenden Sie sich an den Datenbankadministrator.
40XT0=Das Modul RawStore hat einen internen Fehler festgestellt.
XSLB9.S=Es k\u00F6nnen keine weiteren \u00C4nderungen ausgegeben werden. Die Protokoll-Factory wurde gestoppt.
XJ095.S=Der Versuch, eine Aktion mit erforderlicher Berechtigung auszuf\u00FChren, ist gescheitert.
J020=Geheimer Chiffrierschl\u00FCssel
XJ068.S=In der Mitte eines Batch sind nur executeBatch und clearBatch zul\u00E4ssig.
4250C=Benutzer ''{0}'' d\u00FCrfen nicht gleichzeitig in Berechtigungslisten f\u00FCr Lesezugriff und Vollzugriff enthalten sein.
J110=Der Sicherheitsmechanismus wird nicht unterst\u00FCtzt
D008=Fehler beim Editieren von service.properties f\u00FCr die Datenbank. Abgebrochene Sicherung\: {0}
XJ086.S=Wenn der Cursor nicht in der Einf\u00FCgezeile ist oder der gemeinsame Zugriff f\u00FCr dieses ResultSet-Objekt auf CONCUR_READ_ONLY gesetzt ist, kann diese Methode nicht aufgerufen werden.
XSAS3.S=Der Typ einer in eine Suche eingef\u00FCgten Zeile stimmt nicht mit der Suchschablone \u00FCberein.
42XAA=Der NEW-Wert der generierten Spalte ''{0}'' wird in der BEFORE-Aktion eines Ausl\u00F6sers genannt. Dies ist unzul\u00E4ssig.
