#Thu May 16 17:55:33 BRT 2013
42879=La clause ORDER BY peut ne pas contenir la colonne ''{0}'', car la requ\u00EAte indique DISTINCT et cette colonne ne figure pas dans les r\u00E9sultats de la requ\u00EAte.
2D521.S.2=Op\u00E9ration COMMIT ou ROLLBACK incorrecte pour l''environnement d''ex\u00E9cution de l''application. 
XN019.S=Erreur lors de l''ex\u00E9cution d''un {0}, le serveur a renvoy\u00E9 {1}.
2D521.S.1=Param\u00E8tre setAutoCommit(true) incorrect au cours de la transaction globale.
4251B=PUBLIC est r\u00E9serv\u00E9 et ne peut pas \u00EAtre utilis\u00E9 comme identificateur d''utilisateur ou nom de r\u00F4le.
XJ059.S=Impossible de fermer une connexion tandis qu''une transaction globale est toujours active.
XSDBA.D=Echec de la tentative d''affectation de l''objet {0}.
XJ077.S=Une exception s''est produite lors de la tentative de lecture du premier octet/caract\u00E8re du sch\u00E9ma BLOB/CLOB en utilisant getBytes/getSubString.
J101=Impossible de charger la classe du serveur de r\u00E9seau, {0}. {1}  V\u00E9rifiez l''int\u00E9grit\u00E9 du fichier derbynet.jar.
XSDAB.S=Impossible de d\u00E9finir un horodatage NULL
XSTA2.S=Une transaction \u00E9tait d\u00E9j\u00E0 active lorsqu''une tentative d''activation d''une autre transaction a \u00E9t\u00E9 effectu\u00E9e.
01J12=Impossible d''obtenir un texte de message du serveur. Voir l''exception suivante. La proc\u00E9dure m\u00E9moris\u00E9e SYSIBM.SQLCAMESSAGE n''est pas install\u00E9e sur le serveur. Veuillez contacter votre administrateur de base de donn\u00E9es.
40XT0=Une erreur interne a \u00E9t\u00E9 identifi\u00E9e par le module RawStore.
XSLB9.S=Impossible d''\u00E9mettre d''autres modifications ; la fabrique de fichier journal a \u00E9t\u00E9 arr\u00EAt\u00E9e.
XJ095.S=Une tentative d''ex\u00E9cution d''une action privil\u00E9gi\u00E9e a \u00E9chou\u00E9.
J020=cl\u00E9 de cryptographie secr\u00E8te
XJ068.S=Seuls executeBatch et clearBatch sont autoris\u00E9s au milieu d''un fichier de commandes.
4250C=Le ou les utilisateurs ''{0}'' ne doivent pas figurer \u00E0 la fois dans les listes d''autorisation d''acc\u00E8s en lecture seule et d''acc\u00E8s int\u00E9gral.
J110=M\u00E9canisme de s\u00E9curit\u00E9 non pris en charge
D008=erreur lors de l''\u00E9dition de la base de donn\u00E9es service.properties, abandon de la sauvegarde \: {0}
XJ086.S=Il est impossible d''appeler cette m\u00E9thode quand le curseur n''est pas sur la ligne d''insertion ou si l''acc\u00E8s concurrent de ce ResultSet est CONCUR_READ_ONLY.
XSAS3.S=Le type d''une ligne ins\u00E9r\u00E9e dans un tri ne correspond pas au mod\u00E8le du tri.
42XAA=La valeur NEW de la colonne g\u00E9n\u00E9r\u00E9e ''{0}'' est mentionn\u00E9e dans l''action BEFORE d''un d\u00E9clencheur. Ce param\u00E8tre n''est pas admis.
