#Thu May 16 17:55:33 BRT 2013
42879=ORDER BY \u5206\u7BC0\u306B\u5217 ''{0}'' \u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u7167\u4F1A\u306B DISTINCT \u304C\u6307\u5B9A\u3055\u308C\u3066\u304A\u308A\u3001\u7167\u4F1A\u7D50\u679C\u306B\u305D\u306E\u5217\u304C\u8868\u793A\u3055\u308C\u306A\u3044\u304B\u3089\u3067\u3059\u3002
2D521.S.2=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5B9F\u884C\u74B0\u5883\u3067\u306F COMMIT \u307E\u305F\u306F ROLLBACK \u306F\u7121\u52B9\u3067\u3059\u3002 
XN019.S={0} \u306E\u5B9F\u884C\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u3001\u30B5\u30FC\u30D0\u30FC\u306F {1} \u3092\u623B\u3057\u307E\u3057\u305F\u3002
2D521.S.1=setAutoCommit(true) \u306F\u3001\u30B0\u30ED\u30FC\u30D0\u30EB\u30FB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u9593\u306F\u7121\u52B9\u3067\u3059\u3002
4251B=PUBLIC \u306F\u4E88\u7D04\u3055\u308C\u3066\u304A\u308A\u3001\u30E6\u30FC\u30B6\u30FC ID \u3084\u30ED\u30FC\u30EB\u540D\u3068\u3057\u3066\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XJ059.S=\u30B0\u30ED\u30FC\u30D0\u30EB\u30FB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u307E\u3060\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u3068\u304D\u306B\u63A5\u7D9A\u3092\u30AF\u30ED\u30FC\u30BA\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSDBA.D=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 {0} \u306E\u5272\u308A\u632F\u308A\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
XJ077.S=getBytes/getSubString \u3092\u4F7F\u7528\u3057\u3066 BLOB/CLOB \u30D1\u30BF\u30FC\u30F3\u306E\u6700\u521D\u306E\u30D0\u30A4\u30C8/\u6587\u5B57\u3092\u8AAD\u307F\u53D6\u308D\u3046\u3068\u3057\u3066\u3001\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
J101=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30AF\u30E9\u30B9 {0} \u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002 {1}  derbynet.jar \u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5168\u6027\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XSDAB.S=NULL \u306E\u30BF\u30A4\u30E0\u30FB\u30B9\u30BF\u30F3\u30D7\u306F\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093
XSTA2.S=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u3057\u3088\u3046\u3068\u3057\u305F\u3068\u304D\u3001\u5225\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u3059\u3067\u306B\u30A2\u30AF\u30C6\u30A3\u30D6\u3067\u3057\u305F\u3002
01J12=\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30C6\u30AD\u30B9\u30C8\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002 \u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002 \u30B9\u30C8\u30A2\u30FC\u30C9\u30FB\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC SYSIBM.SQLCAMESSAGE \u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u7BA1\u7406\u8005\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
40XT0=RawStore \u30E2\u30B8\u30E5\u30FC\u30EB\u3067\u5185\u90E8\u30A8\u30E9\u30FC\u304C\u78BA\u8A8D\u3055\u308C\u307E\u3057\u305F\u3002
XSLB9.S=\u3053\u308C\u4EE5\u4E0A\u5909\u66F4\u3092\u767A\u884C\u3067\u304D\u307E\u305B\u3093\u3002\u30ED\u30B0\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C\u505C\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
XJ095.S=\u7279\u6A29\u30A2\u30AF\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3057\u3088\u3046\u3068\u3057\u3066\u5931\u6557\u3057\u307E\u3057\u305F\u3002
J020=\u79D8\u5BC6\u6697\u53F7\u9375
XJ068.S=\u30D0\u30C3\u30C1\u51E6\u7406\u4E2D\u306B\u306F\u3001executeBatch \u3068 clearBatch \u3057\u304B\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
4250C=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u3092\u3001\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u8A31\u53EF\u30EA\u30B9\u30C8\u3068\u30D5\u30EB\u30A2\u30AF\u30BB\u30B9\u8A31\u53EF\u30EA\u30B9\u30C8\u306E\u4E21\u65B9\u306B\u5165\u308C\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
J110=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
D008=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E service.properties \u306E\u7DE8\u96C6\u30A8\u30E9\u30FC\u3002\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306F\u30A2\u30DC\u30FC\u30C8\u3055\u308C\u307E\u3057\u305F\: {0}
XJ086.S=\u3053\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u30AB\u30FC\u30BD\u30EB\u304C\u633F\u5165\u884C\u306B\u5B58\u5728\u3057\u306A\u3044\u304B\u3001\u3053\u306E ResultSet \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u4E26\u884C\u6027\u304C CONCUR_READ_ONLY \u3067\u3042\u308B\u5834\u5408\u306F\u547C\u3073\u51FA\u305B\u307E\u305B\u3093\u3002
XSAS3.S=\u30BD\u30FC\u30C8\u306B\u633F\u5165\u3055\u308C\u305F\u884C\u306E\u30BF\u30A4\u30D7\u304C\u3001\u30BD\u30FC\u30C8\u306E\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
42XAA=\u751F\u6210\u3055\u308C\u305F\u5217 ''{0}'' \u306E NEW \u5024\u304C\u30C8\u30EA\u30AC\u30FC\u306E BEFORE \u30A2\u30AF\u30B7\u30E7\u30F3\u306B\u8A18\u8FF0\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
