#Thu May 16 17:55:33 BRT 2013
01J04=Die Klasse ''{0}'' f\u00FCr die Spalte ''{1}'' implementiert nicht java.io.Serializable oder java.sql.SQLData. Eine dieser Schnittstellen muss von Instanzen implementiert werden, damit sie gespeichert werden k\u00F6nnen.
XJ096.S=Im Paket {0} f\u00FCr {1} konnte ein Ressourcen-Bundle nicht gefunden werden.
4251C=Die Rolle {0} kann nicht f\u00FCr {1} gew\u00E4hrt werden, da eine Zirkularit\u00E4t entstehen w\u00FCrde.
J120=nicht angegeben
L001=------------  ANFANG DER FEHLERNACHRICHT -------------\n
XJ069.S=F\u00FCr die Ausf\u00FChrungsanweisung USING sind keine SetXXX-Methoden zul\u00E4ssig.
J102=Beim Starten des Netzservers wurde eine Ausnahme ausgel\u00F6st. {0}
01J13=Es wurden zu viele Zeilen ({0}) f\u00FCr ein Integer zur\u00FCckgegeben. Der zur\u00FCckgegebene Wert wird abgeschnitten.
40XT1=Beim Festschreiben der Transaktion wurde eine Ausnahme ausgel\u00F6st.
XJ087.S=Die Summe von position(''{0}'') und length(''{1}'') ist gr\u00F6\u00DFer als die Gr\u00F6\u00DFe der LOB plus eins.
L010=In der Datei {0} wurde ein unvollst\u00E4ndiger Protokollsatz gefunden. Der Inhalt der Protokolldatei wird von der Position {1} bis zum Dateiende bei {2} gel\u00F6scht.
J021=Gebietsschema der Datenbank
XSTB2.M=Die Transaktions\u00E4nderungen k\u00F6nnen nicht protokolliert werden. M\u00F6glicherweise versuchen Sie, in eine schreibgesch\u00FCtzte Datenbank zu schreiben.
4250D=Benutzer ''{1}'' wiederholt in der Zugriffsliste ''{0}'';
J111=Das Kennwort fehlt
D009=Das Protokollverzeichnis wurde von {0} nach {1} kopiert.
J003={0}\: Derby-Engine wird heruntergefahren
XSDBB.D=Unbekanntes Seitenformat auf der Seite {0}, Seitenspeicherauszug\: {1}
XJ078.S=Die relative Position ''{0}'' ist entweder kleiner als null oder f\u00FCr das aktuelle BLOB/CLOB zu gro\u00DF.
J030=Sicherungspfad f\u00FCr die Wiederherstellung der Datenbank aus der Sicherung
42XAB=NOT NULL ist nur zul\u00E4ssig, wenn Sie einen Datentyp explizit deklarieren.
X0X10.S=Die USING-Klausel hat mehr als eine Zeile zur\u00FCckgegeben. Es sind nur aus einer Zeile bestehende ResultSets zul\u00E4ssig.
XSDAC.S=Es wurde versucht, Zeilen oder Seiten von einem Container in einen anderen zu verschieben.
