#Thu May 16 17:55:33 BRT 2013
XSTB2.M=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u043D\u0435\u0441\u0442\u0438 \u0432 \u0436\u0443\u0440\u043D\u0430\u043B \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0439; \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u043F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0435\u0442\u0441\u044F \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u0443\u044E \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F.
01J04=\u041A\u043B\u0430\u0441\u0441 ''{0}'' \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{1}'' \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 java.io.Serializable \u0438\u043B\u0438 java.sql.SQLData. \u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u043E\u0434\u0438\u043D \u0438\u0437 \u044D\u0442\u0438\u0445 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u043E\u0432, \u0447\u0442\u043E\u0431\u044B \u0438\u0445 \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u0442\u044C.
J111=\u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043F\u0430\u0440\u043E\u043B\u044C
XSDAC.S=\u041F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u043F\u0435\u0440\u0435\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u0441\u0442\u0440\u043E\u043A\u0438 \u0438\u043B\u0438 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B \u0438\u0437 \u043E\u0434\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 \u0432 \u0434\u0440\u0443\u0433\u043E\u0439.
4250D=\u041F\u043E\u0432\u0442\u043E\u0440\u044F\u044E\u0449\u0438\u0435\u0441\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438 ''{1}'' \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 ''{0}'';
XJ078.S=\u0421\u043C\u0435\u0449\u0435\u043D\u0438\u0435 ''{0}'' \u043B\u0438\u0431\u043E \u043C\u0435\u043D\u044C\u0448\u0435 \u043D\u0443\u043B\u044F, \u043B\u0438\u0431\u043E \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u0432\u0435\u043B\u0438\u043A\u043E \u0434\u043B\u044F \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E BLOB/CLOB.
J102=\u0421\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0435 \u0441\u0435\u0442\u0435\u0432\u043E\u0433\u043E \u0441\u0435\u0440\u0432\u0435\u0440\u0430. {0}
L010=\u0412 \u0444\u0430\u0439\u043B\u0435 {0} \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u043D\u0435\u043F\u043E\u043B\u043D\u0430\u044F \u0437\u0430\u043F\u0438\u0441\u044C \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043F\u0440\u0438 \u043E\u0447\u0438\u0441\u0442\u043A\u0435 \u0444\u0430\u0439\u043B\u0430 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0441 \u043F\u043E\u0437\u0438\u0446\u0438\u0438 {1} \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0444\u0430\u0439\u043B\u0430 \u0432 {2}.
D009=\u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0441\u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u043D \u0438\u0437 {0} \u0432 {1}
XJ096.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043D\u0430\u0439\u0442\u0438 \u043A\u043E\u043C\u043F\u043B\u0435\u043A\u0442 \u0440\u0435\u0441\u0443\u0440\u0441\u043E\u0432 \u0432 \u043F\u0430\u043A\u0435\u0442\u0435 {0} \u0434\u043B\u044F {1}
J021=\u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u044F \u0434\u043B\u044F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445
40XT1=\u0421\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u0438 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
L001=------------  \u041D\u0410\u0427\u0410\u041B\u041E \u0421\u041E\u041E\u0411\u0429\u0415\u041D\u0418\u042F \u041E\u0411 \u041E\u0428\u0418\u0411\u041A\u0415 -------------\n
J120=\u043D\u0435 \u0443\u043A\u0430\u0437\u0430\u043D\u043E
01J13=\u0427\u0438\u0441\u043B\u043E \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043D\u044B\u0445 \u0441\u0442\u0440\u043E\u043A ({0}) \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u0432\u0435\u043B\u0438\u043A\u043E, \u0447\u0442\u043E\u0431\u044B \u0443\u043C\u0435\u0441\u0442\u0438\u0442\u044C\u0441\u044F \u0432 \u0446\u0435\u043B\u043E\u0447\u0438\u0441\u043B\u0435\u043D\u043D\u043E\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0438; \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u0443\u0441\u0435\u0447\u0435\u043D\u043E.
X0X10.S=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F USING \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u043B\u0430 \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0438; \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u043E\u0441\u0442\u0440\u043E\u0447\u043D\u044B\u0435 \u043D\u0430\u0431\u043E\u0440\u044B \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432.
XJ069.S=\u041C\u0435\u0442\u043E\u0434\u044B SetXXX \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0432 \u0441\u043B\u0443\u0447\u0430\u0435 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F USING.
