#Thu May 16 17:55:33 BRT 2013
01J04=La clase ''{0}'' para la columna ''{1}'' no implementa java.io.Serializable o java.sql.SQLData. Las instancias deben implementar una de estas interfaces para permitir poder ser almacenadas.
XJ096.S=No se ha encontrado un paquete de recursos en el paquete {0} para {1}
4251C=La funci\u00F3n {0} no se puede otorgar a {1} porque crear\u00EDa una circularidad.
J120=no se ha especificado
L001=------------  PRINCIPIO DE MENSAJE DE ERROR -------------\n
XJ069.S=No se permiten m\u00E9todos SetXXX en el caso de USING execute statement.
J102=Se ha generado una excepci\u00F3n al iniciar el servidor de red. {0}
01J13=El n\u00FAmero de filas devueltas ({0}) es demasiado grande para caber en un entero; el valor devuelto se truncar\u00E1.
40XT1=Se ha generado una excepci\u00F3n al comprometer la transacci\u00F3n.
XJ087.S=La suma de la posici\u00F3n(''{0}'') y la longitud(''{1}'') es mayor que el tama\u00F1o del LOB m\u00E1s uno.
L010=Se ha detectado un registro de anotaci\u00F3n cronol\u00F3gica incompleto en el archivo {0}, borrando el archivo de anotaciones cronol\u00F3gicas desde la posici\u00F3n {1} hasta el fin de archivo en {2}.
J021=territorio de la base de datos
XSTB2.M=No se pueden anotar los cambios de transacci\u00F3n, es posible que est\u00E9 intentando grabar en una base de datos de s\u00F3lo lectura.
4250D=Usuario(s) ''{1}'' repetido(s) en lista de acceso ''{0}'';
J111=falta contrase\u00F1a
D009=se ha copiado el directorio de anotaci\u00F3n cronol\u00F3gica de {0} a {1}
J003={0}\: cerrando motor de Derby
XSDBB.D=Formato de p\u00E1gina desconocido en la p\u00E1gina {0}, tiene lugar un volcado de p\u00E1gina\: {1} 
XJ078.S=El desplazamiento ''{0}'' es inferior a cero o es demasiado grande para el BLOB/CLOB actual.
J030=ruta de acceso de copia de seguridad para restaurar base de datos a partir de copia de seguridad
42XAB=NOT NULL se permite solamente si se declara de forma expl\u00EDcita un tipo de datos.
X0X10.S=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila; solamente se permiten ResultSets de una sola fila.
XSDAC.S=Se intentan mover p\u00E1ginas o filas de un contenedor a otro.
