#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Violation du protocole XA
XJ088.S=Op\u00E9ration incorrecte \: m\u00E9thode wasNull() appel\u00E9e sans donn\u00E9es extraites.
01J05=La mise \u00E0 niveau de la base de donn\u00E9es a abouti. La base de donn\u00E9es mise \u00E0 niveau est d\u00E9sormais pr\u00EAte \u00E0 \u00EAtre utilis\u00E9e. Echec de la revalidation des instructions pr\u00E9par\u00E9es stock\u00E9es. Pour plus de d\u00E9tails sur cet \u00E9chec, reportez-vous \u00E0 l''exception suivante.
J121=L''utilisateur n''est pas autoris\u00E9 \u00E0 acc\u00E9der \u00E0 la base de donn\u00E9es
L002=----------  FIN MESSAGE D''ERREUR -------------\n
J013=mettre la base de donn\u00E9es \u00E0 niveau
XSTB3.M=Impossible d''abandonner la transaction parce que le gestionnaire des journaux est nul, probablement en raison d''une erreur ant\u00E9rieure.
M001=\n\# ********************************************************************\n\# ***                Veuillez ne PAS \u00E9diter ce fichier.                 ***\n\# *** LA MODIFICATION DE SON CONTENU PEUT ENTRAINER UNE ALTERATION DES DONNEES. ***\n\# ********************************************************************
J103=Une exception a \u00E9t\u00E9 \u00E9mise lors de l''arr\u00EAt du serveur de r\u00E9seau. {0}
0P000=Sp\u00E9cification de r\u00F4le non valide, le r\u00F4le n''existe pas \: ''{0}''.
01J14=L''autorisation SQL est utilis\u00E9e sans activation pr\u00E9alable de l''authentification.
40XT2=Une exception a \u00E9t\u00E9 \u00E9mise au cours de l''annulation d''un POINT DE SAUVEGARDE.
XSDBC.D=\u00C9chec de l''\u00E9criture des informations de conteneur sur la page 0 du conteneur {0}.  Pour en savoir plus, reportez-vous \u00E0 l''erreur imbriqu\u00E9e.
XJ079.S=La longueur ''{0}'' indiqu\u00E9e d\u00E9passe la taille du BLOB/CLOB.
J130=Une erreur de description FDOCA incorrecte a \u00E9t\u00E9 d\u00E9tect\u00E9e
X0X11.S=La clause USING n''a pas renvoy\u00E9 de r\u00E9sultats ; aucun param\u00E8tre ne peut \u00EAtre d\u00E9fini. 
L011=Le d\u00E9mon des points de contr\u00F4le a intercept\u00E9 une exception standard.
0P000.S.1=Sp\u00E9cification de r\u00F4le non valide, r\u00F4le non attribu\u00E9 \u00E0 l''utilisateur actuel ou PUBLIC \: ''{0}''.
J022=nom d''utilisateur
XSDAD.S=Tentative de d\u00E9placement de z\u00E9ro ligne d''une page vers une autre.
2200L=Les valeurs attribu\u00E9es aux colonnes XML doivent \u00EAtre des noeuds de type DOCUMENT syntaxiquement corrects.
XJ097.S=Impossible d''annuler ou d''\u00E9diter un point de sauvegarde qui n''a pas \u00E9t\u00E9 cr\u00E9\u00E9 par cette connexion.
4250E=Erreur interne \: ID {0} incorrect dans la liste d''autorisation des instructions.
J112=ID utilisateur absent
J004=identit\u00E9 de la base de donn\u00E9es
L020=AVERTISSEMENT \: La base de donn\u00E9es a \u00E9t\u00E9 initialis\u00E9e au moins une fois avec {0}\={1}. Lorsque ce mode est utilis\u00E9, il est possible que la base de donn\u00E9es ne puisse pas \u00EAtre restaur\u00E9e, que des transactions valid\u00E9es soient perdues et que la base de donn\u00E9es soit dans un \u00E9tat incoh\u00E9rent. Des erreurs inattendues peuvent se produire.\n
J031=interclassement pour les types de donn\u00E9es caract\u00E8res
X0X02.S=La table ''{0}'' ne peut pas \u00EAtre verrouill\u00E9e en mode ''{1}''.
42XAC=La valeur d'''INCREMENT BY'' ne peut pas \u00EAtre z\u00E9ro.
