#Thu May 16 17:55:33 BRT 2013
XSAX0.S=XA protokoll megs\u00E9rt\u00E9se
XJ088.S=\u00C9rv\u00E9nytelen m\u0171velet\: a wasNull() adatok lek\u00E9r\u00E9se n\u00E9lk\u00FCl ker\u00FCl megh\u00EDv\u00E1sra.
01J05=Az adatb\u00E1zis-friss\u00EDt\u00E9s sikeres volt. A friss\u00EDtett adatb\u00E1zis ezut\u00E1n k\u00E9szen \u00E1ll a haszn\u00E1latra. A t\u00E1rolt el\u0151k\u00E9sz\u00EDtett utas\u00EDt\u00E1sok \u00FAjb\u00F3li \u00E9rv\u00E9nyes\u00EDt\u00E9se meghi\u00FAsult. A hiba r\u00E9szletei\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt.
J121=a felhaszn\u00E1l\u00F3 nem jogosult az adatb\u00E1zis el\u00E9r\u00E9sre
L002=------------  HIBA\u00DCZENET V\u00C9GE -------------\n
J013=adatb\u00E1zis friss\u00EDt\u00E9se
XSTB3.M=A tranzakci\u00F3 nem szak\u00EDthat\u00F3 meg, val\u00F3sz\u00EDn\u0171leg a napl\u00F3kezel\u0151 egy kor\u00E1bbi hiba miatt null\u00E9rt\u00E9k\u0171.
M001=\n\# ********************************************************************\n\# ***                NE szerkessze ezt a f\u00E1jlt.                 ***\n\# *** A F\u00C1JL TARTALM\u00C1NAK M\u00D3DOS\u00CDT\u00C1SA ADATS\u00C9R\u00DCL\u00C9ST OKOZHAT. ***\n\# ********************************************************************
J103=A h\u00E1l\u00F3zati kiszolg\u00E1l\u00F3 le\u00E1ll\u00EDt\u00E1sa sor\u00E1n kiv\u00E9tel t\u00F6rt\u00E9nt. {0}
01J14=Az SQL felhatalmaz\u00E1s an\u00E9lk\u00FCl ker\u00FCl felhaszn\u00E1l\u00E1sra, hogy a hiteles\u00EDt\u00E9s el\u0151sz\u00F6r enged\u00E9lyezve lenne.
40XT2=Kiv\u00E9tel t\u00F6rt\u00E9nt egy SAVEPOINT visszag\u00F6rget\u00E9se sor\u00E1n.
XJ079.S=A(z) ''{0}'' megadott hossz t\u00FAll\u00E9pi a BLOB/CLOB m\u00E9ret\u00E9t.
J130=A PROTOCOL \u00E9rv\u00E9nytelen FDOCA le\u00EDr\u00E1shiba t\u00F6rt\u00E9nt
X0X11.S=A USING r\u00E9szkifejez\u00E9s nem ad vissza eredm\u00E9nyeket, \u00EDgy nem \u00E1ll\u00EDthat\u00F3k be param\u00E9terek. 
L011=Az ellen\u0151rz\u00E9si pont d\u00E9mon szabv\u00E1nyos kiv\u00E9telt fogott
J022=felhaszn\u00E1l\u00F3n\u00E9v
XSDAD.S=K\u00EDs\u00E9rlet nulla sor \u00E1thelyez\u00E9s\u00E9re egy oldalr\u00F3l egy m\u00E1sikra.
2200L=Az XML oszlopoknak szab\u00E1lyosan form\u00E1zott DOCUMENT csom\u00F3pontoknak kell lenni\u00FCk.
XJ097.S=A kapcsolat \u00E1ltal l\u00E9trehozott ment\u00E9si pont nem g\u00F6rgethet\u0151 vissza vagy szabad\u00EDthat\u00F3 fel.
4250E=Bels\u0151 hiba\: \u00E9rv\u00E9nytelen {0} azonos\u00EDt\u00F3 az utas\u00EDt\u00E1sjogosults\u00E1g-list\u00E1ban.
J112=hi\u00E1nyz\u00F3 felhaszn\u00E1l\u00F3i azonos\u00EDt\u00F3
J004=adatb\u00E1zis-azonoss\u00E1g
L020=FIGYELMEZTET\u00C9S\: Az adatb\u00E1zis legal\u00E1bb egyszer {0}\={1} \u00E9rt\u00E9kkel lett bet\u00F6ltve. A m\u00F3d haszn\u00E1lat\u00E1nak eredm\u00E9nyek\u00E9pp elk\u00E9pzelhet\u0151, hogy az adatb\u00E1zis nem helyre\u00E1ll\u00EDthat\u00F3, a v\u00E9gleges\u00EDtett tranzakci\u00F3s elveszhetnek \u00E9s az adatb\u00E1zis inkonzisztens \u00E1llapotban lehet. Ez v\u00E1ratlan hib\u00E1kat okozhat. \n
X0X02.S=A(z) ''{0}'' t\u00E1bla ''{1}'' m\u00F3dban nem z\u00E1rolhat\u00F3.
