#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Violaci\u00F3n de protocolo XA.
XJ088.S=Operaci\u00F3n no v\u00E1lida\: se ha llamado a wasNull() sin datos recuperados.
01J05=Actualizaci\u00F3n de base de datos correcta. La base de datos actualizada est\u00E1 preparada ahora para su uso. No se han podido revalidar las sentencias preparadas almacenadas. Consulte la excepci\u00F3n siguiente para obtener detalles sobre la anomal\u00EDa.
J121=el usuario no tiene autorizaci\u00F3n para acceder a la base de datos
L002=------------  FIN DE MENSAJE DE ERROR -------------\n
J013=actualizar base de datos
XSTB3.M=No se puede terminar anormalmente la transacci\u00F3n porque el gesto de anotaciones cronol\u00F3gicas es nulo, probablemente debido a un error anterior.
M001=\n\# ********************************************************************\n\# ***                NO edite este archivo.                 ***\n\# *** SI CAMBIA SU CONTENIDO PODR\u00CDA CAUSAR DA\u00D1OS EN LOS DATOS. ***\n\# ********************************************************************
J103=Se ha generado una excepci\u00F3n al cerrar el servidor de red. {0}
0P000=Especificaci\u00F3n de funci\u00F3n no v\u00E1lida, la funci\u00F3n no existe\: ''{0}''.
01J14=Se est\u00E1 utilizando la autorizaci\u00F3n de SQL sin habilitar primero la autenticaci\u00F3n.
40XT2=Se ha generado una excepci\u00F3n al retrotraer un SAVEPOINT.
XSDBC.D=La informaci\u00F3n de contenedor en la p\u00E1gina 0 del contenedor {0} no se ha podido escribir.  Para obtener m\u00E1s informaci\u00F3n, consulte el error anidado. 
XJ079.S=La longitud ''{0}'' especificada supera el tama\u00F1o del BLOB/CLOB.
J130=Se ha detectado un error de descripci\u00F3n de FDOCA no v\u00E1lido de PROTOCOL
X0X11.S=La cl\u00E1usula USING no ha devuelto ning\u00FAn resultado, por tanto no se pueden establecer par\u00E1metros. 
L011=El daemon de punto de control ha capturado una excepci\u00F3n est\u00E1ndar
0P000.S.1=Especificaci\u00F3n de funci\u00F3n no v\u00E1lida, no se ha garantizado la funci\u00F3n al usuario actual o P\u00DABLICO\: ''{0}''.
J022=nombre usuario
XSDAD.S=Se intentan mover cero filas de una p\u00E1gina a otra.
2200L=Los valores asignados a columnas XML deben tener nodos DOCUMENT formados correctamente.
XJ097.S=No se puede retrotraer o liberar un SAVEPOINT que no haya sido creado por esta conexi\u00F3n.
4250E=Error interno\: id {0} no v\u00E1lido en la lista de permisos de sentencia.
J112=falta id de usuario
J004=identidad de base de datos
L020=AVISO\: La base de datos se ha arrancado al menos una vez mediante {0}\={1}. Como resultado de esta modalidad utilizada, es posible que la base de datos no se pueda recuperar, las transacciones comprometidas se podr\u00EDan perder, y la base de datos podr\u00EDa estar en un estado no coherente. Esto podr\u00EDa originar errores inesperados.\n
J031=ordenaci\u00F3n para tipos de datos de caracteres
X0X02.S=La tabla ''{0}'' no se puede bloquear en modalidad ''{1}''.
42XAC=El valor ''INCREMENT BY'' no puede ser cero.
