#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Viola\u00E7\u00E3o do protocolo XA.
XJ088.S=Opera\u00E7\u00E3o inv\u00E1lida\: foi chamado wasNull() sem nenhum dado buscado.
01J05=Atualiza\u00E7\u00E3o do banco de dados bem-sucedida. O banco de dados atualizado est\u00E1 pronto para uso. A revalida\u00E7\u00E3o das instru\u00E7\u00F5es preparadas armazenadas falhou. Consulte a pr\u00F3xima exce\u00E7\u00E3o para obter detalhes sobre a falha.
J121=O usu\u00E1rio n\u00E3o est\u00E1 autorizado a acessar o banco de dados
L002=--------------------  FIM DA MENSAGEM DE ERRO ------------------------\n
J013=fazer upgrade do banco de dados
XSTB3.M=N\u00E3o \u00E9 poss\u00EDvel interromper a transa\u00E7\u00E3o porque o gerenciador de log \u00E9 nulo, provavelmente devido a um erro anterior.
M001=\n\# *****************************************************************************\n\# ***                N\u00C3O edite este arquivo.                                ***\n\# *** A ALTERA\u00C7\u00C3O DO CONTE\u00DADO DESSE ARQUIVO PODE CAUSAR CORRUP\u00C7\u00C3O DE DADOS. ***\n\# *****************************************************************************
J103=Foi lan\u00E7ada uma exce\u00E7\u00E3o durante o encerramento do servidor de rede. {0}
01J14=A autoriza\u00E7\u00E3o de SQL est\u00E1 sendo utilizada sem primeiro ativar a autentica\u00E7\u00E3o.
40XT2=Ocorreu uma exce\u00E7\u00E3o ao desfazer at\u00E9 um SAVEPOINT.
XJ079.S=O comprimento especificado ''{0}'' excede o tamanho do BLOB/CLOB.
J130=Foi detectado um erro ''PROTOCOL Invalid FDOCA Description''
X0X11.S=A cl\u00E1usula USING n\u00E3o retornou nenhum resultado, portanto n\u00E3o p\u00F4de ser definido nenhum par\u00E2metro.
L011=O ''daemon'' de ponto de controle (checkpoint) capturou uma exce\u00E7\u00E3o padr\u00E3o.
J022=nome do usu\u00E1rio
XSDAD.S=Tentativa de mover zero linhas de uma p\u00E1gina para outra.
2200L=Os valores designados \u00E0s colunas XML devem ser n\u00F3s DOCUMENT bem-formados.
XJ097.S=N\u00E3o \u00E9 poss\u00EDvel desfazer ou liberar um ponto de salvamento que n\u00E3o foi criado por esta conex\u00E3o.
4250E=Erro interno\: identificador inv\u00E1lido {0} na lista de permiss\u00E3o de instru\u00E7\u00E3o.
J112=faltando a identifica\u00E7\u00E3o do usu\u00E1rio
J004=identidade do banco de dados
L020=ADVERT\u00CANCIA\: O banco de dados estava pelo menos em uma inicializa\u00E7\u00E3o de tempo com {0}\={1}. Como resultado desse modo utilizado, \u00E9 poss\u00EDvel que o banco de dados n\u00E3o esteja apto a recuperar, as transa\u00E7\u00F5es confirmadas podem ser perdidas e o banco de dados pode estar inconsistente. Isto tamb\u00E9m pode causar erros inesperados.\n
X0X02.S=A tabela ''{0}'' n\u00E3o pode ser bloqueada no modo ''{1}''.
