#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Naruszenie protoko\u0142u XA.
XJ088.S=Niepoprawna operacja\: funkcja wasNull() zosta\u0142a wywo\u0142ana bez pobranych danych.
01J05=Aktualizacja bazy danych powiod\u0142a si\u0119. Zaktualizowana baza danych jest teraz gotowa do u\u017Cycia. Ponowne sprawdzanie poprawno\u015Bci sk\u0142adowanych, przygotowanych instrukcji nie powiod\u0142o si\u0119. Szczeg\u00F3\u0142y niepowodzenia zawiera nast\u0119pny wyj\u0105tek.
J121=u\u017Cytkownik nie ma uprawnie\u0144 dost\u0119pu do bazy danych
L002=------------  KONIEC KOMUNIKATU O B\u0141\u0118DZIE -------------\n
J013=zaktualizuj baz\u0119 danych
XSTB3.M=Nie mo\u017Cna przerwa\u0107 transakcji, poniewa\u017C mened\u017Cer rejestrowania ma warto\u015B\u0107 null, prawdopodobnie z powodu wcze\u015Bniejszego b\u0142\u0119du.
M001=\n\# ********************************************************************\n\# ***               Prosz\u0119 NIE edytowa\u0107 tego pliku.                 ***\n\# *** ZMIANA TRE\u015ACI TEGO PLIKU MO\u017BE SPOWODOWA\u0106 USZKODZENIE DANYCH. ***\n\# ********************************************************************
J103=Podczas zamykania serwera sieciowego zg\u0142oszony zosta\u0142 wyj\u0105tek. {0}
01J14=U\u017Cywana jest autoryzacja SQL bez wcze\u015Bniejszego w\u0142\u0105czenia uwierzytelniania.
40XT2=Podczas wycofywania punktu zapisu (SAVEPOINT) zosta\u0142 zg\u0142oszony wyj\u0105tek.
XJ079.S=Podana d\u0142ugo\u015B\u0107 ''{0}'' przekracza wielko\u015B\u0107 wzorca BLOB/CLOB.
J130=Wykryto b\u0142\u0105d opisu FDOCA niepoprawnej w\u0142a\u015Bciwo\u015Bci PROTOCOL
X0X11.S=Klauzula USING nie zwr\u00F3ci\u0142a \u017Cadnych wynik\u00F3w, tak wi\u0119c nie mo\u017Cna ustawi\u0107 \u017Cadnych parametr\u00F3w. 
L011=Demon punktu kontrolnego przechwyci\u0142 standardowy wyj\u0105tek
J022=nazwa u\u017Cytkownika
XSDAD.S=Pr\u00F3ba przeniesienia zero wierszy z jednej strony na inn\u0105.
2200L=Warto\u015Bci przypisane do kolumn XML musz\u0105 by\u0107 prawid\u0142owo sformu\u0142owanymi w\u0119z\u0142ami typu DOCUMENT.
XJ097.S=Nie mo\u017Cna wycofa\u0107 lub zwolni\u0107 punktu zapisu, kt\u00F3ry nie zosta\u0142 utworzony przez to po\u0142\u0105czenie.
4250E=B\u0142\u0105d wewn\u0119trzny\: niepoprawny identyfikator {0} na li\u015Bcie uprawnie\u0144 instrukcji.
J112=brak identyfikatora u\u017Cytkownika
J004=to\u017Csamo\u015B\u0107 bazy danych
L020=OSTRZE\u017BENIE\: Baza danych przynajmniej jeden raz by\u0142a uruchamiania w trybie {0}\={1}. Wynikiem u\u017Cycia tego trybu mo\u017Ce by\u0107 brak mo\u017Cliwo\u015Bci odzyskania bazy danych, utrata zatwierdzonych transakcji lub baza danych mo\u017Ce znale\u017A\u0107 si\u0119 w stanie niesp\u00F3jnym. Mo\u017Ce to spowodowa\u0107 nieoczekiwane b\u0142\u0119dy.\n
X0X02.S=Tabela ''{0}'' nie mo\u017Ce by\u0107 zablokowana w trybie ''{1}''.
