#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Fehlerhaftes XA-Protokoll.
XJ088.S=Ung\u00FCltige Operation\: wasNull() wurde ohne abgerufene Daten aufgerufen.
01J05=Das Upgrade f\u00FCr die Datenbank wurde fehlerfrei durchgef\u00FChrt. Die erweiterte Datenbank steht zur Verwendung bereit. Die gespeicherten vorbereiteten Anweisungen konnten nicht erneut ausgewertet werden. Details zu diesem Fehler enth\u00E4lt die n\u00E4chste Ausnahme.
J121=Der Benutzer ist nicht berechtigt, auf die Datenbank zuzugreifen.
L002=------------  ENDE DER FEHLERNACHRICHT -------------\n
J013=Datenbank erweitern
XSTB3.M=Die Transaktion kann nicht abgebrochen werden, weil der Protokollmanager - wahrscheinlich aufgrund eines fr\u00FCheren Fehlers - nicht angegeben ist.
M001=\n\# ********************************************************************\n\# ***                Diese Datei darf NICHT bearbeitet werden.                 ***\n\# *** BEIM \u00C4NDERN DES DATEIINHALTS K\u00D6NNEN DATEN BESCH\u00C4DIGT WERDEN. ***\n\# ********************************************************************
J103=Beim Herunterfahren des Netzservers wurde eine Ausnahme ausgel\u00F6st. {0}
0P000=Ung\u00FCltige Rollenspezifikation, Rolle existiert nicht\: ''{0}''.
01J14=Die SQL-Autorisierung wird verwendet, ohne dass zuvor die Authentifizierung aktiviert wurde.
40XT2=Beim Zur\u00FCcksetzen eines Sicherungspunktes wurde eine Ausnahme ausgel\u00F6st.
XSDBC.D=Das Schreiben von Container-Informationen auf Seite 0 von Container {0} ist fehlgeschlagen.  Weitere Informationen finden Sie im verschachtelten Fehler.  
XJ079.S=Die angegebene L\u00E4nge ''{0}'' \u00FCberschreitet die Gr\u00F6\u00DFe des BLOB/CLOB.
J130=Es wurde ein Fehler wegen einer ung\u00FCltigen FDOCA-Beschreibung festgestellt.
X0X11.S=Die USING-Klausel hat keine Ergebnisse geliefert. Es k\u00F6nnen keine Parameter gesetzt werden. 
L011=Der Pr\u00FCfpunktd\u00E4mon hat eine Standardausnahme abgefangen.
0P000.S.1=Ung\u00FCltige Rollenspezifikation, Rolle wurde weder aktuellem Benutzer noch PUBLIC zugewiesen\: ''{0}''.
J022=Benutzername
XSDAD.S=Es wurde versucht, Nullzeilen von einer Seite auf eine andere zu verschieben.
2200L=XML-Spalten zugeordnete Werte m\u00FCssen korrekt formatierte DOCUMENT-Knoten sein.
XJ097.S=Ein Sicherungspunkt, der nicht von dieser Verbindung erstellt wurde, kann nicht zur\u00FCckgesetzt oder freigegeben werden.
4250E=Interner Fehler\: Ung\u00FCltige ID {0} in der Liste der Anweisungsberechtigungen.
J112=Die Benutzer-ID fehlt
J004=Datenbankidentit\u00E4t
L020=WARNUNG\: Die Datenbank wurde mindestens einmal mit {0}\={1} gebootet. Durch die Verwendung dieses Modus kann die Datenbank m\u00F6glicherweise nicht wiederhergestellt werden. Festgeschriebene Transaktionen k\u00F6nnen verloren gegangen sein. Es ist m\u00F6glich, dass die Datenbank einen inkonsistenten Status hat. Dies kann zu unerwarteten Fehlern f\u00FChren.\n
J031=Kollation f\u00FCr Zeichen-Datentypen
X0X02.S=Die Tabelle ''{0}'' kann nicht im Modus ''{1}'' gesperrt werden.
42XAC=Der ''INCREMENT BY''-Wert kann nicht null sein.
