#Thu May 16 17:55:33 BRT 2013
XSAX0.S=Naru\u0161en\u00ED protokolu XA.
XJ088.S=Neplatn\u00E1 operace\: bylo vol\u00E1no wasNull() bez na\u010Dten\u00FDch dat.
01J05=Upgrade datab\u00E1ze byl \u00FAsp\u011B\u0161n\u00FD. Upgradovan\u00E1 datab\u00E1ze je nyn\u00ED p\u0159ipravena k pou\u017Eit\u00ED. Do\u0161lo k selh\u00E1n\u00ED op\u011Btovn\u00E9ho ov\u011B\u0159en\u00ED ulo\u017Een\u00FDch p\u0159ipraven\u00FDch p\u0159\u00EDkaz\u016F. Podrobnosti o selh\u00E1n\u00ED viz dal\u0161\u00ED v\u00FDjimka.
J121=u\u017Eivatel nen\u00ED autorizov\u00E1n pro p\u0159\u00EDstup k datab\u00E1zi
L002=------------  UKON\u010CIT CHYBOVOU ZPR\u00C1VU -------------\n
J013=p\u0159ej\u00EDt na vy\u0161\u0161\u00ED verzi datab\u00E1ze
XSTB3.M=Nelze p\u0159ed\u010Dasn\u011B ukon\u010Dit transakci, proto\u017Ee spr\u00E1vce protokolu m\u00E1 hodnotu ''null'', pravd\u011Bpodobn\u011B kv\u016Fli d\u0159\u00EDv\u011Bj\u0161\u00ED chyb\u011B.
M001=\n\# ****************************************************************\n\# ***                NEUPRAVUJTE tento soubor.                 ***\n\# *** ZM\u011ANA OBSAHU TOHOTO SOUBORU M\u016E\u017DE ZP\u016ESOBIT PO\u0160KOZEN\u00CD DAT. ***\n\# ****************************************************************
J103=Do\u0161lo k v\u00FDjimce b\u011Bhem vyp\u00EDn\u00E1n\u00ED s\u00ED\u0165ov\u00E9ho serveru. {0}
01J14=Pou\u017E\u00EDv\u00E1 se autorizace SQL, ani\u017E by nejprve byla aktivov\u00E1na.
40XT2=Do\u0161lo k v\u00FDjimce b\u011Bhem rolov\u00E1n\u00ED zp\u011Bt BODU ULO\u017DEN\u00CD.
XJ079.S=Uveden\u00E1 d\u00E9lka ''{0}'' p\u0159ekra\u010Duje velikost BLOB/CLOB.
J130=Byla detekov\u00E1na chyba neplatn\u00E9ho popisu FDOCA PROTOKOLU
X0X11.S=Klauzule USING nevr\u00E1tila \u017E\u00E1dn\u00E9 v\u00FDsledky, tak\u017Ee nelze nastavit \u017E\u00E1dn\u00E9 parametry. 
L011=D\u00E9mon kontroln\u00EDho bodu zachytil standardn\u00ED v\u00FDjimku
J022=jm\u00E9no u\u017Eivatele
XSDAD.S=Byl u\u010Din\u011Bn pokus o p\u0159esun nulov\u00FDch \u0159\u00E1dk\u016F z jedn\u00E9 str\u00E1nky do jin\u00E9.
2200L=Hodnoty p\u0159i\u0159azen\u00E9 sloupc\u016Fm XML musej\u00ED b\u00FDt dob\u0159e formovan\u00FDmi uzly DOCUMENT.
XJ097.S=Nelze rolovat zp\u011Bt nebo uvolnit bod ulo\u017Een\u00ED, kter\u00FD nebyl vytvo\u0159en t\u00EDmto spojen\u00EDm.
4250E=Vnit\u0159n\u00ED chyba\: neplatn\u00E9 ID {0} v seznamu povolen\u00ED p\u0159\u00EDkazu.
J112=chyb\u011Bj\u00EDc\u00ED ID u\u017Eivatele
J004=toto\u017Enost datab\u00E1ze
L020=VAROV\u00C1N\u00CD\: Datab\u00E1ze byla alespo\u0148 jedenkr\u00E1t zavedena s {0}\={1}. V d\u016Fsledku pou\u017Eit\u00ED tohoto re\u017Eimu je mo\u017En\u00E9, \u017Ee datab\u00E1ze se nebude moci zotavit, mohou b\u00FDt ztraceny potvrzen\u00E9 transakce a datab\u00E1ze m\u016F\u017Ee b\u00FDt v nekonzistentn\u00EDm stavu. Tato skute\u010Dnost m\u016F\u017Ee zp\u016Fsobit neo\u010Dek\u00E1van\u00E9 chyby.\n
X0X02.S=Tabulku ''{0}'' nelze uzamknout v re\u017Eimu ''{1}''.
