#Thu May 16 17:55:33 BRT 2013
XSAX0.S=XA \uD504\uB85C\uD1A0\uCF5C \uC704\uBC18.
XJ088.S=\uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uC870\uC791\: wasNull() \uD568\uC218\uB97C \uD638\uCD9C\uD558\uAE30 \uC704\uD574 \uAC80\uC0C9 \uB370\uC774\uD130\uAC00 \uD544\uC694\uD569\uB2C8\uB2E4.
01J05=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uC5C5\uADF8\uB808\uC774\uB4DC\uC5D0 \uC131\uACF5\uD588\uC2B5\uB2C8\uB2E4. \uC5C5\uADF8\uB808\uC774\uB4DC\uB41C \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB294 \uC774\uC81C \uC0AC\uC6A9\uD560 \uC900\uBE44\uAC00 \uB418\uC5C8\uC2B5\uB2C8\uB2E4. \uC800\uC7A5\uB41C \uC900\uBE44 \uBA85\uB839\uBB38\uC758 \uC7AC\uAC80\uC99D\uC774 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4. \uC2E4\uD328\uC5D0 \uB300\uD55C \uC138\uBD80\uC0AC\uD56D\uC740 \uB2E4\uC74C\uC758 \uC608\uC678\uB97C \uCC38\uC870\uD558\uC2ED\uC2DC\uC624.
J121=\uC0AC\uC6A9\uC790\uB294 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0 \uC561\uC138\uC2A4\uD560 \uC218 \uC788\uB294 \uAD8C\uD55C\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
L002=------------  \uC624\uB958 \uBA54\uC2DC\uC9C0 \uC885\uB8CC -------------\n
J013=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uC5C5\uADF8\uB808\uC774\uB4DC
XSTB3.M=\uB85C\uADF8 \uAD00\uB9AC\uC790\uAC00 \uB110\uC774\uAE30 \uB54C\uBB38\uC5D0 \uD2B8\uB79C\uC7AD\uC158\uC744 \uC911\uB2E8\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uC774\uC804 \uC624\uB958\uB85C \uC778\uD55C \uAC83\uC77C \uC218 \uC788\uC2B5\uB2C8\uB2E4.
M001=\n\# ********************************************************************\n\# ***                \uC774 \uD30C\uC77C\uC744 \uD3B8\uC9D1\uD558\uC9C0 \uB9C8\uC2ED\uC2DC\uC624.                 ***\n\# *** \uC774 \uD30C\uC77C\uC758 \uB0B4\uC6A9\uC744 \uBCC0\uACBD\uD558\uBA74 \uB370\uC774\uD130\uAC00 \uC190\uC0C1\uB420 \uC218 \uC788\uC2B5\uB2C8\uB2E4. ***\n\# ********************************************************************
J103=\uB124\uD2B8\uC6CC\uD06C \uC11C\uBC84 \uC885\uB8CC \uC911\uC5D0 \uC608\uC678\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. {0}
0P000=\uC798\uBABB\uB41C \uC5ED\uD560 \uC9C0\uC815\uC785\uB2C8\uB2E4. \uC5ED\uD560\uC774 \uC874\uC7AC\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. ''{0}''.
01J14=\uC778\uC99D\uC744 \uBA3C\uC800 \uD65C\uC131\uD654\uD558\uC9C0 \uC54A\uACE0 SQL \uC778\uC99D\uC744 \uC0AC\uC6A9\uD569\uB2C8\uB2E4.
40XT2=SAVEPOINT\uC758 \uB864\uBC31 \uC911\uC5D0 \uC608\uC678\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
XSDBC.D={0} \uCEE8\uD14C\uC774\uB108\uC758 0\uD398\uC774\uC9C0\uC5D0 \uCEE8\uD14C\uC774\uB108 \uC815\uBCF4\uB97C \uC4F0\uC9C0 \uBABB\uD588\uC2B5\uB2C8\uB2E4. \uC790\uC138\uD55C \uB0B4\uC6A9\uC740 \uD3EC\uD568\uB41C \uC624\uB958\uB97C \uCC38\uC870\uD558\uC2ED\uC2DC\uC624.
XJ079.S=\uC9C0\uC815\uB41C \uAE38\uC774 ''{0}''\uC774(\uAC00) BLOB/CLOB\uC758 \uD06C\uAE30\uB97C \uCD08\uACFC\uD588\uC2B5\uB2C8\uB2E4.
J130=\uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 FDOCA \uC124\uBA85 \uC624\uB958\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
X0X11.S=USING\uC808\uC774 \uACB0\uACFC\uB97C \uB9AC\uD134\uD558\uC9C0 \uC54A\uC558\uC73C\uBBC0\uB85C \uB9E4\uAC1C\uBCC0\uC218\uB97C \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. 
L011=\uCCB4\uD06C\uD3EC\uC778\uD2B8 \uB514\uBA3C\uC774 \uD45C\uC900 \uC608\uC678\uB97C \uD3EC\uCC29\uD588\uC2B5\uB2C8\uB2E4.
0P000.S.1=\uC798\uBABB\uB41C \uC5ED\uD560 \uC9C0\uC815\uC785\uB2C8\uB2E4. \uD604\uC7AC \uC0AC\uC6A9\uC790 \uB610\uB294 PUBLIC\uC5D0 \uC5ED\uD560\uC774 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. ''{0}''.
J022=\uC0AC\uC6A9\uC790 \uC774\uB984
XSDAD.S=\uD55C \uD398\uC774\uC9C0\uC5D0\uC11C \uB2E4\uB978 \uD398\uC774\uC9C0\uB85C 0\uD589 \uC774\uB3D9 \uC2DC\uB3C4.
2200L=XML \uC5F4\uC5D0 \uC9C0\uC815\uB41C \uAC12\uC740 \uC798 \uAD6C\uC131\uB41C DOCUMENT \uB178\uB4DC\uC5EC\uC57C \uD569\uB2C8\uB2E4.
XJ097.S=\uC774 \uC5F0\uACB0\uC5D0 \uC758\uD574 \uB9CC\uB4E4\uC5B4\uC9C0\uC9C0 \uC54A\uC740 \uC138\uC774\uBE0C\uD3EC\uC778\uD2B8\uB97C \uB864\uBC31 \uB610\uB294 \uB9B4\uB9AC\uC2A4\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
4250E=\uB0B4\uBD80 \uC624\uB958\: \uBA85\uB839\uBB38 \uC0AC\uC6A9 \uAD8C\uD55C \uBAA9\uB85D\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 {0} ID\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
J112=\uC0AC\uC6A9\uC790 ID \uB204\uB77D
J004=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 ID
L020=\uACBD\uACE0\: \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 {0}\={1}(\uC73C)\uB85C \uCD5C\uC18C\uD55C \uD55C \uBC88\uC5D0 \uBD80\uD305\uB418\uC5C8\uC2B5\uB2C8\uB2E4. \uC774 \uBAA8\uB4DC\uB97C \uC0AC\uC6A9\uD558\uBA74 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uBCF5\uAD6C\uB418\uC9C0 \uC54A\uC744 \uC218 \uC788\uC73C\uBA70, \uD655\uC57D\uB41C \uD2B8\uB79C\uC7AD\uC158\uC774 \uC720\uC2E4\uB420 \uC218 \uC788\uC73C\uBA70, \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uBD88\uC77C\uCE58 \uC0C1\uD0DC\uC5D0 \uC788\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC774\uB85C \uC778\uD574 \uC608\uAE30\uCE58 \uC54A\uC740 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.\n
J031=\uBB38\uC790 \uB370\uC774\uD130 \uC720\uD615\uC758 \uCF5C\uB808\uC774\uC158
X0X02.S=''{0}'' \uD14C\uC774\uBE14\uC744 ''{1}'' \uBAA8\uB4DC\uB85C \uC7A0\uAE00 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42XAC=''INCREMENT BY'' \uAC12\uC740 0\uC77C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
