#Thu May 16 17:55:33 BRT 2013
J113=ID \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0438\u043B\u0438 \u043F\u0430\u0440\u043E\u043B\u044C - \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0435
01J06=\u041D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u043D\u0435 \u043F\u043E\u0434\u043B\u0435\u0436\u0438\u0442 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E. \u0417\u0430\u043F\u0440\u043E\u0441 \u043D\u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u0435\u0442 \u043A\u0440\u0438\u0442\u0435\u0440\u0438\u044F\u043C \u0434\u043B\u044F \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043D\u0430\u0431\u043E\u0440\u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet), \u043F\u043E\u0434\u043B\u0435\u0436\u0430\u0449\u0435\u0433\u043E \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E.
L021=\u041F\u0420\u0415\u0414\u0423\u041F\u0420\u0415\u0416\u0414\u0415\u041D\u0418\u0415\: \u0411\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043B\u0438\u0431\u043E \u0437\u0430\u0433\u0440\u0443\u0436\u0430\u043B\u0430\u0441\u044C \u0440\u0430\u043D\u0435\u0435 \u043B\u0438\u0431\u043E \u0437\u0430\u0433\u0440\u0443\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F {1}, \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0434\u043B\u044F {0}. \u0423\u0447\u0442\u0438\u0442\u0435, \u0447\u0442\u043E \u044D\u0442\u043E\u0442 \u0440\u0435\u0436\u0438\u043C ({0}\={1}) \u043D\u0435 \u0433\u0430\u0440\u0430\u043D\u0442\u0438\u0440\u0443\u0435\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u0438, \u0432\u0435\u0440\u043E\u044F\u0442\u043D\u043E, \u0438\u043C\u0435\u043D\u043D\u043E \u044D\u0442\u043E \u0438 \u0432\u044B\u0437\u0432\u0430\u043B\u043E \u0434\u0430\u043D\u043D\u0443\u044E \u043E\u0448\u0438\u0431\u043A\u0443 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438.\n
J005=\u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443 Derby
J104=\u041E\u0431\u044A\u0435\u043A\u0442 \u0443\u0436\u0435 \u0437\u0430\u043A\u0440\u044B\u0442.
L012=\u0437\u0430\u043F\u0438\u0441\u044C \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0435\u0440\u0432\u043E\u0439, \u043D\u043E \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438 \u043D\u0435\u0442 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0439\: {0}
J023=\u043F\u0430\u0440\u043E\u043B\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
XSAX1.S=\u041F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0433\u043B\u043E\u0431\u0430\u043B\u044C\u043D\u0443\u044E \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044E \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C Xid \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0439 \u0433\u043B\u043E\u0431\u0430\u043B\u044C\u043D\u043E\u0439 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
L003=\n-----------  \u041D\u0410\u0427\u0410\u041B\u041E \u0421\u0422\u0415\u041A\u0410 \u041E\u0428\u0418\u0411\u041A\u0418 \u0417\u0410\u0412\u0415\u0420\u0428\u0415\u041D\u0418\u042F \u0420\u0410\u0411\u041E\u0422\u042B ------------\n
XSDAE.S=\u041C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0445\u044D\u043D\u0434\u043B \u0437\u0430\u043F\u0438\u0441\u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F ID \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0445\u044D\u043D\u0434\u043B\u0430 \u0437\u0430\u043F\u0438\u0441\u0438.
I024=\u0411\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0430
J122=\u043A\u043E\u043C\u0430\u043D\u0434\u0430, \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u0432\u0448\u0430\u044F \u0441\u043B\u0443\u0436\u0431\u044B \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445, \u0431\u044B\u043B\u0430 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0430 \u0434\u043E \u043A\u043E\u043C\u0430\u043D\u0434\u044B, \u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u0432\u0448\u0435\u0439 \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 (ACCRDB)
X0X03.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0435 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438 - \u0434\u043B\u044F \u0443\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u043E\u0433\u043E \u043A\u0443\u0440\u0441\u043E\u0440\u0430 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u0442\u043E\u0442 \u0436\u0435 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u0438\u0437\u043E\u043B\u044F\u0446\u0438\u0438
XJ098.S=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0445 \u043A\u043B\u044E\u0447\u0435\u0439 {0} \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u043C
XSAS6.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0440\u0435\u0441\u0443\u0440\u0441\u044B \u0434\u043B\u044F \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438.
2200M=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442 XML\: {0}
