#Thu May 16 17:55:33 BRT 2013
01J07=L''objet ResultSetHoldability est limit\u00E9 \u00E0 ResultSet.CLOSE_CURSORS_AT_COMMIT dans le cadre d''une transaction globale.
J123=la commande requise a rencontr\u00E9 une condition non structur\u00E9e sp\u00E9cifique \u00E0 l''impl\u00E9mentation pour laquelle aucun message structur\u00E9 n''existe (des informations suppl\u00E9mentaires sont peut-\u00EAtre disponibles dans le fichier derby.log enregistr\u00E9 sur le serveur)
L004=\n------------  FIN PILE D''ERREURS D''ARRET -----------\n
428C1=Seule une colonne d''identit\u00E9 est admise dans une table.
I025=Pilote JDBC non disponible
J105=La pr\u00E9cision d\u00E9passe 31 chiffres \!
XSTB5.M=Un incident inattendu s''est produit lors la cr\u00E9ation d''une base de donn\u00E9es pour laquelle la journalisation est d\u00E9sactiv\u00E9e.
40XT4=Une tentative de fermeture d''une transaction toujours active a \u00E9t\u00E9 effectu\u00E9e. La transaction a \u00E9t\u00E9 abandonn\u00E9e.
J132=Le nom d''utilisateur pour la connexion
L013=l''enregistrement de journal est premier, mais la transaction est d\u00E9j\u00E0 dans la table de transaction \: {0}
XBCXA.S=Mot de passe d''amor\u00E7age incorrect.
X0X13.S=Le fichier Jar ''{0}'' n''existe pas dans le sch\u00E9ma ''{1}''.
XSDAF.S=Utilisation d''un descripteur d''enregistrement sp\u00E9cial comme s''il s''agissait d''un descripteur d''enregistrement ordinaire.
J114=ID utilisateur r\u00E9voqu\u00E9
XJ099.S=L''objet Reader/Stream ne contient pas de caract\u00E8re de longueur
J006=Annulation de l''enregistrement d''AutoloadedDriver
L022=AVERTISSEMENT\u00A0\: en raison d''un probl\u00E8me de droits d''acc\u00E8s aux fichiers journaux, la base de donn\u00E9es est pass\u00E9e \u00E0 l''\u00E9tat de lecture seule. \n               
42XAE=La valeur ''{0}'' est hors plage pour le type de donn\u00E9es ''{1}''. Elle doit \u00EAtre comprise entre ''{2}'' et ''{3}''.
X0Y30.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}'' car ROUTINE ''{2}'' d\u00E9pend de cet objet.
