#Thu May 16 17:55:33 BRT 2013
J114=ID \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0430\u043D\u043D\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u043D
01J07=\u0414\u043B\u044F \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 ResultSetHoldability \u0443\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 ResultSet.CLOSE_CURSORS_AT_COMMIT \u0434\u043B\u044F \u0433\u043B\u043E\u0431\u0430\u043B\u044C\u043D\u043E\u0439 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
XJ099.S=\u041E\u0431\u044A\u0435\u043A\u0442 Reader/Stream \u043D\u0435 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0434\u043B\u0438\u043D\u044B
428C1=\u0412 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u0438\u043D \u0441\u0442\u043E\u043B\u0431\u0435\u0446 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430.
J105=\u0422\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 31 \u0440\u0430\u0437\u0440\u044F\u0434\!
L013=\u0437\u0430\u043F\u0438\u0441\u044C \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0435\u0440\u0432\u043E\u0439, \u043D\u043E \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044F \u0443\u0436\u0435 \u0435\u0441\u0442\u044C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0439\: {0}
J132=\u0418\u043C\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0434\u043B\u044F \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F
X0X13.S=\u0424\u0430\u0439\u043B Jar ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u0441\u0445\u0435\u043C\u0435 ''{1}''.
40XT4=\u041F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u0435\u0449\u0435 \u0430\u043A\u0442\u0438\u0432\u043D\u0443\u044E \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044E. \u0422\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044F \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u0430.
L004=\n-----------  \u041A\u041E\u041D\u0415\u0426 \u0421\u0422\u0415\u041A\u0410 \u041E\u0428\u0418\u0411\u041A\u0418 \u0417\u0410\u0412\u0415\u0420\u0428\u0415\u041D\u0418\u042F \u0420\u0410\u0411\u041E\u0422\u042B -------------\n
I025=\u0414\u0440\u0430\u0439\u0432\u0435\u0440 JDBC \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u0435\u043D
XBCXA.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u043F\u0430\u0440\u043E\u043B\u044C \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438.
J123=\u0437\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u043A\u043E\u043C\u0430\u043D\u0434\u0430 \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043E\u043C \u043B\u0438\u0431\u043E \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0438\u043B\u0430 \u0441\u0432\u044F\u0437\u0430\u043D\u043D\u043E\u0435 \u0441 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0435\u0439 \u0443\u0441\u043B\u043E\u0432\u0438\u0435, \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043D\u0435\u0442 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F, \u0441\u0432\u044F\u0437\u0430\u043D\u043D\u043E\u0433\u043E \u0441 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0435\u0439
XSTB5.M=\u041F\u0440\u0438 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0438 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0441 \u043E\u0442\u043A\u043B\u044E\u0447\u0435\u043D\u043D\u044B\u043C \u0436\u0443\u0440\u043D\u0430\u043B\u043E\u043C \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430.
XSDAF.S=\u0421\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u044B\u0439 \u0445\u044D\u043D\u0434\u043B \u0437\u0430\u043F\u0438\u0441\u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0442\u0430\u043A, \u043A\u0430\u043A \u0431\u0443\u0434\u0442\u043E \u043E\u043D \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u044B\u0447\u043D\u044B\u043C \u0445\u044D\u043D\u0434\u043B\u043E\u043C \u0437\u0430\u043F\u0438\u0441\u0438.
