#Thu May 16 17:55:33 BRT 2013
L007=AVERTISSEMENT \: Fichier journal introuvable, cr\u00E9ation d''un nouveau fichier journal. Possibilit\u00E9 d''incoh\u00E9rences dans la base de donn\u00E9es.
J018=longueur de la cl\u00E9 de cryptographie
R001=----  MESSAGE D''ERREUR DEBUT DE REPLICATION ({0}) ----
X0Y42.S=La contrainte ''{0}'' n''est pas valide \: les types des colonnes de cl\u00E9s externes ne correspondent pas aux types des colonnes r\u00E9f\u00E9renc\u00E9es.
XSLAA.D=Une exception ant\u00E9rieure a marqu\u00E9 le stockage comme devant \u00EAtre arr\u00EAt\u00E9.
XBCXD.S=L''algorithme de chiffrement ne peut pas \u00EAtre modifi\u00E9 une fois que la base de donn\u00E9es est cr\u00E9\u00E9e.
X0X61.S=Les valeurs pour la colonne ''{4}'' dans l''index ''{0}'' et la table ''{1}.{2}'' ne correspondent pas \u00E0 l''emplacement de ligne {3}.  La valeur dans l''index est ''{5}'', tandis que la valeur dans la table de base est ''{6}''.  La cl\u00E9 d''index compl\u00E8te, qui comprend l''emplacement de ligne est ''{7}''.  L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
I028=Erreur de lecture de flux c\u00F4t\u00E9 client lors du transfert de donn\u00E9es utilisateur sur le serveur.
J108=Le gestionnaire de s\u00E9curit\u00E9 n''autorise pas l''acc\u00E8s \u00E0 la propri\u00E9t\u00E9 syst\u00E8me {0}.
XSDFD.S=Diff\u00E9rentes lectures d''image de page lors de 2 E/S \u00E0 la page {0} ; la premi\u00E8re image pr\u00E9sente un total de contr\u00F4le incorrect, la deuxi\u00E8me image pr\u00E9sente un total de contr\u00F4le correct. Les images de page sont les suivantes \: {1} {2}
XSDAI.S=La page {0} en cours de suppression est d\u00E9j\u00E0 verrouill\u00E9e pour une suppression d''affectation.
40XT7=Op\u00E9ration non prise en charge dans une transaction interne.
46J01=La signature de m\u00E9thode Java a un format non valide.
J135=La transaction XA a expir\u00E9 et sera annul\u00E9e. La transaction Xid est {0}.
L016=impossible de cr\u00E9er de nouveau fichier journal {0}
XSAJC.U=Nombre d''ex\u00E9cutions de fusion
R010=Le ma\u00EEtre de r\u00E9plication essaie de se reconnecter \u00E0 l''esclave pour la base de donn\u00E9es ''{0}''.
J117=SECTKN absent sur ACCSEC lorsqu''il est requis, ou incorrect
X0X07.S=Impossible de supprimer le fichier jar ''{0}'' car il se trouve sur votre derby.database.classpath ''{0}''.
42XAH=Une expression NEXT VALUE FOR risque de ne pas s''afficher dans divers contextes, notamment dans les clauses WHERE, ON, HAVING, ORDER BY, DISTINCT, CASE, GENERATION et AGGREGATE, ainsi que dans les fonctions WINDOW et les contraintes CHECK.
XIE01.S=La connexion \u00E9tait nulle.
X0Y24.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}''car STATEMENT ''{2}'' d\u00E9pend de cet objet.
J126=Une erreur de protocole de conversation a \u00E9t\u00E9 d\u00E9tect\u00E9e.  Motif \: 0x{0}.
