#Thu May 16 17:55:33 BRT 2013
L007=ADVERT\u00CANCIA\: O arquivo de log n\u00E3o foi encontrado, criando novo log. Possibilidade de inconsist\u00EAncia no banco de dados.
J018=comprimento de chave criptografada
XSLAA.D=O armazenamento foi marcado para ser encerrado por uma exce\u00E7\u00E3o anterior.
X0Y42.S=A restri\u00E7\u00E3o ''{0}'' n\u00E3o \u00E9 v\u00E1lida\: os tipos de colunas da chave estrangeira n\u00E3o correspondem aos tipos das colunas referenciadas.
XBCXD.S=O algoritmo da criptografia n\u00E3o pode ser alterado ap\u00F3s a cria\u00E7\u00E3o do banco de dados.
X0X61.S=Os valores para a coluna ''{4}'' no \u00EDndice ''{0}'' da tabela ''{1}.{2}'' n\u00E3o correspondem ao local da linha {3}.  O valor no \u00EDndice \u00E9 ''{5}'', enquanto o valor na tabela base \u00E9 ''{6}''.  A chave completa do \u00EDndice, incluindo o local da linha, \u00E9 ''{7}''.  A a\u00E7\u00E3o de corre\u00E7\u00E3o sugerida \u00E9 a recria\u00E7\u00E3o do \u00EDndice.
J108=O gerenciador de seguran\u00E7a n\u00E3o permite acesso \u00E0 propriedade do sistema {0}.
XSDFD.S=Imagem diferente de p\u00E1gina lida em 2 E/S na P\u00E1gina {0}, a primeira imagem possui checksum incorreto, a segunda imagem possui checksum correto. A seguir, as imagens das p\u00E1ginas\: {1} {2}
XSDAI.S=A p\u00E1gina {0} sendo removida j\u00E1 est\u00E1 bloqueada para libera\u00E7\u00E3o.
40XT7=Opera\u00E7\u00E3o n\u00E3o suportada em uma transa\u00E7\u00E3o interna.
46J01=A assinatura do m\u00E9todo Java possui um formato inv\u00E1lido.
L016=N\u00E3o foi poss\u00EDvel criar o novo arquivo de log {0}
XSAJC.U=N\u00FAmero de execu\u00E7\u00F5es mescladas
J117=Faltando SECTKN em ACCSEC quando foi requerido, ou \u00E9 inv\u00E1lido
X0X07.S=N\u00E3o \u00E9 poss\u00EDvel remover o arquivo jar ''{0}'', porque este est\u00E1 em derby.database.classpath ''{0}''.
XIE01.S=A conex\u00E3o era nula.
X0Y24.S=A opera\u00E7\u00E3o ''{0}'' n\u00E3o p\u00F4de ser efetuada no objeto ''{1}'', porque a declara\u00E7\u00E3o ''{2}'' \u00E9 dependente deste objeto.
J126=Foi detectado um erro de protocolo conversacional.  Motivo\: 0x{0}.
