#Thu May 16 17:55:33 BRT 2013
L008=\uD638\uD658\uB418\uC9C0 \uC54A\uB294 \uC624\uB798\uB41C Logfile {0} \uC0AD\uC81C \uC911
J019=\uC678\uBD80 \uC554\uD638\uD654 \uD0A4
R002=--------------------  \uBCF5\uC81C \uC624\uB958 \uBA54\uC2DC\uC9C0 \uB05D ---------------------
XBM01.D=\uC608\uC678\uB85C \uC778\uD574 \uC2DC\uC791\uD558\uB294 \uB370 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4. \uC138\uBD80\uC0AC\uD56D\uC740 \uB2E4\uC74C \uC608\uC678\uB97C \uCC38\uC870\uD558\uC2ED\uC2DC\uC624.
J109=\uC798\uBABB\uB41C TCP/IP \uD074\uB77C\uC774\uC5B8\uD2B8 \uAD6C\uC131\uC774 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4. \uB85C\uCEEC \uD638\uC2A4\uD2B8 ''{0}''\uC758 IP \uC8FC\uC18C\uB97C \uD310\uBCC4\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uD074\uB77C\uC774\uC5B8\uD2B8 \uC2DC\uC2A4\uD15C\uC758 IP \uC8FC\uC18C\uAC00 \uC62C\uBC14\uB974\uAC8C \uAD6C\uC131\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
46J02=Java \uBA54\uC18C\uB4DC \uC11C\uBA85\uC5D0 \uC798\uBABB\uB41C \uB9E4\uAC1C\uBCC0\uC218 \uC218({0})\uAC00 \uC788\uC2B5\uB2C8\uB2E4. \uC608\uC0C1\uB41C \uC218\uB294 {1}\uC785\uB2C8\uB2E4.
J136=\uB2EB\uACE0 \uC788\uB294 \uC5F0\uACB0\uACFC \uAD00\uB828\uB41C XA \uD2B8\uB79C\uC7AD\uC158\uC774 \uC788\uC2B5\uB2C8\uB2E4. \uD2B8\uB79C\uC7AD\uC158\uC774 \uB864\uBC31\uB429\uB2C8\uB2E4. \uD2B8\uB79C\uC7AD\uC158 Xid\uAC00 {0}\uC785\uB2C8\uB2E4.
XCL01.S=\uACB0\uACFC \uC138\uD2B8\uAC00 \uD589\uC744 \uB9AC\uD134\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. {0} \uC870\uC791\uC740 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. 
L017={1}(\uC73C)\uB85C \uC778\uD574 \uC0C8 \uB85C\uADF8 \uD30C\uC77C {0}\uC744(\uB97C) \uC791\uC131\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
J028=rollforward \uBCF5\uAD6C\uC758 \uBC31\uC5C5 \uACBD\uB85C
R011=\uBCF5\uC81C \uC2AC\uB808\uC774\uBE0C \uB370\uC774\uD130\uBCA0\uC774\uC2A4 ''{0}''\uC774(\uAC00) ''{1}\:{2}''\uC758 \uB9C8\uC2A4\uD130\uB85C\uBD80\uD130 \uC5F0\uACB0\uC744 \uC218\uC2E0\uD569\uB2C8\uB2E4.
X0Y70.S={0} \uD2B8\uB9AC\uAC70\uB294 \uD65C\uC131 \uC0C1\uD0DC\uC774\uAE30 \uB54C\uBB38\uC5D0 INSERT, UPDATE \uBC0F DELETE\uB294 \uD14C\uC774\uBE14 {1}\uC5D0\uC11C \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
X0Y25.S={2} ''{3}\uC774(\uAC00) \uD574\uB2F9 \uC624\uBE0C\uC81D\uD2B8\uC5D0 \uC885\uC18D\uB418\uC5B4 \uC788\uC73C\uBBC0\uB85C ''{0}'' \uC5F0\uC0B0\uC744 ''{1}'' \uC624\uBE0C\uC81D\uD2B8\uC5D0\uC11C \uC218\uD589\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
J118=\uC554\uD638\uAC00 \uB9CC\uB8CC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
X0Y43.S=''{0}'' \uC81C\uD55C\uC870\uAC74\uC774 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. {0}({1})\uC758 \uC5F4 \uC218\uAC00 \uCC38\uC870\uB41C \uD0A4({2})\uC758 \uC5F4 \uC218\uC640 \uC77C\uCE58\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
XSLAB.D=\uB85C\uADF8 \uD30C\uC77C {0}\uC744(\uB97C) \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uD50C\uB7AB\uD3FC\uC5D0 \uC62C\uBC14\uB978 \uACBD\uB85C \uBD84\uB9AC\uC790\uB97C \uC0AC\uC6A9\uD558\uC5EC logDevice \uB4F1\uB85D \uC815\uBCF4\uAC00 \uBC14\uB974\uAC8C \uC124\uC815\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
XBCXE.S=\uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uC791\uC131\uB41C \uD6C4\uC5D0 \uC554\uD638\uD654 \uC81C\uACF5\uC790\uB97C \uBCC0\uACBD\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
R020=''{0}'' \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uC5D0 \uB300\uD574 \uD398\uC77C\uC624\uBC84\uAC00 \uC131\uACF5\uC801\uC73C\uB85C \uC218\uD589\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
42XAI=\uBA85\uB839\uBB38\uC774 \uB2E4\uC74C \uC2DC\uD000\uC2A4\uB97C \uB450 \uBC88 \uC774\uC0C1 \uCC38\uC870\uD569\uB2C8\uB2E4. ''{0}''.
X0X62.S=''{0}'' \uD14C\uC774\uBE14\uACFC ''{1}'' \uC0C9\uC778 \uAC04\uC758 \uBD88\uC77C\uCE58\uB97C \uCC3E\uC558\uC2B5\uB2C8\uB2E4. \uD14C\uC774\uBE14\uC5D0\uC11C ''{2}'' \uD589 \uC704\uCE58\uB97C \uAC80\uC0C9\uD558\uB824\uB294 \uC911\uC5D0 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uD589 \uC704\uCE58\uB97C \uD3EC\uD568\uD55C \uC804\uCCB4 \uC0C9\uC778 \uD0A4\uB294 ''{3}''\uC785\uB2C8\uB2E4. \uC81C\uC548\uB41C \uC815\uC815 \uC870\uCE58\uB294 \uC0C9\uC778\uC744 \uC7AC\uC791\uC131\uD558\uB294 \uAC83\uC785\uB2C8\uB2E4.
XSDAJ.S=\uC5F0\uC18D \uAC00\uB2A5 \uB610\uB294 SQLData \uC624\uBE0C\uC81D\uD2B8\uC758 \uC4F0\uAE30 \uC911 \uC608\uC678
4287A=\uCFFC\uB9AC\uC5D0 DISTINCT\uAC00 \uC9C0\uC815\uB418\uBBC0\uB85C ORDER BY \uC808\uC774 \uD45C\uD604\uC2DD\uC744 \uC9C0\uC815\uD558\uC9C0 \uC54A\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
X0Y16.S=''{0}''\uC740(\uB294) \uBDF0\uAC00 \uC544\uB2D9\uB2C8\uB2E4. \uD14C\uC774\uBE14\uC778 \uACBD\uC6B0 \uB300\uC2E0 DROP TABLE\uC744 \uC0AC\uC6A9\uD558\uC2ED\uC2DC\uC624.
XCL10.S=PreparedStatement\uAC00 \uC7AC\uCEF4\uD30C\uC77C\uB418\uC5C8\uC73C\uBA70 \uB9E4\uAC1C\uBCC0\uC218\uAC00 \uBCC0\uACBD\uB418\uC5C8\uC2B5\uB2C8\uB2E4. JDBC\uB97C \uC0AC\uC6A9\uD560 \uACBD\uC6B0 \uBA85\uB839\uBB38\uC744 \uB2E4\uC2DC \uC900\uBE44\uD574\uC57C \uD569\uB2C8\uB2E4. 
XSAJD.U=\uBCD1\uD569 \uC2E4\uD589 \uD06C\uAE30
J127=parseSQLDIAGGRP\uAC00 \uC544\uC9C1 \uAD6C\uD604\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.
XJ04B.S=\uC77C\uAD04\uCC98\uB9AC\uC5D0\uB294 \uACB0\uACFC \uC138\uD2B8\uB97C \uB9AC\uD134\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uBA85\uB839\uC774 \uD3EC\uD568\uB420 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
