#Thu May 16 17:55:33 BRT 2013
L008=Suprimiendo Logfile antiguo incompatible {0}
J019=clave de cifrado externa
R002=--------------------  FIN DE MENSAJE DE ERROR DE REPETICI\u00D3N ---------------------
XBM01.D=Error de arranque debido a una excepci\u00F3n. Consulte la excepci\u00F3n siguiente para obtener detalles. 
J109=Se ha detectado una configuraci\u00F3n de cliente TCP/IP incorrecto.  No se puede determinar la direcci\u00F3n IP del sistema principal local\: ''{0}''.  Aseg\u00FArese de que la m\u00E1quina cliente tenga configurada correctamente la direcci\u00F3n IP.
46J02=La signatura del m\u00E9todo Java contiene un n\u00FAmero incorrecto ({0}) de par\u00E1metros, se esperaba {1}.
J136=Hubo una transacci\u00F3n XA asociada con la conexi\u00F3n que se cierra. Se va a revertir la transacci\u00F3n. El Xid de transacci\u00F3n es {0}.
XCL01.S=El conjunto de resultados no devuelve filas. Operaci\u00F3n {0} no permitida. 
L017=no se puede crear un nuevo archivo de anotaciones cronol\u00F3gicas {0} debido a {1}
J028=v\u00EDa de acceso de seguridad para la recuperaci\u00F3n en avance
R011=La base de datos de repeticiones secundarias ''{0}'' escucha las conexiones de la principal en ''{1}\:{2}''.
X0Y70.S=No se permite INSERT, UPDATE y DELETE sobre la tabla {1} porque el desencadenante {0} est\u00E1 activo.
X0Y25.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque {2} ''{3}'' depende de ese objeto.
J118=contrase\u00F1a caducada
X0Y43.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: el n\u00FAmero de columnas de {0}({1}) no coincide con el n\u00FAmero de columnas de la clave referenciada ({2}).
XSLAB.D=No se puede encontrar el archivo de anotaciones cronol\u00F3gicas {0}, aseg\u00FArese de que la propiedad logDevice se ha establecido con el separador de v\u00EDa de acceso correcto para la plataforma.
XBCXE.S=El suministrador de cifrado no se puede cambiar despu\u00E9s de crear la base de datos.
R020=Conmutaci\u00F3n por error efectuada correctamente para la base de datos ''{0}''.
42XAI=La instrucci\u00F3n hace referencia a la siguiente secuencia m\u00E1s de una vez\: ''{0}''.
X0X62.S=Se ha encontrado una incoherencia entre la tabla ''{0}'' y el \u00EDndice ''{1}''.  Error al intentar recuperar la ubicaci\u00F3n de la fila ''{2}'' de la tabla.  La clave de \u00EDndice completa, incluida la ubicaci\u00F3n de la fila, es ''{3}''. La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.
XSDAJ.S=Excepci\u00F3n durante la grabaci\u00F3n de un objeto serializable o SQLData
4287A=La cl\u00E1usula ORDER BY no puede especificar ninguna expresi\u00F3n, ya que la consulta indica DISTINCT.
X0Y16.S=''{0}'' no es una vista.  Si es una tabla utilice en su lugar DROP TABLE.
XCL10.S=Se ha recompilado un PreparedStatement y los par\u00E1metros han cambiado. Si utiliza JDBC debe preparar la sentencia de nuevo.  
XSAJD.U=Tama\u00F1o de fusiones realizadas
J127=parseSQLDIAGGRP todav\u00EDa no se ha implementado
XJ04B.S=El proceso por lotes no puede contener un mandatos que intente devolver un juego de resultados.
