#Thu May 16 17:55:33 BRT 2013
L008=Inkompatibilis r\u00E9gi Logfile t\u00F6rl\u00E9se\: {0}
J019=k\u00FCls\u0151 kriptogr\u00E1fiai kulcs
XBM01.D=Az ind\u00EDt\u00E1s kiv\u00E9tel miatt meghi\u00FAsult. R\u00E9szletek\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt. 
J109=A rendszer helytelen TCP/IP \u00FCgyf\u00E9lkonfigur\u00E1ci\u00F3t \u00E9szlelt.  A helyi gazda IP c\u00EDme nem hat\u00E1rozhat\u00F3 meg\: ''{0}''.  Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy az \u00FCgyf\u00E9lg\u00E9p megfelel\u0151en be\u00E1ll\u00EDtott IP c\u00EDmmel rendelkezik.
46J02=A Java met\u00F3dus al\u00E1\u00EDr\u00E1s helytelen sz\u00E1m\u00FA param\u00E9tert ({0}) tartalmaz. A v\u00E1rt sz\u00E1m {1}.
XCL01.S=Az eredm\u00E9nyhalmaz nem ad vissza sorokat. A(z) {0} m\u0171velet nem megengedett. 
L017={1} miatt nem hozhat\u00F3 l\u00E9tre \u00FAj {0} napl\u00F3f\u00E1jl
J028=ment\u00E9si el\u00E9r\u00E9si \u00FAt a visszag\u00F6rget\u00E9ses helyre\u00E1ll\u00EDt\u00E1shoz
X0Y70.S=Az INSERT, UPDATE \u00E9s DELETE a(z) {1} t\u00E1bl\u00E1n nem t\u00E1mogatott, mivel a(z) {0} trigger akt\u00EDv.
X0Y25.S=A(z) ''{0}'' m\u0171velet a(z) ''{1}'' objektumon nem hajthat\u00F3 v\u00E9gre, mivel a(z) ''{3}'' {2} ett\u0151l az objektumt\u00F3l f\u00FCgg.
J118=lej\u00E1rt jelsz\u00F3
XSLAB.D=A(z) {0} napl\u00F3f\u00E1jl nem tal\u00E1lhat\u00F3 Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a logDevice tulajdons\u00E1g a platformnak megfelel\u0151 \u00FAtvonal-elv\u00E1laszt\u00F3val van be\u00E1ll\u00EDtva.
X0Y43.S=A(z) ''{0}'' megszor\u00EDt\u00E1s \u00E9rv\u00E9nytelen\: a(z) {0} ({1}) oszlopainak sz\u00E1ma nem felel meg a hivatkozott kulcs ({2}) oszlopsz\u00E1m\u00E1nak.
XBCXE.S=A titkos\u00EDt\u00E1si szolg\u00E1ltat\u00F3 nem m\u00F3dos\u00EDthat\u00F3 az adatb\u00E1zis l\u00E9trehoz\u00E1sa ut\u00E1n.
X0X62.S=A(z) ''{0}'' t\u00E1bla \u00E9s ''{1}'' index k\u00F6z\u00F6tt inkonzisztencia van.  Hiba t\u00F6rt\u00E9nt a(z) ''{2}'' sorhely t\u00E1bl\u00E1b\u00F3l lek\u00E9r\u00E9se sor\u00E1n.  A teljes indexkulcs, a sorhelyet is bele\u00E9rtve, a(z) ''{3}''. A javasolt jav\u00EDt\u00F3 m\u0171velet az index \u00FAjb\u00F3li l\u00E9trehoz\u00E1sa.
XSDAJ.S=Kiv\u00E9tel t\u00F6rt\u00E9nt egy soros\u00EDthat\u00F3 vagy SQLData objektum \u00EDr\u00E1sa sor\u00E1n
X0Y16.S=A(z) ''{0}'' nem n\u00E9zet.  Ha t\u00E1bla, akkor haszn\u00E1lja ink\u00E1bb a DROP TABLE parancsot.
XCL10.S=A PreparedStatement \u00FAjb\u00F3l leford\u00EDt\u00E1sra ker\u00FClt \u00E9s a param\u00E9terek m\u00F3dos\u00EDtva lettek. JDBC haszn\u00E1lata eset\u00E9n \u00FAjra el\u0151 kell k\u00E9sz\u00EDteni az utas\u00EDt\u00E1st.  
J127=parseSQLDIAGGRP m\u00E9g nem ker\u00FClt megval\u00F3s\u00EDt\u00E1sra
XSAJD.U=\u00D6sszef\u00E9s\u00FCl\u00E9si menetek m\u00E9rete
XJ04B.S=A k\u00F6teg nem tartalmazhat olyan parancsot, amely eredm\u00E9nyhalmazt pr\u00F3b\u00E1l visszaadni.
