#Thu May 16 17:55:33 BRT 2013
L008=Suppression d''un ancien fichier journal incompatible {0}
J019=cl\u00E9 de cryptographie externe
R002=--------------------  MESSAGE D''ERREUR FIN DE REPLICATION ---------------------
XBM01.D=Echec du d\u00E9marrage d\u00FB \u00E0 une exception. Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante. 
J109=Configuration client TCP/IP incorrecte d\u00E9tect\u00E9e.  Impossible de d\u00E9terminer l''adresse IP de votre h\u00F4te local \: ''{0}''.  Assurez-vous que votre machine client poss\u00E8de une adresse IP correctement configur\u00E9e.
46J02=La signature de m\u00E9thode Java contient un nombre incorrect ({0}) de param\u00E8tres, valeur {1} attendue.
J136=Une transaction XA \u00E9tait associ\u00E9e \u00E0 la connexion en cours de fermeture. La transaction sera annul\u00E9e. La transaction Xid est {0}.
XCL01.S=L''ensemble de r\u00E9sultats ne renvoie pas de lignes. L''op\u00E9ration {0} n''est pas autoris\u00E9e. 
L017=impossible de cr\u00E9er de nouveau fichier journal {0} en raison de {1}
J028=chemin de sauvegarde pour r\u00E9cup\u00E9ration aval
R011=La base de donn\u00E9es esclave de r\u00E9plication ''{0}'' \u00E9coute les connexions \u00E0 partir du ma\u00EEtre sur ''{1} \:{2}''.
X0Y70.S=INSERT, UPDATE et DELETE ne sont pas autoris\u00E9s sur la table {1} parce que le d\u00E9clencheur {0} est actif.
X0Y25.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}'' car {2} ''{3}'' d\u00E9pend de cet objet.
J118=Mot de passe expir\u00E9
X0Y43.S=La contrainte ''{0}'' n''est pas valide \: le nombre de colonnes de {0} ({1}) ne correspond pas au nombre de colonnes de la cl\u00E9 r\u00E9f\u00E9renc\u00E9 ({2}).
XSLAB.D=Le fichier journal {0} est introuvable ; assurez-vous que votre propri\u00E9t\u00E9 logDevice est d\u00E9finie correctement avec le s\u00E9parateur de chemin d''acc\u00E8s appropri\u00E9 pour votre plateforme.
XBCXE.S=Le fournisseur de chiffrement ne peut pas \u00EAtre modifi\u00E9 une fois que la base de donn\u00E9es est cr\u00E9\u00E9e.
R020=Basculement effectu\u00E9 avec succ\u00E8s pour la base de donn\u00E9es ''{0}''.
42XAI=L''instruction fait r\u00E9f\u00E9rence \u00E0 la s\u00E9quence suivante \u00E0 plusieurs reprises \: ''{0}''.
X0X62.S=Incoh\u00E9rence d\u00E9tect\u00E9e entre la table ''{0}'' et l''index ''{1}''.  Erreur lors de la tentative d''extraction de l''emplacement de ligne ''{2}'' \u00E0 partir de la table.  La cl\u00E9 d''index compl\u00E8te, qui comprend l''emplacement de ligne est ''{3}''. L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
XSDAJ.S=Exception au cours de l''\u00E9criture d''un objet s\u00E9rialisable ou SQLData
4287A=La clause ORDER BY peut ne pas sp\u00E9cifier d''expression, car la requ\u00EAte indique DISTINCT.
X0Y16.S=''{0}'' n''est pas une vue.  S''il s''agit d''une table, utilisez plut\u00F4t DROP TABLE.
XCL10.S=Une instruction pr\u00E9par\u00E9e (PreparedStatement) a \u00E9t\u00E9 recompil\u00E9e et les param\u00E8tres ont chang\u00E9. Si vous utilisez JDBC, vous devez de nouveau pr\u00E9parer l''instruction.  
XSAJD.U=Taille des ex\u00E9cutions de fusion
J127=La m\u00E9thode parseSQLDIAGGRP n''est pas encore impl\u00E9ment\u00E9e
XJ04B.S=Le fichier de commandes ne peut pas contenir de commande qui essaye de renvoyer un ensemble de r\u00E9sultats.
