#Thu May 16 17:55:33 BRT 2013
L008=\u975E\u4E92\u63DB\u306E\u53E4\u3044\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB {0} \u3092\u524A\u9664\u3057\u307E\u3059
J019=\u5916\u90E8\u6697\u53F7\u9375
R002=-------------------- \u8907\u88FD\u30A8\u30E9\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7D42\u4E86 ---------------------
XBM01.D=\u4F8B\u5916\u306E\u305F\u3081\u3001\u59CB\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002 \u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001\u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
J109=\u4E0D\u9069\u5207\u306A TCP/IP \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u69CB\u6210\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002  \u30ED\u30FC\u30AB\u30EB\u30DB\u30B9\u30C8\u306E IP \u30A2\u30C9\u30EC\u30B9\u3092\u5224\u5225\u3067\u304D\u307E\u305B\u3093\:''{0}''\u3002 \u3054\u4F7F\u7528\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30DE\u30B7\u30F3\u306E IP \u30A2\u30C9\u30EC\u30B9\u304C\u9069\u5207\u306B\u69CB\u6210\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
46J02=Java \u30E1\u30BD\u30C3\u30C9\u30FB\u30B7\u30B0\u30CB\u30C1\u30E3\u30FC\u306B\u542B\u307E\u308C\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6570 ({0}) \u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002\u6B63\u3057\u304F\u306F {1} \u3067\u3059\u3002
J136=\u30AF\u30ED\u30FC\u30BA\u3057\u3088\u3046\u3068\u3057\u305F\u63A5\u7D9A\u306B\u306F XA \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u307E\u3059\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E Xid \u306F {0} \u3067\u3059\u3002
XCL01.S=\u7D50\u679C\u30BB\u30C3\u30C8\u304C\u884C\u3092\u623B\u3057\u307E\u305B\u3093\u3002 \u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 {0} \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002 
L017={1} \u304C\u539F\u56E0\u3067\u3001\u65B0\u898F\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB {0} \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093
J028=\u30ED\u30FC\u30EB\u30D5\u30A9\u30EF\u30FC\u30C9\u30FB\u30EA\u30AB\u30D0\u30EA\u30FC\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30D1\u30B9
R011=\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306F\u3001\u30DE\u30B9\u30BF\u30FC\u304B\u3089\u306E\u63A5\u7D9A\u3092 ''{1}\:{2}'' \u3067\u5F85\u6A5F\u3057\u3066\u3044\u307E\u3059\u3002
X0Y70.S=\u30C8\u30EA\u30AC\u30FC {0} \u304C\u30A2\u30AF\u30C6\u30A3\u30D6\u306E\u305F\u3081\u3001\u8868 {1} \u3067\u306E INSERT\u3001UPDATE \u304A\u3088\u3073 DELETE \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
X0Y25.S=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 ''{1}'' \u306B\u304A\u3044\u3066\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''{0}'' \u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002{2} ''{3}'' \u304C\u305D\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u5F93\u5C5E\u3057\u3066\u3044\u307E\u3059\u3002
J118=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u671F\u9650\u5207\u308C\u3067\u3059
X0Y43.S=\u5236\u7D04 ''{0}'' \u306F\u7121\u52B9\u3067\u3059\: {0} ({1}) \u306E\u5217\u6570\u304C\u53C2\u7167\u30AD\u30FC ({2}) \u306E\u5217\u6570\u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
XSLAB.D=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002logDevice \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304C\u3001\u4F7F\u7528\u3059\u308B\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306B\u9069\u5207\u306A\u30D1\u30B9\u533A\u5207\u308A\u8A18\u53F7\u3067\u6B63\u3057\u304F\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XBCXE.S=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u4F5C\u6210\u5F8C\u306B\u6697\u53F7\u5316\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
R020=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u304C\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
42XAI=\u3053\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u6B21\u306E\u30B7\u30FC\u30B1\u30F3\u30B9\u3092 2 \u56DE\u4EE5\u4E0A\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\: ''{0}''\u3002
X0X62.S=\u8868 ''{0}'' \u3068\u7D22\u5F15 ''{1}'' \u306E\u9593\u306B\u4E0D\u6574\u5408\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002  \u8868\u304B\u3089\u884C\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3 ''{2}'' \u3092\u691C\u7D22\u3057\u3088\u3046\u3068\u3057\u305F\u3068\u304D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u884C\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u542B\u3080\u3001\u5B8C\u5168\u7D22\u5F15\u30AD\u30FC\u306F ''{3}'' \u3067\u3059\u3002 \u8A02\u6B63\u51E6\u7F6E\u3068\u3057\u3066\u3001\u7D22\u5F15\u306E\u518D\u4F5C\u6210\u3092\u304A\u52E7\u3081\u3057\u307E\u3059\u3002
XSDAJ.S=\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u53EF\u80FD\u307E\u305F\u306F SQLData \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u66F8\u304D\u8FBC\u307F\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
4287A=ORDER BY \u5206\u7BC0\u306B\u5F0F\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u7167\u4F1A\u306B DISTINCT \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u304B\u3089\u3067\u3059\u3002
X0Y16.S=''{0}'' \u306F\u30D3\u30E5\u30FC\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002  \u8868\u306E\u5834\u5408\u306F\u3001\u4EE3\u308F\u308A\u306B DROP TABLE \u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XCL10.S=PreparedStatement \u304C\u518D\u30B3\u30F3\u30D1\u30A4\u30EB\u3055\u308C\u3001\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002 JDBC \u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u518D\u6E96\u5099\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002  
XSAJD.U=\u30DE\u30FC\u30B8\u5B9F\u884C\u30B5\u30A4\u30BA
J127=parseSQLDIAGGRP \u306F\u307E\u3060\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
XJ04B.S=\u30D0\u30C3\u30C1\u306B\u306F\u3001\u7D50\u679C\u30BB\u30C3\u30C8\u3092\u623B\u305D\u3046\u3068\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3092\u5165\u308C\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
