#Thu May 16 17:55:33 BRT 2013
L008=Usuwanie niekompatybilnego starego pliku dziennika {0}
J019=zewn\u0119trzny klucz szyfrowania
XBM01.D=Uruchamianie nie powiod\u0142o si\u0119 z powodu wyj\u0105tku. Szczeg\u00F3\u0142y zawiera nast\u0119pny wyj\u0105tek. 
J109=Wykryto niepoprawn\u0105 konfiguracj\u0119 klienta TCP/IP. Nie mo\u017Cna okre\u015Bli\u0107 adresu IP dla hosta lokalnego\: ''{0}''. Upewnij si\u0119, czy na komputerze klienta adres IP jest skonfigurowany prawid\u0142owo.
46J02=Sygnatura metody Java zawiera niepoprawn\u0105 liczb\u0119 parametr\u00F3w ({0}). Oczekiwano {1}.
XCL01.S=Tabela wynikowa nie zwraca wierszy. Operacja {0} nie jest dozwolona. 
L017=nie mo\u017Cna utworzy\u0107 nowego pliku dziennika {0} z nast\u0119puj\u0105cego powodu\: {1}
J028=\u015Bcie\u017Cka kopii zapasowej dla odtwarzania do przodu
X0Y70.S=Instrukcje INSERT, UPDATE i DELETE nie s\u0105 dozwolone dla tabeli {1}, poniewa\u017C wyzwalacz {0} jest aktywny.
X0Y25.S=Operacja ''{0}'' nie mo\u017Ce by\u0107 wykonana na obiekcie ''{1}'', poniewa\u017C instrukcja {2} ''{3}'' jest zale\u017Cna od tego obiektu.
J118=has\u0142o utraci\u0142o wa\u017Cno\u015B\u0107
XSLAB.D=Nie mo\u017Cna znale\u017A\u0107 pliku dziennika {0}. Upewnij si\u0119, \u017Ce w\u0142a\u015Bciwo\u015B\u0107 logDevice jest ustawiona za pomoc\u0105 poprawnego dla danej platformy separatora \u015Bcie\u017Cki.
X0Y43.S=Regu\u0142a ograniczaj\u0105ca ''{0}'' jest niepoprawna\: liczba kolumn w {0} ({1}) nie jest zgodna z liczb\u0105 kolumn w kluczu, do kt\u00F3rego wyst\u0119puje odwo\u0142anie ({2}).
XBCXE.S=Nie mo\u017Cna zmieni\u0107 dostawcy szyfrowania po utworzeniu bazy danych.
X0X62.S=Znaleziono niesp\u00F3jno\u015B\u0107 mi\u0119dzy tabel\u0105 ''{0}'' a indeksem ''{1}''. B\u0142\u0105d podczas pr\u00F3by pobrania po\u0142o\u017Cenia wiersza ''{2}'' z tabeli. Pe\u0142ny klucz indeksowania, \u0142\u0105cznie z po\u0142o\u017Ceniem wiersza, to ''{3}''. Zalecane dzia\u0142anie to ponowne utworzenie indeksu.
XSDAJ.S=Wyj\u0105tek podczas zapisu obiektu serializacji lub SQLData
X0Y16.S=''{0}'' nie jest widokiem. Je\u015Bli jest to tabela, u\u017Cyj instrukcji DROP TABLE.
XCL10.S=Obiekt PreparedStatement zosta\u0142 przekompilowany i parametry si\u0119 zmieni\u0142y. W przypadku korzystania ze sterownika JDBC nale\u017Cy ponownie przygotowa\u0107 instrukcj\u0119. 
J127=funkcja parseSQLDIAGGRP nie zosta\u0142a jeszcze zaimplementowana
XSAJD.U=Wielko\u015B\u0107 uruchomionych operacji scalania
XJ04B.S=Zadanie wsadowe nie mo\u017Ce zawiera\u0107 komendy, kt\u00F3ra pr\u00F3buje zwr\u00F3ci\u0107 tabel\u0119 wynikow\u0105.
