#Thu May 16 17:55:33 BRT 2013
X0Y71.S=La manipulation de transaction, telle que SET ISOLATION, n''est pas autoris\u00E9e parce que le d\u00E9clencheur {0} est actif.
R003=R\u00F4le esclave de r\u00E9plication d\u00E9marr\u00E9 pour la base de donn\u00E9es ''{0}''.
X0Y26.S=L''index ''{0}'' doit se trouver dans le m\u00EAme sch\u00E9ma que la table ''{1}''.
XCL20.S=Les catalogues dont le niveau de version est ''{0}'' ne peuvent pas \u00EAtre mis \u00E0 niveau vers le niveau de version ''{1}''.
X0Y44.S=La contrainte ''{0}'' n''est pas valide \: aucune contrainte de cl\u00E9 unique ou primaire de la table ''{1}'' ne correspond au nombre et aux types des colonnes de la cl\u00E9 externe.
XSLAC.D=La base de donn\u00E9es situ\u00E9e dans {0} utilise un format incompatible avec la version actuelle du logiciel ; elle a peut-\u00EAtre \u00E9t\u00E9 cr\u00E9\u00E9e ou mise \u00E0 niveau par une version ult\u00E9rieure.
XBCXF.S=La classe ''{0}'' qui repr\u00E9sente le fournisseur de chiffrement est introuvable.
X0X63.S=Exception d''E/S ''{0}''.
L018=Le syst\u00E8me peut se trouver dans un \u00E9tat incoh\u00E9rent ; fichier manquant {0}
R012=Descripteur de connexion de r\u00E9plication invalide.
XSDFF.S=L''op\u00E9ration demand\u00E9e a \u00E9chou\u00E9 en raison d''une exception inattendue.
J029=chemin de sauvegarde pour cr\u00E9ation de base de donn\u00E9es \u00E0 partir de la sauvegarde
XSDAK.S=La mauvaise page a \u00E9t\u00E9 extraite pour le descripteur d''enregistrement {0}.
XJ05B.C=L''attribut JDBC ''{0}'' a une valeur incorrecte ''{1}'', les valeurs valides sont ''{2}''.
XSAJE.U=Toutes
XJ04C.S=Le fichier de commandes CallableStatement ne peut pas contenir de param\u00E8tres de sortie.
X0X81.S={0} ''{1}'' n''existe pas.
X0Y80.S=Echec de l''op\u00E9ration ALTER sur la table ''{0}''. Des donn\u00E9es NULL ont \u00E9t\u00E9 trouv\u00E9es dans la colonne ''{1}''.
XBM02.D=Echec du d\u00E9marrage en raison d''une fonctionnalit\u00E9 absente pour {0}. Assurez-vous que votre chemin de classes contient les logiciels Derby appropri\u00E9s.
42XAJ=L''instruction CREATE SEQUENCE contient une clause ''{0}'' redondante.
S0022=La colonne ''{0}'' est introuvable.
XIE03.S=Donn\u00E9es trouv\u00E9es sur la ligne {0} pour la colonne {1} apr\u00E8s le d\u00E9limiteur d''arr\u00EAt.  
J128=Le curseur n''est pas ouvert
L009=Suppression d''un ancien fichier journal {0}
