#Thu May 16 17:55:33 BRT 2013
X0Y71.S=No se permite la manipulaci\u00F3n de transacciones como SET ISOLATION porque el desencadenante {0} est\u00E1 activo.
R003=Se ha iniciado la funci\u00F3n de repetici\u00F3n secundaria para la base de datos ''{0}''.
X0Y26.S=Es necesario que el \u00EDndice ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.
XCL20.S=Los cat\u00E1logos del nivel de versi\u00F3n ''{0}'' no pueden actualizarse al nivel de versi\u00F3n ''{1}''.
X0Y44.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: no existe una restricci\u00F3n de clave \u00FAnica o primaria sobre la tabla ''{1}'' que coincida con el n\u00FAmero y tipos de las columnas de la clave primaria.
XSLAC.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software, puede haber sido creada o actualizada por una versi\u00F3n posterior.
XBCXF.S=No se puede encontrar la clase ''{0}'' que representa el suministrador de cifrado.
X0X63.S=Se ha obtenido una excepci\u00F3n de E/S (IOException) ''{0}''.
L018=El sistema puede estar en un estado inconsistente, falta el archivo {0}
R012=Control de conexi\u00F3n de repeticiones no v\u00E1lido.
XSDFF.S=Anomal\u00EDa en la operaci\u00F3n solicitada debido a una excepci\u00F3n inesperada.
J029=ruta de acceso de copia de seguridad para crear base de datos a partir de copia de seguridad
XSDAK.S=Se ha obtenido una p\u00E1gina incorrecta para el descriptor de contexto de registro {0}.
XJ05B.C=El atributo de JDBC ''{0}'' tiene un valor ''{1}'' no v\u00E1lido, los valores v\u00E1lidos son ''{2}''.
XSAJE.U=Todo
XJ04C.S=El proceso por lotes CallableStatement no puede contener par\u00E1metros de salida.
X0X81.S={0} ''{1}'' no existe.
X0Y80.S=Error de ALTER tabla ''{0}''. Se han encontrado datos nulos en la columna ''{1}''.
XBM02.D=Error de arranque debido a una falta de funcionalidad para {0}. Aseg\u00FArese de que la classpath incluya el software Derby correcto.
42XAJ=La instrucci\u00F3n CREATE SEQUENCE contiene la cl\u00E1usula redundante ''{0}''.
S0022=Columna ''{0}'' no encontrada.
XIE03.S=Se han encontrado datos en la l\u00EDnea {0} de la columna {1} despu\u00E9s del delimitador de parada.  
J128=el cursor no est\u00E1 abierto
L009=Suprimiendo Logfile antiguo {0}
