#Thu May 16 17:55:33 BRT 2013
08004.C.12=Die Verbindung konnte nicht authentifiziert werden. Entweder sind die eingegebenen Berechtigungsnachweise ung\u00FCltig oder die Datenbank verwendet ein Passwortverschl\u00FCsselungsschema, das mit dem starken Passwortsubstitutions-Sicherheitsmechanismus nicht kompatibel ist. Wenn dieser Fehler nach dem Upgrade auftritt, erhalten Sie im Versionshinweis f\u00FCr DERBY-4483 Informationen zu Ihren M\u00F6glichkeiten.
08004.C.9=Benutzer  ''{0}'' hat keine Berechtigung zum Herunterfahren des Systems [{1}].
43X87.U=ResultSet f\u00FCr Verkn\u00FCpfung \u00FCber verschachtelte Schleife
08004.C.11=Keine Berechtigung des Benutzers ''{0}'' zum Erstellen von Datenbank''{1}'' [{2}].
23502=Die Spalte ''{0}'' akzeptiert keinen Nullwert.
08004.C.8=Benutzer ''{0}'' kann keinen Replikationsvorgang auf Datenbank ''{1}'' ausl\u00F6sen. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.10=Systemberechtigung zum Erstellen von Datenbank ''{0}'' [{1}] kann nicht \u00FCberpr\u00FCft werden.
08004.C.7=Verbindung mit Datenbank ''{0}'' verweigert. Die Datenbank befindet sich im Replication-Slave-Modus.
42X88=Ein Bedingungsausdruck enth\u00E4lt einen nicht-Booleschen Operanden. Das Ergebnis der Auswertung f\u00FCr den Operanden eines Bedingungsausdrucks muss TRUE, FALSE oder UNKNOWN sein. 
08004.C.6=Benutzer ''{0}'' kann kein Upgrade der Datenbank ''{1}'' erzwingen. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.5=Benutzer ''{0}'' kann die Datenbank ''{1}'' nicht (neu) verschl\u00FCsseln. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
42Y96.U=UNKNOWN
08004.C.4=Benutzer ''{0}'' kann die Datenbank ''{1}'' nicht herunterfahren. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.3=Die Datenbankverbindung wurde verweigert.
42501=Benutzer ''{0}'' hat keine {1} Berechtigung f\u00FCr Tabelle ''{2}''.''{3}'' mit GRANT erteilt.
08004.C.2=Die Verbindung wurde zur\u00FCckgewiesen, weil die Datenbank {0} nicht gefunden wurde.
08004.C.1=Die Verbindung konnte nicht authentifiziert werden. Ursache\: {0}.
22008.S=''{0}'' ist ein ung\u00FCltiges Argument f\u00FCr die Funktion {1}.
43Y59.U=Intersect
428EK=Das Qualifikationsmerkmal f\u00FCr eine deklarierte globale tempor\u00E4re Tabelle muss SESSION sein.
43X78.U=Abrufzeit f\u00FCr tempor\u00E4res Konglomerat (Millisekunden)
XBM0I.D=Das Verzeichnis {0} kann nicht entfernt werden.
42Z86.U=ROW
43X96.U=Einschr\u00E4nkungszeit (Millisekunden)
38001=Die externe Routine ist nicht berechtigt, SQL-Anweisungen auszuf\u00FChren.
XIE0J.S=Ein Begrenzer ist ung\u00FCltig oder wird mehrfach verwendet.
42X79=Der Spaltenname ''{0}'' erscheint mehr als einmal im Ergebnis des Abfrageausdrucks.
08004=Zur\u00FCckgewiesene Verbindung\: {0}
XSRSB.S=F\u00FCr eine Transaktion mit nicht protokollierten und nicht festgeschriebenen Operationen kann keine Sicherung durchgef\u00FChrt werden.
24501.S=Der angegebene Cursor ist nicht ge\u00F6ffnet.
43X69.U=Einf\u00FCgen
42Z77=Ein Kontextelement muss vom Typ ''XML'' sein. ''{0}'' ist unzul\u00E4ssig.
42Y69=F\u00FCr diese Anweisung wurde kein g\u00FCltiger Ausf\u00FChrungsplan gefunden. Dies kann eine der beiden folgenden Ursachen haben\: Sie haben eine Hash-Verkn\u00FCpfungsstrategie angegeben, obwohl keine Hash-Verkn\u00FCpfung erlaubt ist (kein optimierbares equijoin) oder Sie versuchen, zwei externe virtuelle Tabellen zu verkn\u00FCpfen, die jeweils aufeinander verweisen, so dass die Anweisung nicht ausgewertet werden kann.
XSCB0.S=Ein Container konnte nicht erstellt werden.
