#Thu May 16 17:55:33 BRT 2013
08004.C.12=Se ha producido una anomal\u00EDa de autenticaci\u00F3n de conexi\u00F3n. Las credenciales proporcionadas no son v\u00E1lidas o la base de datos utiliza un esquema de cifrado de contrase\u00F1as incompatible con el mecanismo de seguridad de contrase\u00F1as seguras de sustituci\u00F3n. Si este error se inici\u00F3 despu\u00E9s de la actualizaci\u00F3n, consulte las notas de la versi\u00F3n para ver las opciones de DERBY-4483.
08004.C.9=Falta permiso para el usuario ''{0}'' para apagar el sistema [{1}].
43X87.U=ResultSet de uni\u00F3n de bucle anidado
08004.C.11=Falta permiso para el usuario ''{0}'' para crear la base de datos ''{1}'' [{2}].
23502=La columna ''{0}'' no puede aceptar un valor NULL.
08004.C.8=El usuario ''{0}'' no puede emitir una operaci\u00F3n de repetici\u00F3n en la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.10=No se puede seleccionar permiso del sistema para crear la base de datos ''{0}'' [{1}].
08004.C.7=La conexi\u00F3n con la base de datos ''{0}'' ha sido rechazada porque est\u00E1 en modo esclavo de r\u00E9plica.
42X88=Un condicional tiene un operando no booleano. El operando de un condicional debe dar como resultado TRUE, FALSE o UNKNOWN.  
08004.C.6=El usuario ''{0}'' no puede efectuar un actualizaci\u00F3n completa (hard upgrade) de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.5=El usuario ''{0}'' no puede (re)cifrar la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
42Y96.U=DESCONOCIDO
08004.C.4=El usuario ''{0}'' no puede cerrar la sesi\u00F3n de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.3=Conexi\u00F3n de base de datos rechazada.
42501=El usuario ''{0}'' no tiene el permiso de {1} en la tabla ''{2}''.''{3}'' para concesi\u00F3n.
08004.C.2=Se ha rechazado la conexi\u00F3n porque no se ha encontrado la base de datos {0}.
08004.C.1=Se ha producido una anomal\u00EDa de autenticaci\u00F3n de conexi\u00F3n.  Raz\u00F3n\: {0}.
22008.S=''{0}'' es un argumento no v\u00E1lido en la funci\u00F3n {1}.
43Y59.U=Intersect
428EK=El calificador para un nombre de tabla temporal global declarada debe ser SESSION.
43X78.U=tiempo de extracci\u00F3n de conglomerado temporal (milisegundos)
XBM0I.D=No se puede eliminar el directorio {0}.
42Z86.U=fila
43X96.U=tiempo de restricci\u00F3n (milisegundos)
38001=No se permite a la rutina externa que ejecute sentencias SQL.
XIE0J.S=Un delimitador no es v\u00E1lido o se ha utilizado m\u00E1s de una vez.
42X79=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en el resultado de la expresi\u00F3n de consulta.
08004=Conexi\u00F3n rechazada\: {0}
XSRSB.S=La copia de seguridad no se puede realizar en una transacci\u00F3n con operaciones no registradas sin comprometer.
24501.S=El cursor identificado no est\u00E1 abierto.
43X69.U=Insertar
42Z77=El elemento de contexto debe ser de tipo ''XML''; ''{0}'' no se permite.
42Y69=No se ha encontrado un plan de ejecuci\u00F3n v\u00E1lido para esta sentencia. Puede deberse a una de estas dos causas\: ha especificado una estrategia de uni\u00F3n hash cuando la uni\u00F3n hash no est\u00E1 permitida (equijoin no optimizable) o est\u00E1 intentando unir dos tablas virtuales externas, que se referencian entre ellas, y por tanto no se puede evaluar la sentencia.  
XSCB0.S=No se ha podido crear el contenedor.
