#Thu May 16 17:55:33 BRT 2013
08004.C.12=Un \u00E9chec d''authentification de la connexion s''est produit.  Les informations d''authentification fournies sont incorrectes ou la base de donn\u00E9es utilise un mode de chiffrement de mot de passe non compatible avec le mode de s\u00E9curit\u00E9 renforc\u00E9e de substitution des mots de passe. Si cette erreur s''est produite \u00E0 la suite de la mise \u00E0 jour, reportez-vous \u00E0 la note de version relative \u00E0 DERBY-4483 pour consulter les options disponibles.
08004.C.9=L''utilisateur ''{0}'' ne dispose pas des droits requis pour arr\u00EAter le syst\u00E8me [{1}].
43X87.U=ResultSet de jointure en boucle imbriqu\u00E9e
08004.C.11=L''utilisateur ''{0}'' ne dispose pas des droits requis pour cr\u00E9er la base de donn\u00E9es ''{1}'' [{2}].
23502=La colonne ''{0}'' ne peut pas accepter de valeur NULL.
08004.C.8=L''utilisateur ''{0}'' ne peut pas \u00E9mettre une op\u00E9ration de r\u00E9plication sur la base de donn\u00E9es  ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.10=Impossible de cr\u00E9er l''autorisation syst\u00E8me pour cr\u00E9er la base de donn\u00E9es ''{0}'' [{1}].
08004.C.7=La connexion \u00E0 la base de donn\u00E9es ''{0}'' a \u00E9t\u00E9 refus\u00E9e, car celle-ci est en mode de r\u00E9plication esclave.
42X88=Un conditionnel comporte un op\u00E9rande non bool\u00E9en. L''op\u00E9rande d''un conditionnel doit avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN.  
08004.C.6=L''utilisateur ''{0}'' ne peut pas proc\u00E9der \u00E0 une mise \u00E0 niveau mat\u00E9rielle de la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.5=L''utilisateur ''{0}'' ne peut pas (r\u00E9en)coder la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
42Y96.U=UNKNOWN
08004.C.4=L''utilisateur ''{0}'' ne peut pas arr\u00EAter la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.3=Connexion \u00E0 la base de donn\u00E9es refus\u00E9.
42501=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la table ''{2}''.''{3}'' pour l''instruction GRANT.
08004.C.2=La connexion a \u00E9t\u00E9 refus\u00E9e car la base de donn\u00E9es {0} n''a pas \u00E9t\u00E9 trouv\u00E9e.
08004.C.1=Un \u00E9chec d''authentification de la connexion s''est produit.  Motif \: {0}.
22008.S=''{0}'' est un argument non valide pour la fonction {1}.
43Y59.U=Intersect
428EK=Le qualifiant d''une table temporaire globale d\u00E9clar\u00E9e doit obligatoirement \u00EAtre SESSION.
43X78.U=dur\u00E9e d''extraction du conglom\u00E9rat temporaire (millisecondes)
XBM0I.D=Impossible de supprimer le r\u00E9pertoire {0}.
42Z86.U=ligne
43X96.U=dur\u00E9e de limitation (millisecondes)
38001=La routine externe n''est pas autoris\u00E9e \u00E0 ex\u00E9cuter des instructions SQL.
XIE0J.S=Un d\u00E9limiteur n''est pas valide ou est utilis\u00E9 plusieurs fois.
42X79=Le nom de colonne ''{0}'' figure plusieurs fois dans le r\u00E9sultat de l''expression de requ\u00EAte.
08004=Connexion refus\u00E9e \: {0}
XSRSB.S=Impossible de sauvegarder une transaction contenant des op\u00E9rations non consign\u00E9es et non valid\u00E9es.
24501.S=Le curseur identifi\u00E9 n''est pas ouvert.
43X69.U=Ins\u00E9rer
42Z77=L''\u00E9l\u00E9ment contextuel doit avoir pour type ''XML''; ''{0}'' n''est pas autoris\u00E9.
42Y69=Aucun plan d''ex\u00E9cution valide n''a \u00E9t\u00E9 trouv\u00E9 pour cette instruction. Cela peut s''expliquer de l''une des deux fa\u00E7ons suivantes \: soit vous avez sp\u00E9cifi\u00E9 une strat\u00E9gie de jointure par hachage alors que les jointures par hachage ne sont pas autoris\u00E9es (pas d''equijoin optimisable), soit vous essayez de joindre deux tables virtuelles externes dont chacune fait r\u00E9f\u00E9rence \u00E0 l''autre, de sorte que l''instruction ne peut pas \u00EAtre \u00E9valu\u00E9e.  
XSCB0.S=Impossible de cr\u00E9er un conteneur.
