#Thu May 16 17:55:33 BRT 2013
08004.C.12=\u63A5\u7D9A\u8A8D\u8A3C\u306E\u969C\u5BB3\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u5165\u529B\u3055\u308C\u305F\u8CC7\u683C\u60C5\u5831\u304C\u7121\u52B9\u3060\u3063\u305F\u304B\u3001\u5F37\u529B\u306A\u30D1\u30B9\u30EF\u30FC\u30C9\u7F6E\u63DB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30E1\u30AB\u30CB\u30BA\u30E0\u3068\u306E\u4E92\u63DB\u6027\u306E\u306A\u3044\u30D1\u30B9\u30EF\u30FC\u30C9\u6697\u53F7\u5316\u30B9\u30AD\u30FC\u30E0\u304C\u3053\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u30A8\u30E9\u30FC\u304C\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u5F8C\u306B\u767A\u751F\u3059\u308B\u3088\u3046\u306B\u306A\u3063\u305F\u5834\u5408\u306F\u3001DERBY-4483 \u306E\u30EA\u30EA\u30FC\u30B9\u30CE\u30FC\u30C8\u306B\u8A18\u8F09\u3055\u308C\u3066\u3044\u308B\u5BFE\u51E6\u65B9\u6CD5\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
08004.C.9=\u30B7\u30B9\u30C6\u30E0 [{1}] \u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3059\u308B\u305F\u3081\u306E\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306E\u8A31\u53EF\u304C\u3042\u308A\u307E\u305B\u3093\u3002
43X87.U=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30EB\u30FC\u30D7\u7D50\u5408 ResultSet
08004.C.11=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{1}'' [{2}] \u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306E\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306E\u8A31\u53EF\u304C\u3042\u308A\u307E\u305B\u3093\u3002
23502=\u5217 ''{0}'' \u306F NULL \u5024\u3092\u53D7\u3051\u5165\u308C\u3089\u308C\u307E\u305B\u3093\u3002
08004.C.8=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{1}'' \u306B\u5BFE\u3059\u308B\u8907\u88FD\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u767A\u884C\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u306E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u308B\u306E\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.10=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' [{1}] \u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306E\u30B7\u30B9\u30C6\u30E0\u8A31\u53EF\u3092\u78BA\u8A8D\u3067\u304D\u307E\u305B\u3093\u3002
08004.C.7=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u304C\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30E2\u30FC\u30C9\u306B\u3042\u308B\u305F\u3081\u3001\u63A5\u7D9A\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
42X88=\u6761\u4EF6\u304C\u975E\u30D6\u30FC\u30EB\u30FB\u30AA\u30DA\u30E9\u30F3\u30C9\u3092\u6301\u3063\u3066\u3044\u307E\u3059\u3002 \u6761\u4EF6\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u306F\u3001TRUE\u3001FALSE\u3001\u307E\u305F\u306F UNKNOWN \u3068\u3057\u3066\u8A55\u4FA1\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002  
08004.C.6=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{1}'' \u3092\u30CF\u30FC\u30C9\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u306E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u308B\u306E\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.5=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{1}'' \u3092\u6697\u53F7\u5316 (\u518D\u6697\u53F7\u5316) \u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u306E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u308B\u306E\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
42Y96.U=UNKNOWN
08004.C.4=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{1}'' \u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u306E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u308B\u306E\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.3=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u63A5\u7D9A\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
42501=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u8868 ''{2}''.''{3}'' \u306B\u5BFE\u3059\u308B GRANT \u6587\u306E {1} \u8A31\u53EF\u3092\u4E0E\u3048\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
08004.C.2=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 {0} \u304C\u691C\u51FA\u3055\u308C\u306A\u304B\u3063\u305F\u305F\u3081\u63A5\u7D9A\u306F\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
08004.C.1=\u63A5\u7D9A\u8A8D\u8A3C\u306E\u969C\u5BB3\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u7406\u7531\: {0}\u3002
22008.S=''{0}'' \u306F {1} \u95A2\u6570\u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u5F15\u6570\u3067\u3059\u3002
43Y59.U=Intersect
428EK=\u5BA3\u8A00\u6E08\u307F\u30B0\u30ED\u30FC\u30D0\u30EB\u4E00\u6642\u8868\u540D\u306E\u4FEE\u98FE\u5B50\u306F\u3001SESSION \u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
43X78.U=\u4E00\u6642\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u30FB\u30D5\u30A7\u30C3\u30C1\u6642\u9593 (\u30DF\u30EA\u79D2)
XBM0I.D=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC {0} \u3092\u9664\u53BB\u3067\u304D\u307E\u305B\u3093\u3002
42Z86.U=\u884C
43X96.U=\u5236\u9650\u6642\u9593 (\u30DF\u30EA\u79D2)
38001=\u5916\u90E8\u30EB\u30FC\u30C1\u30F3\u306F SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002
XIE0J.S=\u533A\u5207\u308A\u6587\u5B57\u304C\u7121\u52B9\u304B\u30011 \u56DE\u4EE5\u4E0A\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
42X79=\u5217\u540D ''{0}'' \u306F\u3001\u7167\u4F1A\u5F0F\u306E\u7D50\u679C\u306B\u8907\u6570\u56DE\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
08004=\u63A5\u7D9A\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\: {0}
XSRSB.S=\u30ED\u30B0\u8A18\u9332\u3055\u308C\u3066\u304A\u3089\u305A\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u542B\u3080\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002
24501.S=\u6307\u5B9A\u3055\u308C\u305F\u30AB\u30FC\u30BD\u30EB\u304C\u30AA\u30FC\u30D7\u30F3\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
43X69.U=\u633F\u5165
42Z77=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u9805\u76EE\u306F ''XML'' \u578B\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002''{0}'' \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Y69=\u3053\u306E\u6587\u306B\u5BFE\u3059\u308B\u6709\u52B9\u306A\u5B9F\u884C\u30D7\u30E9\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002 \u3053\u306E\u539F\u56E0\u3068\u3057\u3066\u6B21\u306E 2 \u3064\u306E\u3046\u3061\u306E 1 \u3064\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u30CF\u30C3\u30B7\u30E5\u7D50\u5408\u304C\u8A31\u53EF\u3055\u308C\u3066\u3044\u306A\u3044\u3068\u304D\u306B\u30CF\u30C3\u30B7\u30E5\u7D50\u5408\u30B9\u30C8\u30E9\u30C6\u30B8\u3092\u6307\u5B9A\u3057\u305F (\u6700\u9069\u5316\u53EF\u80FD\u306A\u7B49\u4FA1\u7D50\u5408\u304C\u306A\u3044)\u3002\u307E\u305F\u306F\u3001\u305D\u308C\u305E\u308C\u304C\u304A\u4E92\u3044\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u305F\u3081\u306B\u6587\u3092\u8A55\u4FA1\u3059\u308B\u3053\u3068\u306E\u3067\u304D\u306A\u3044\u30012 \u3064\u306E\u5916\u90E8\u4EEE\u60F3\u8868\u3092\u7D50\u5408\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308B\u3002  
XSCB0.S=\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
