#Thu May 16 17:55:33 BRT 2013
43X87.U=ResultSet de jun\u00E7\u00E3o por la\u00E7o aninhado
23502=A coluna ''{0}'' n\u00E3o aceita valor nulo.
42X88=A express\u00E3o condicional possui operando n\u00E3o booleano. Os operandos de uma express\u00E3o condicional devem ser avaliados como TRUE, FALSE ou UNKNOWN.
42Y96.U=DESCONHECIDO
08004.C.3=Conex\u00E3o com o banco de dados recusada.
42501=O usu\u00E1rio ''{0}'' n\u00E3o possui a permiss\u00E3o {1} na tabela ''{2}''.''{3}'' podendo conceder.
08004.C.2=A conex\u00E3o foi recusada, porque o banco de dados {0} n\u00E3o foi encontrado.
08004.C.1=Ocorreu uma falha de autentica\u00E7\u00E3o da conex\u00E3o.  Motivo\: {0}.
22008.S=''{0}'' n\u00E3o \u00E9 um argumento v\u00E1lido para a fun\u00E7\u00E3o {1}.
43Y59.U=Interse\u00E7\u00E3o
428EK=O qualificador do nome da tabela tempor\u00E1ria global declarada deve ser SESSION.
43X78.U=tempo de busca do conglomerado tempor\u00E1rio (milissegundos)
XBM0I.D=N\u00E3o foi poss\u00EDvel remover o diret\u00F3rio {0}.
42Z86.U=linha
43X96.U=tempo da restri\u00E7\u00E3o (milissegundos)
38001=A rotina externa n\u00E3o possui permiss\u00E3o para executar instru\u00E7\u00F5es SQL.
XIE0J.S=O delimitador n\u00E3o \u00E9 v\u00E1lido, ou \u00E9 utilizado mais de uma vez.
42X79=O nome de coluna ''{0}'' aparece mais de uma vez no resultado da express\u00E3o de consulta.
24501.S=O cursor identificado n\u00E3o est\u00E1 aberto.
08004=Conex\u00E3o recusada \: {0}
XSRSB.S=N\u00E3o \u00E9 poss\u00EDvel fazer backup em uma transa\u00E7\u00E3o com opera\u00E7\u00F5es n\u00E3o registradas n\u00E3o efetivadas.
43X69.U=Inserir
42Z77=O item de contexto deve ter o tipo ''XML''; ''{0}'' n\u00E3o \u00E9 permitido.
42Y69=N\u00E3o foi encontrado nenhum plano de execu\u00E7\u00E3o v\u00E1lido para esta instru\u00E7\u00E3o. Pode ter sido por um dos seguintes motivos\: foi especificada uma estrat\u00E9gia de jun\u00E7\u00E3o por ''hash'' quando uma jun\u00E7\u00E3o ''hash'' n\u00E3o era permitida (nenhum ''equijoin'' otimiz\u00E1vel), ou est\u00E1 se tentando juntar duas tabelas virtuais externas, cada uma fazendo refer\u00EAncia \u00E0 outra, e, portanto, a instru\u00E7\u00E3o n\u00E3o pode ser avaliada.
XSCB0.S=N\u00E3o foi poss\u00EDvel criar o cont\u00EAiner.
