#Thu May 16 17:55:33 BRT 2013
XSAJF.U=btree
XCL12.S=\u578B ''{0}'' \u306E\u30C7\u30FC\u30BF\u5024\u3092\u578B ''{1}'' \u306E\u30C7\u30FC\u30BF\u5024\u306B\u66F8\u304D\u8FBC\u3082\u3046\u3068\u3057\u307E\u3057\u305F\u3002
X0Y63.S.1=\u8868 ''{0}'' \u306B\u304A\u3051\u308B\u30B3\u30DE\u30F3\u30C9\u306F\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u4E3B\u30AD\u30FC/\u7D22\u5F15\u5217\u3067 NULL \u30C7\u30FC\u30BF\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002\u4E3B\u30AD\u30FC\u5185\u306E\u5217\u306F\u3001\u3044\u305A\u308C\u3082 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002  
XCL30.S=InputStream \u304B\u3089 ''{0}'' \u3092\u8AAD\u307F\u53D6\u3063\u3066\u3044\u308B\u3068\u304D\u306B\u3001IOException \u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002
XBM03.D=\u6307\u7167\u5408\u9806\u5E8F\u5C5E\u6027\u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u5024 ''{0}'' \u306F\u7121\u52B9\u3067\u3059\u3002UCS_BASIC \u307E\u305F\u306F TERRITORY_BASED \u304C\u4E88\u671F\u3055\u308C\u3066\u3044\u307E\u3059\u3002
R013=\u8907\u88FD\u30E1\u30C3\u30BB\u30FC\u30B8 ({0})\: {1}
X0Y54.S=\u30B9\u30AD\u30FC\u30DE ''{0}'' \u306F\u7A7A\u3067\u306A\u3044\u305F\u3081\u3001\u30C9\u30ED\u30C3\u30D7\u3067\u304D\u307E\u305B\u3093\u3002
XIE04.S=\u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: {0}
X0Y72.S=''{0}'' \u306F\u4F7F\u7528\u53EF\u80FD\u306A\u30C8\u30EA\u30AC\u30FC ({1}) \u3092\u6301\u3063\u3066\u3044\u308B\u305F\u3081\u3001\u3053\u308C\u306B\u5BFE\u3059\u308B\u30D0\u30EB\u30AF\u633F\u5165\u7F6E\u63DB\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
XCL21.S=\u5225\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u6E96\u5099\u3057\u306A\u304C\u3089\u3001\u30C7\u30FC\u30BF\u5B9A\u7FA9\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8 (CREATE\u3001DROP\u3001\u307E\u305F\u306F ALTER) \u3092\u5B9F\u884C\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002 \u3053\u308C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002 \u3053\u308C\u306F\u3001SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u5185\u304B\u3089\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B Java \u30AF\u30E9\u30B9\u306E\u9759\u7684\u30A4\u30CB\u30B7\u30E3\u30E9\u30A4\u30B6\u30FC\u5185\u304B\u3089\u30C7\u30FC\u30BF\u5B9A\u7FA9\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u5B9F\u884C\u3057\u305F\u5834\u5408\u306B\u8D77\u3053\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
XJ05C.S=\u30B0\u30ED\u30FC\u30D0\u30EB\u30FB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u4FDD\u6301\u6A5F\u80FD ResultSet.HOLD_CURSORS_OVER_COMMIT \u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
XSLAD.D=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB {3} \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 {2} \u306B\u3042\u308B\u30ED\u30B0\u30FB\u30EC\u30B3\u30FC\u30C9\u304C\u7834\u58CA\u3055\u308C\u3066\u3044\u307E\u3059\u3002 \u4E88\u671F\u3055\u308C\u3066\u3044\u305F\u30ED\u30B0\u30FB\u30EC\u30B3\u30FC\u30C9\u9577\u306F {0} \u3067\u3057\u305F\u304C\u3001\u5B9F\u969B\u306E\u9577\u3055\u306F {1} \u3067\u3057\u305F\u3002
X0Y45.S=1 \u3064\u4EE5\u4E0A\u306E\u5916\u90E8\u30AD\u30FC\u304C\u4E00\u81F4\u3059\u308B\u53C2\u7167\u30AD\u30FC\u3092\u6301\u3063\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u5916\u90E8\u30AD\u30FC\u5236\u7D04 ''{0}'' \u3092\u8868 {1} \u306B\u8FFD\u52A0\u3001\u307E\u305F\u306F\u305D\u3053\u3067\u4F7F\u7528\u53EF\u80FD\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002  
XBCXG.S=\u6697\u53F7\u5316\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC ''{0}'' \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
J129=\u65E2\u306B\u30AA\u30FC\u30D7\u30F3\u3055\u308C\u3066\u3044\u308B\u7167\u4F1A\u306B\u5BFE\u3059\u308B\u7167\u4F1A\u30AA\u30FC\u30D7\u30F3\u30FB\u30B3\u30DE\u30F3\u30C9\u304C\u767A\u884C\u3055\u308C\u307E\u3057\u305F
XSDAL.S=\u30EC\u30B3\u30FC\u30C9\u30FB\u30CF\u30F3\u30C9\u30EB {0} \u306F\u3001\u4E88\u671F\u305B\u305A\u3001\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u30FB\u30DA\u30FC\u30B8\u3092\u6307\u3057\u3066\u3044\u307E\u3059\u3002
X0Y63.S=\u8868 ''{0}'' \u306B\u304A\u3051\u308B\u30B3\u30DE\u30F3\u30C9\u306F\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u4E3B\u30AD\u30FC\u307E\u305F\u306F\u30E6\u30CB\u30FC\u30AF\u5236\u7D04/\u7D22\u5F15\u5217\u3067 NULL \u30C7\u30FC\u30BF\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002 \u4E3B\u30AD\u30FC\u304A\u3088\u3073\u30E6\u30CB\u30FC\u30AF\u7D22\u5F15\u30AD\u30FC\u5185\u306E\u5217\u306F\u3001\u3044\u305A\u308C\u3082 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002  
R004=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30ED\u30FC\u30EB\u304C\u505C\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
