#Thu May 16 17:55:33 BRT 2013
XSAJF.U=btree
XCL12.S=Une tentative de placement d''une valeur de donn\u00E9es de type ''{0}'' dans une valeur de donn\u00E9es de type ''{1}'' a \u00E9t\u00E9 effectu\u00E9e.
X0Y63.S.1=La commande sur la table ''{0}'' n''a pas abouti, car la ou les colonnes d''index/de cl\u00E9 primaire contiennent des donn\u00E9es nulles. Aucune colonne d''une cl\u00E9 primaire ne peut avoir de valeur nulle.  
XCL30.S=Une exception d''E/S a \u00E9t\u00E9 \u00E9mise lors de la lecture d''un ''{0}'' \u00E0 partir d''un InputStream.
XBM03.D=La valeur ''{0}'' fournie pour l''attribut d''interclassement est incorrecte, la valeur attendue \u00E9tant UCS_BASIC ou TERRITORY_BASED.
R013=Message de r\u00E9plication ({0}) \: {1}
X0Y54.S=Le sch\u00E9ma ''{0}'' ne peut pas \u00EAtre supprim\u00E9 parce qu''il n''est pas vide.
XIE04.S=Fichier de donn\u00E9es introuvable \: {0}
X0Y72.S=Une op\u00E9ration d''insertion/remplacement globale n''est pas autoris\u00E9e  sur ''{0}'' parce qu''il contient un d\u00E9clencheur activ\u00E9 ({1}).
XCL21.S=Vous essayez d''ex\u00E9cuter une instruction de d\u00E9finition de donn\u00E9es (CREATE, DROP ou ALTER) tandis que vous pr\u00E9parez une instruction diff\u00E9rente. Cette op\u00E9ration n''est pas admise. Cette situation peut se produire si vous ex\u00E9cutez une instruction de d\u00E9finition de donn\u00E9es \u00E0 partir d''un initialiseur statique d''une classe Java qui est en cours d''utilisation depuis une instruction SQL.
XJ05C.S=Impossible de d\u00E9finir la conservation de ResultSet.HOLD_CURSORS_OVER_COMMIT pour une transaction globale.
XSLAD.D=L''enregistrement de journal \u00E0 l''instant {2} dans le fichier journal {3} est corrompu. La longueur pr\u00E9vue de l''enregistrement de journal est {0}, la longueur r\u00E9elle est {1}.
X0Y45.S=La contrainte de cl\u00E9 externe ''{0}'' ne peut pas \u00EAtre ajout\u00E9e ni activ\u00E9e dans la table {1} parce qu''une ou plusieurs cl\u00E9s externes ne poss\u00E8dent pas de cl\u00E9s r\u00E9f\u00E9renc\u00E9es correspondantes.  
XBCXG.S=Le fournisseur de chiffrement ''{0}'' n''existe pas.
J129=Une commande Open Query a \u00E9t\u00E9 \u00E9mise pour une requ\u00EAte d\u00E9j\u00E0 ouverte
XSDAL.S=Le descripteur d''enregistrement {0} pointe de fa\u00E7on inattendue vers la page de d\u00E9passement.
X0Y63.S=La commande sur la table ''{0}'' n''a pas abouti car des donn\u00E9es NULL dans une ou plusieurs colonnes d''index/de contrainte de cl\u00E9 primaire ou unique. Toutes les colonnes d''une cl\u00E9 d''index primaire ou unique ne doivent pas comporter de valeurs non nulles.  
R004=Le r\u00F4le esclave de r\u00E9plication a \u00E9t\u00E9 arr\u00EAt\u00E9 pour la base de donn\u00E9es ''{0}''.
