#Thu May 16 17:55:33 BRT 2013
XSAJF.U=B-Baumstruktur
XCL12.S=Es wurde versucht, einen Datenwert des Typs ''{0}'' in einen Datenwert des Typs ''{1}'' aufzunehmen.
X0Y63.S.1=Der Befehl f\u00FCr die Tabelle ''{0}'' ist gescheitert, weil in den Spalten des Prim\u00E4rschl\u00FCssels Nulldaten gefunden wurden. F\u00FCr alle Spalten eines Prim\u00E4rschl\u00FCssels muss Eintragspflicht gelten.  
XCL30.S=Beim Lesen eines ''{0}'' von einem InputStream wurde eine IOException ausgel\u00F6st.
XBM03.D=Der angegebene Wert ''{0}'' f\u00FCr das Kollationattribut ist ung\u00FCltig, erwartet wurde UCS_BASIC oder TERRITORY_BASED.
R013=Replikationsmeldung ({0})\: {1}
X0Y54.S=Das Schema ''{0}'' kann nicht gel\u00F6scht werden, weil es nicht leer ist.
XIE04.S=Nicht gefundene Datendatei\: {0}
X0Y72.S=F\u00FCr ''{0}'' gibt es einen aktivierten Ausl\u00F6ser ({1}). Eine Ersetzung durch Masseneinf\u00FCgung ist deshalb unzul\u00E4ssig.
XCL21.S=Sie versuchen, eine Datendefinitionsanweisung (CREATE, DROP oder ALTER) auszuf\u00FChren, w\u00E4hrend Sie eine andere Anweisung vorbereiten. Dies ist unzul\u00E4ssig. Dies kann geschehen, wenn Sie eine Definitionsanweisung aus einem statischen Initialisierungsoperator f\u00FCr eine Java-Klasse heraus ausf\u00FChren, der innerhalb einer SQL-Anweisung verwendet wird.
XJ05C.S=Die Konstante ResultSet.HOLD_CURSORS_OVER_COMMIT f\u00FCr das Offenhalten kann f\u00FCr eine globale Transaktion nicht definiert werden.
XSLAD.D=Der Protokollsatz an der Adresse {2} in der Protokolldatei {3} ist besch\u00E4digt. Erwartete Protokollsatzl\u00E4nge\: {0}; tats\u00E4chliche L\u00E4nge\: {1}.
X0Y45.S=Die Integrit\u00E4tsbedingung ''{0}'' f\u00FCr Fremdschl\u00FCssel kann nicht zur Tabelle {1} hinzugef\u00FCgt oder f\u00FCr die Tabelle aktiviert werden, weil es f\u00FCr einen oder mehrere Fremdschl\u00FCssel keine \u00FCbereinstimmenden referenzierten Schl\u00FCssel gibt. 
XBCXG.S=Der Verschl\u00FCsselungsprovider ''{0}'' ist nicht vorhanden.
J129=F\u00FCr eine bereits ge\u00F6ffnete Abfrage wurde ein Befehl Open Query abgesetzt.
XSDAL.S=Die interne Datensatzkennung {0} zeigt unerwartet auf die \u00DCberlaufseite.
X0Y63.S=Der Befehl f\u00FCr die Tabelle ''{0}'' ist gescheitert, weil im Prim\u00E4rschl\u00FCssel oder den Spalten der eindeutigen Integrit\u00E4tsbedingung bzw. des Index Nulldaten gefunden wurden. Alle Spalten eines prim\u00E4ren oder eindeutigen Indexschl\u00FCssels m\u00FCssen ungleich null sein. 
R004=Replication Slave-Rolle angehalten f\u00FCr Datenbank''{0}''.
