#Thu May 16 17:55:33 BRT 2013
XSAJF.U=btree
XCL12.S=Se ha intentado colocar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.
X0Y63.S.1=Error del comando en la tabla ''{0}'' porque se encontraron datos nulos en las columnas de \u00EDndice o clave primaria. Todas las columnas de una clave primaria no deben aceptar nulos.  
XCL30.S=Se ha generado una excepci\u00F3n de E/S al leer ''{0}'' de una InputStream.
XBM03.D=El valor ''{0}'' suministrado como sistema de ordenaci\u00F3n no es v\u00E1lido. Se esperaba UCS_BASIC o TERRITORY_BASED.
R013=Mensaje de repetici\u00F3n ({0})\: {1}
X0Y54.S=El esquema ''{0}'' no se puede eliminar porque no est\u00E1 vac\u00EDo.
XIE04.S=Archivo de datos no encontrado\: {0}
X0Y72.S=La sustituci\u00F3n mediante inserci\u00F3n general no est\u00E1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
XCL21.S=Est\u00E1 intentando ejecutar una sentencia de definici\u00F3n de datos (CREATE, DROP o ALTER) mientras prepara una sentencia diferente. No est\u00E1 permitido. Puede suceder si ejecuta una sentencia de definici\u00F3n de datos desde un inicializador est\u00E1tico de una clase Java que se est\u00E1 utilizando desde una sentencia SQL.
XJ05C.S=No se puede establecer la constante de retenci\u00F3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00F3n global.
XSLAD.D=Registro de anotaci\u00F3n cronol\u00F3gica en instante {2} en archivo de anotaciones cronol\u00F3gicas {3} da\u00F1ado. Se esperaba una longitud de registro de anotaci\u00F3n cronol\u00F3gica de {0}, longitud real {1}.
X0Y45.S=La restricci\u00F3n de clave for\u00E1nea ''{0}'' no se puede a\u00F1adir o habilitar sobre la tabla {1} porque una o m\u00E1s claves for\u00E1neas no tienen claves referenciadas coincidentes.  
XBCXG.S=El suministrador de cifrado ''{0}'' no existe.
J129=se ha emitido un mandato Open Query (Abrir consulta) para una consulta que ya estaba abierta
XSDAL.S=El descriptor de contexto de registro {0} se\u00F1ala inesperadamente a una p\u00E1gina de desbordamiento.
X0Y63.S=El mandato de la tabla ''{0}'' no ha sido satisfactorio porque se han encontrado datos nulos en la(s) columna(s) de clave primaria o restricci\u00F3n/\u00EDndice \u00FAnico. Todas las columnas de una clave primaria o de \u00EDndice \u00FAnico deben ser no nulas.  
R004=Se ha detenido la funci\u00F3n de repetici\u00F3n secundaria para la base de datos ''{0}''.
