#Thu May 16 17:55:33 BRT 2013
XSDFH.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0435 \u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445; \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0432\u0432\u043E\u0434\u0430-\u0432\u044B\u0432\u043E\u0434\u0430 \u043F\u0440\u0438 \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u0444\u0430\u0439\u043B \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0439 \u043A\u043E\u043F\u0438\u0438 {0}.
XBCXH.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F encryptionAlgorithm, ''{0}''. \u041F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442\: \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C/\u0440\u0435\u0436\u0438\u043C_\u043E\u0431\u0440\u0430\u0442\u043D\u043E\u0439_\u0441\u0432\u044F\u0437\u0438/NoPadding.
X0Y28.S=\u041D\u0435\u043B\u044C\u0437\u044F \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0438\u043D\u0434\u0435\u043A\u0441 ''{0}'' \u0434\u043B\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}''.  \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438 \u043D\u0435 \u043C\u043E\u0433\u0443\u0442 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0438\u043D\u0434\u0435\u043A\u0441\u044B \u0434\u043B\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u044B\u0445 \u0442\u0430\u0431\u043B\u0438\u0446.
X0Y46.S=\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C\: \u0442\u0430\u0431\u043B\u0438\u0446\u0430, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043E\u043D\u043E \u0441\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F ({1}), \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
XCL13.S=\u041F\u043E\u0437\u0438\u0446\u0438\u044F \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 ''{0}'' \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432\u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0433\u043E \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D\u0430.  \u0427\u0438\u0441\u043B\u043E \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432 \u0434\u043B\u044F \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 \u0440\u0430\u0432\u043D\u043E ''{1}''.
XSDAM.S=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u0430 SQLData \u043A\u043B\u0430\u0441\u0441\u0430 {0}. \u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0439 \u043A\u043B\u0430\u0441\u0441.
XCL31.S=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u0437\u0430\u043A\u0440\u044B\u0442.
XIE05.S=\u0424\u0430\u0439\u043B \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043D\u0443\u043B\u0435\u0432\u044B\u043C. 
XSLAE.D=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u043F\u0438\u0441\u0430\u0442\u044C \u0438\u043B\u0438 \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0439 \u0444\u0430\u0439\u043B \u0432 {0}.
X0Y55.S=\u0427\u0438\u0441\u043B\u043E \u0441\u0442\u0440\u043E\u043A \u0432 \u0431\u0430\u0437\u043E\u0432\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u043D\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0447\u0438\u0441\u043B\u0443 \u0441\u0442\u0440\u043E\u043A, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u0432 \u043E\u0434\u043D\u043E\u043C \u0438\u0437 \u0438\u043D\u0434\u0435\u043A\u0441\u043E\u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u044B. \u0412 \u0438\u043D\u0434\u0435\u043A\u0441\u0435 ''{0}'' \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}.{2}'' \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 {3} \u0441\u0442\u0440\u043E\u043A(\u0430), \u043D\u043E \u0432 \u0431\u0430\u0437\u043E\u0432\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 {4} \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0441\u0442\u0440\u043E\u043A(\u0430).  \u0420\u0435\u043A\u043E\u043C\u0435\u043D\u0434\u0443\u0435\u043C\u043E\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435 \u043F\u043E \u0443\u0441\u0442\u0440\u0430\u043D\u0435\u043D\u0438\u044E \u043E\u0448\u0438\u0431\u043A\u0438 - \u0437\u0430\u043D\u043E\u0432\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0438\u043D\u0434\u0435\u043A\u0441.
XCL22.S=\u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 {0} \u043D\u0435\u043B\u044C\u0437\u044F \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043A\u0430\u043A \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 OUT, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E - \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 IN. 
XCL40.S=CASCADE \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430. (\u0412\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u044C \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043B\u0430 \u0431\u044B \u0446\u0438\u043A\u043B, \u0438\u0437-\u0437\u0430 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u0431\u044B\u043B\u0430 \u0431\u044B \u0441\u0432\u044F\u0437\u0430\u043D\u0430 \u043F\u0440\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u0438 \u0441\u0430\u043C\u0430 \u0441 \u0441\u043E\u0431\u043E\u0439. \u041E\u0434\u043D\u043E \u0438\u0437 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0445 \u043F\u0440\u0430\u0432\u0438\u043B \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0432 \u0446\u0438\u043A\u043B\u0435 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C CASCADE, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u044D\u0442\u0443 \u0432\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u044C \u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C, \u0435\u0441\u043B\u0438 \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F CASCADE.) 
XSAJG.U=\u043A\u0443\u0447\u0430
