#Thu May 16 17:55:33 BRT 2013
XSDFH.S=Die Datenbank kann nicht gesichert werden. Beim Schreiben in die Backup-Containerdatei {0} wurde eine E/A-Ausnahme empfangen.
R005=Schwerer Fehler bei Replication Slave f\u00FCr Datenbank''{0}''. Replikation wird angehalten
XBM04.D=Kollator-Unterst\u00FCtzung von JVM ist nicht verf\u00FCgbar f\u00FCr Datenbank-Gebietsschema ''{0}''.
XBCXH.S=Der Verschl\u00FCsselungsalgorithmus ''{0}'' hat nicht das richtige Format. Korrektes Format\: Algorithmus/Feedbackmodus/Keine Auff\u00FCllung.
X0Y28.S=Der Index ''{0}'' kann f\u00FCr die Systemtabelle ''{1}'' nicht erstellt werden. Benutzer k\u00F6nnen keine Indizes f\u00FCr Systemtabellen erstellen.
X0Y46.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig\: die referenzierte Tabelle {1} ist nicht vorhanden.
XCL13.S=Die Parameterposition ''{0}'' liegt au\u00DFerhalb des Bereichs. Die Parameteranzahl f\u00FCr diese vorbereitete Anweisung ist ''{1}''.
XSDAM.S=Ausnahme beim Wiederherstellen eines SQLData-Objekts der Klasse {0}. Es k\u00F6nnen keine Instanzen der angegebenen Klasse erstellt werden.
XCL31.S=Die Anweisung wurde geschlossen.
XIE05.S=Es muss eine Datendatei angegeben werden. 
XSLAE.D=Die Steuerdatei in {0} kann nicht geschrieben oder aktualisiert werden.
X0Y55.S=Die Zeilenanzahl in der Basistabelle stimmt nicht mit der Zeilenanzahl in mindestens einem der Indizes f\u00FCr die Tabelle \u00FCberein. Der Index ''{0}'' f\u00FCr Tabelle ''{1}.{2}'' hat {3} Zeilen, die Basistabelle jedoch {4} Zeilen. Zur Fehlerberichtigung wird empfohlen, den Index erneut zu erstellen.
XCL22.S=Der Parameter {0} kann nicht als OUT-Parameter registriert werden, da er ein IN-Parameter ist. 
XCL40.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Es w\u00FCrde eine Kreisbeziehung entstehen, in der eine Tabelle f\u00FCr das mehrstufige L\u00F6schen auf sich selbst verweisen w\u00FCrde. Eine der vorhandenen L\u00F6schregeln in der Beziehung ist nicht CASCADE. Die Beziehung kann demzufolge definiert werden, wenn die L\u00F6schregel nicht CASCADE lautet.) 
XSAJG.U=Heap-Speicher
