#Thu May 16 17:55:33 BRT 2013
XSDFH.S=No se puede realizar una copia de seguridad de la base de datos, se ha producido una Excepci\u00F3n de E/S al grabar en el archivo contenedor de copia de seguridad {0}.
R005=La repetici\u00F3n secundaria ha generado un error grave para la base de datos ''{0}''. Se detendr\u00E1 la repetici\u00F3n.
XBM04.D=Admisi\u00F3n de intercalaci\u00F3n no disponible de JVM para la configuraci\u00F3n regional de la base de datos ''{0}''.
XBCXH.S=El algoritmo de cifrado ''{0}'' no est\u00E1 en el formato correcto. El formato correcto es algoritmo/modalidadRetroalimentaci\u00F3n/NoPadding.
X0Y28.S=No se puede crear el \u00EDndice ''{0}'' en la tabla del sistema ''{1}''.  Los usuarios no pueden crear \u00EDndices en tablas del sistema.
X0Y46.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: la tabla referenciada {1} no existe.
XCL13.S=La posici\u00F3n del par\u00E1metro ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de par\u00E1metros de esta sentencia preparada es ''{1}''.
XSDAM.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. No se puede crear una instancia de la clase especificada.
XCL31.S=Sentencia cerrada.
XIE05.S=El archivo de datos no puede ser nulo. 
XSLAE.D=El archivo de control en {0} no se puede grabar o actualizar.
X0Y55.S=El n\u00FAmero de filas de la tabla base no coincide con el n\u00FAmero de filas de al menos 1 de los \u00EDndices de la tabla. El \u00EDndice ''{0}'' de la tabla ''{1}.{2}'' tiene {3} filas, pero la tabla base tiene {4} filas.  La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.
XCL22.S=No es posible registrar el par\u00E1metro ''{0}'' como un par\u00E1metro OUT puesto que es un par\u00E1metro IN. 
XCL40.S=La norma de supresi\u00F3n de la clave for\u00E1nea no puede ser CASCADE. (La relaci\u00F3n formar\u00EDa un ciclo que har\u00EDa que una tabla pudiera estar conectada para supresi\u00F3n consigo misma. Una de las normas de supresi\u00F3n existentes en el ciclo no es CASCADE, de forma que se puede definir esta relaci\u00F3n si la norma de supresi\u00F3n no es CASCADE). 
XSAJG.U=heap
