#Thu May 16 17:55:33 BRT 2013
XSDFI.S=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30EA\u30AB\u30D0\u30EA\u4E2D\u306B\u30C7\u30A3\u30B9\u30AF\u3078\u30C7\u30FC\u30BF\u3092\u66F8\u304D\u8FBC\u3082\u3046\u3068\u3057\u3066\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C7\u30A3\u30B9\u30AF\u304C\u6E80\u676F\u3067\u306A\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002 \u6E80\u676F\u306E\u5834\u5408\u306F\u3001\u4E0D\u8981\u306A\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3057\u3066\u304B\u3089\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3078\u306E\u63A5\u7D9A\u3092\u518D\u8A66\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002  \u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u304C\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3042\u308B\u3001\u30C7\u30A3\u30B9\u30AF\u306B\u969C\u5BB3\u304C\u3042\u308B\u3001\u307E\u305F\u306F\u30E1\u30C7\u30A3\u30A2\u306B\u4F55\u3089\u304B\u306E\u554F\u984C\u304C\u3042\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002  \u30B7\u30B9\u30C6\u30E0\u306B\u3066\u30DA\u30FC\u30B8 {0} \u306E\u51E6\u7406\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
XSDAN.S=\u30AF\u30E9\u30B9 {0} \u306E SQLData \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30EA\u30B9\u30C8\u30A2\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002 \u6307\u5B9A\u3055\u308C\u305F\u30AF\u30E9\u30B9\u3067\u7121\u8A31\u53EF\u306E\u30A2\u30AF\u30BB\u30B9\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
XCL14.S=\u5217\u4F4D\u7F6E ''{0}'' \u306F\u7BC4\u56F2\u5916\u3067\u3059\u3002  \u3053\u306E ResultSet \u306B\u5BFE\u3059\u308B\u5217\u6570\u306F ''{1}'' \u3067\u3059\u3002
XSAJH.U=\u30BD\u30FC\u30C8
X0Y83.S=\u8B66\u544A\: \u8868\u304B\u3089\u884C\u3092\u524A\u9664\u3057\u3066\u3044\u308B\u9593\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8 ID {1} \u306E\u7D22\u5F15\u3067\u3001\u57FA\u672C\u8868\u884C {0} \u306E\u7D22\u5F15\u884C\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002  \u3053\u306E\u554F\u984C\u306F\u3001\u524A\u9664\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u306E\u4E00\u90E8\u3068\u3057\u3066\u81EA\u52D5\u7684\u306B\u8A02\u6B63\u3055\u308C\u307E\u3057\u305F\u3002
X0Y38.S=\u8868 ''{1}'' \u304C\u5B58\u5728\u3057\u306A\u3044\u305F\u3081\u3001\u7D22\u5F15 ''{0}'' \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
2200V={0} \u6F14\u7B97\u5B50\u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u9805\u76EE\u3067\u3059\u3002\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u9805\u76EE\u306F\u6574\u5F62\u5F0F DOCUMENT \u30CE\u30FC\u30C9\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
XBM05.D={0} \u306E\u88FD\u54C1\u30D0\u30FC\u30B8\u30E7\u30F3\u60C5\u5831\u304C\u306A\u3044\u305F\u3081\u3001\u59CB\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
X0X57.S=\u578B ''{0}'' \u306E Java \u5024\u3092 SQL \u5024\u306B\u5165\u308C\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u304C\u3001\u5BFE\u5FDC\u3059\u308B SQL \u578B\u304C\u3042\u308A\u307E\u305B\u3093\u3002  \u3053\u306E Java \u5024\u306F\u3001\u304A\u305D\u3089\u304F\u30E1\u30BD\u30C3\u30C9\u547C\u3073\u51FA\u3057\u307E\u305F\u306F\u30D5\u30A3\u30FC\u30EB\u30C9\u30FB\u30A2\u30AF\u30BB\u30B9\u306E\u7D50\u679C\u3067\u3059\u3002
X0Y56.S=''{0}'' \u306F\u3001\u30B7\u30B9\u30C6\u30E0\u8868 ''{1}'' \u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
XCL50.S=\u524D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u304B\u3089\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002  \u30A2\u30AF\u30BB\u30B9\u3057\u3066\u3044\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u30FB\u30EC\u30D9\u30EB\u306F ''{0}'' \u3067\u3001\u3053\u306E\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u30FB\u30EC\u30D9\u30EB\u306F ''{1}'' \u3067\u3059\u3002    
XIE06.S=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u540D\u304C NULL \u3067\u3057\u305F\u3002
XCL05.S=Activation \u304C\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u307E\u3057\u305F\u3002\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 {0} \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
X0Y29.S=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 ''{1}'' \u306B\u304A\u3044\u3066\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''{0}'' \u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002TABLE ''{2}'' \u304C\u305D\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u5F93\u5C5E\u3057\u3066\u3044\u307E\u3059\u3002
XCL23.S=SQL \u578B\u756A\u53F7 ''{0}'' \u306F\u3001registerOutParameter() \u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u305F\u578B\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XSLAF.D=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u30C0\u30FC\u30C6\u30A3\u30FC\u30FB\u30C7\u30FC\u30BF\u30FB\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u4F7F\u3063\u3066\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
XBCXI.S=\u30D5\u30A3\u30FC\u30C9\u30D0\u30C3\u30AF\u30FB\u30E2\u30FC\u30C9 ''{0}'' \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u30D5\u30A3\u30FC\u30C9\u30D0\u30C3\u30AF\u30FB\u30E2\u30FC\u30C9\u306F CBC\u3001CFB\u3001OFB\u3001\u304A\u3088\u3073 ECB \u3067\u3059\u3002
R006=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u8907\u88FD\u30DE\u30B9\u30BF\u30FC\u306E\u63A5\u7D9A\u304C\u5931\u308F\u308C\u307E\u3057\u305F\u3002
XCL41.S=\u5916\u90E8\u30AD\u30FC\u306E\u524A\u9664\u898F\u5247\u306F CASCADE \u306B\u306F\u3067\u304D\u307E\u305B\u3093\u3002 (\u305D\u306E\u95A2\u4FC2\u306B\u3088\u308A\u3001\u5225\u306E\u8868\u304C\u3001\u7570\u306A\u308B\u524A\u9664\u898F\u5247\u3092\u6301\u3064\u8907\u6570\u306E\u30D1\u30B9\u3042\u308B\u3044\u306F\u3001SET NULL \u3068\u7B49\u3057\u3044\u524A\u9664\u898F\u5247\u3092\u6301\u3064\u8907\u6570\u306E\u30D1\u30B9\u3092\u4ECB\u3057\u3066\u540C\u3058\u8868\u3068\u9023\u7D50\u524A\u9664\u3055\u308C\u308B\u3082\u306E\u306B\u306A\u308A\u307E\u3059\u3002) 
