#Thu May 16 17:55:33 BRT 2013
X0Y38.S=Nelze vytvo\u0159it index ''{0}'', proto\u017Ee tabulka ''{1}'' neexistuje.
X0Y56.S=''{0}'' nen\u00ED povoleno v syst\u00E9mov\u00E9 tabulce ''{1}''.
XCL05.S=Aktivace je zav\u0159ena, operace {0} nen\u00ED povolena.
XCL23.S=\u010C\u00EDslo typu SQL ''{0}'' nen\u00ED typem podporovan\u00FDm metodou registerOutParameter().
XCL41.S=Pravidlem v\u00FDmazu ciz\u00EDho kl\u00ED\u010De nem\u016F\u017Ee b\u00FDt CASCADE. (Vztah by zp\u016Fsobil, \u017Ee jin\u00E1 tabulka by byla v r\u00E1mci v\u00FDmazu spojena se stejnou tabulkou p\u0159es n\u011Bkolik cest s r\u016Fzn\u00FDmi pravidly v\u00FDmazu nebo s pravidlem v\u00FDmazu, kter\u00E9 se rovn\u00E1 SET NULL.) 
XSAJH.U=t\u0159\u00EDd\u011Bn\u00ED
XSDFI.S=Byla zji\u0161t\u011Bna chyba p\u0159i pokusu o z\u00E1pis dat na disk b\u011Bhem n\u00E1pravy datab\u00E1ze. Zkontrolujte, zda disk datab\u00E1ze nen\u00ED zapln\u011Bn. Pokud ano, vyma\u017Ete nepot\u0159ebn\u00E9 soubory a zkuste znovu nav\u00E1zat p\u0159ipojen\u00ED k datab\u00E1zi. Tak\u00E9 je mo\u017En\u00E9, \u017Ee syst\u00E9m soubor\u016F slou\u017E\u00ED pouze pro \u010Dten\u00ED, \u017Ee do\u0161lo k selh\u00E1n\u00ED disku nebo k n\u011Bjak\u00E9mu jin\u00E9mu probl\u00E9mu s m\u00E9diem. Syst\u00E9m zjistil chybu p\u0159i zpracov\u00E1n\u00ED str\u00E1nky {0}.
XBM05.D=Spu\u0161t\u011Bn\u00ED selhalo kv\u016Fli chyb\u011Bj\u00EDc\u00EDm informac\u00EDm o verzi produktu pro {0}.
X0X57.S=Byl u\u010Din\u011Bn pokus o vlo\u017Een\u00ED hodnoty Javy typu ''{0}'' do hodnoty SQL, ale neexistuje \u017E\u00E1dn\u00FD odpov\u00EDdaj\u00EDc\u00ED typ SQL. Hodnota Javy je pravd\u011Bpodobn\u011B v\u00FDsledkem vol\u00E1n\u00ED metody nebo p\u0159\u00EDstupu k poli.
XBCXI.S=Re\u017Eim zp\u011Btn\u00E9 vazby ''{0}'' nen\u00ED podporov\u00E1n. Podporovan\u00E9 re\u017Eimy zp\u011Btn\u00E9 vazby jsou CBC, CFB, OFB a ECB.
XCL14.S=Pozice sloupce ''{0}'' je mimo rozsah. Po\u010Det sloupc\u016F pro tuto mno\u017Einu v\u00FDsledk\u016F je ''{1}''.
2200V=Neplatn\u00E1 polo\u017Eka kontextu pro oper\u00E1tor {0}; polo\u017Eky kontextu musej\u00ED b\u00FDt dob\u0159e formovan\u00FDmi uzly DOCUMENT.
X0Y83.S=VAROV\u00C1N\u00CD\: P\u0159i v\u00FDmazu \u0159\u00E1dku z tabulky nebyl v indexu s ID sm\u00ED\u0161en\u00E9ho objektu {1} nalezen \u0159\u00E1dek indexu pro \u0159\u00E1dek z\u00E1kladn\u00ED tabulky {0}. Tento probl\u00E9m byl automaticky opraven v r\u00E1mci operace v\u00FDmazu.
XSDAN.S=Do\u0161lo k v\u00FDjimce b\u011Bhem obnovy objektu SQLData t\u0159\u00EDdy {0}. Uveden\u00E1 t\u0159\u00EDda narazila na v\u00FDjimku neplatn\u00E9ho p\u0159\u00EDstupu.
XCL50.S=Upgrade datab\u00E1ze z p\u0159edchoz\u00ED verze nen\u00ED podporov\u00E1n. Datab\u00E1ze, k n\u00ED\u017E se p\u0159istupuje, je na \u00FArovni verze ''{0}'', tento software je na \u00FArovni verze ''{1}''.   
XIE06.S=Jm\u00E9no entity m\u011Blo hodnotu ''null''.
XSLAF.D=Datab\u00E1ze, kter\u00E1 slou\u017E\u00ED pouze pro \u010Dten\u00ED, byla vytvo\u0159ena s nepr\u00E1zdn\u00FDmi vyrovn\u00E1vac\u00EDmi pam\u011Btmi dat.
