#Thu May 16 17:55:33 BRT 2013
X0Y38.S=A(z) ''{0}'' index nem hozhat\u00F3 l\u00E9tre, mivel a(z) ''{1}'' t\u00E1bla nem l\u00E9tezik.
X0Y56.S=A(z) ''{0}'' ''{1}'' rendszert\u00E1bl\u00E1n nem megengedett.
XCL05.S=Az aktiv\u00E1l\u00E1s bez\u00E1rult, a(z) {0} m\u0171velet nem megengedett.
XCL23.S=A(z) ''{0}'' SQL t\u00EDpussz\u00E1m registerOutParameter() \u00E1ltal nem t\u00E1mogatott t\u00EDpus.
XCL41.S=Az idegen kulcs t\u00F6rl\u00E9si szab\u00E1lya nem lehet CASCADE. (A kapcsolat hat\u00E1s\u00E1ra m\u00E1sik t\u00E1bla t\u00F6rl\u00E9si szempontb\u00F3l kapcsol\u00F3dna ugyanahhoz a t\u00E1bl\u00E1hoz t\u00F6bb el\u00E9r\u00E9si \u00FAton kereszt\u00FCl k\u00FCl\u00F6nb\u00F6z\u0151 t\u00F6rl\u00E9si szab\u00E1lyokkal vagy a SET NULL-lal egyez\u0151 t\u00F6rl\u00E9si szab\u00E1llyal.) 
XSAJH.U=rendez\u00E9s
XSDFI.S=Hiba t\u00F6rt\u00E9nt az adatok lemezre \u00EDr\u00E1s\u00E1ra tett k\u00EDs\u00E9rlet sor\u00E1n az adatb\u00E1zis helyre\u00E1ll\u00EDt\u00E1sa sor\u00E1n.  Ellen\u0151rizze, hogy az adatb\u00E1zis lemeze nincs-e tele. Ha igen, akkor t\u00F6r\u00F6lje a sz\u00FCks\u00E9gtelen f\u00E1jlokat majd pr\u00F3b\u00E1lkozzon \u00FAjra csatlakozni az adatb\u00E1zishoz.  Ezen k\u00EDv\u00FCl lehets\u00E9ges, hogy a f\u00E1jlrendszer \u00EDr\u00E1sv\u00E9dett, a lemez meghib\u00E1sodott vagy m\u00E1s probl\u00E9ma van az adathordoz\u00F3val.  A rendszer hib\u00E1ba \u00FCtk\u00F6z\u00F6tt a(z) {0} oldal feldolgoz\u00E1sa k\u00F6zben.
XBM05.D=Az ind\u00EDt\u00E1s a(z) {0} hi\u00E1nyz\u00F3 term\u00E9kv\u00E1ltozat-inform\u00E1ci\u00F3i miatt meghi\u00FAsult.
X0X57.S=''{0}'' t\u00EDpus\u00FA Java \u00E9rt\u00E9k SQL \u00E9rt\u00E9kbe helyez\u00E9s\u00E9re t\u00F6rt\u00E9nt k\u00EDs\u00E9rlet, de nincs megfelel\u0151 SQL t\u00EDpus.  A Java \u00E9rt\u00E9k val\u00F3sz\u00EDn\u0171leg met\u00F3dush\u00EDv\u00E1s vagy mez\u0151hozz\u00E1f\u00E9r\u00E9s eredm\u00E9nye.
XBCXI.S=A(z) ''{0}'' visszajelz\u00E9si m\u00F3d nem t\u00E1mogatott. T\u00E1mogatott visszajelz\u00E9si m\u00F3dok\: CBC, CFB, OFB \u00E9s ECB.
XCL14.S=A(z) ''{0}'' oszloppoz\u00EDci\u00F3 k\u00EDv\u00FCl van a megengedett tartom\u00E1nyon.  A ResultSet oszlopainak sz\u00E1ma ''{1}''.
2200V=\u00C9rv\u00E9nytelen kontextuselem a(z) {0} oper\u00E1torhoz, a kontextuselemeknek szab\u00E1lyosan form\u00E1zott DOCUMENT csom\u00F3pontokank kell lenni\u00FCk.
X0Y83.S=FIGYELMEZTET\u00C9S\: A t\u00E1bla sor\u00E1nak t\u00F6rl\u00E9se sor\u00E1n a(z) {0} alapt\u00E1blasor indexsora a(z) {1} konglomer\u00E1ci\u00F3s azonos\u00EDt\u00F3hoz nem tal\u00E1lhat\u00F3.  A probl\u00E9ma automatikusan kijav\u00EDt\u00E1sra ker\u00FClt a t\u00F6rl\u00E9s m\u0171velet r\u00E9szek\u00E9nt.
XSDAN.S=A(z) {0} oszt\u00E1ly egy SQLData objektum\u00E1nak vissza\u00E1ll\u00EDt\u00E1sa sor\u00E1n kiv\u00E9tel t\u00F6rt\u00E9nt. A megadott oszt\u00E1ly illeg\u00E1lis hozz\u00E1f\u00E9r\u00E9s kiv\u00E9telbe \u00FCtk\u00F6z\u00F6tt.
XCL50.S=Az adatb\u00E1zis friss\u00EDt\u00E9se kor\u00E1bbi v\u00E1ltozatr\u00F3l nem t\u00E1mogatott.  Az el\u00E9rend\u0151 adatb\u00E1zis ''{0}'', a szoftver pedig ''{1}'' v\u00E1ltozatszint\u0171.    
XIE06.S=Az entit\u00E1sn\u00E9v nem lehet \u00FCres.
XSLAF.D=\u00CDr\u00E1sv\u00E9dett adatb\u00E1zis ker\u00FClt l\u00E9trehoz\u00E1sra piszkos adatpufferekkel.
