#Thu May 16 17:55:33 BRT 2013
XSDFI.S=Erreur lors de la tentative d''\u00E9criture de donn\u00E9es vers le disque dur au cours de la restauration de la base de donn\u00E9es.  V\u00E9rifiez que le disque dur de base de donn\u00E9es n''est pas plein. Si c''est le cas, effacez les fichiers superflus et retentez de vous connecter \u00E0 la base de donn\u00E9es.  Il est \u00E9galement possible que le syst\u00E8me de fichiers soit en lecture seule, que le disque soit tomb\u00E9 en panne ou qu''un autre incident soit survenu sur le support.  Le syst\u00E8me a rencontr\u00E9 une erreur lors du traitement de la page {0}.
XSDAN.S=Une exception s''est produite au cours de la restauration d''un objet SQLData de classe {0}. La classe indiqu\u00E9e a rencontr\u00E9 une exception d''acc\u00E8s incorrecte.
XCL14.S=La position de colonne ''{0}'' est en dehors des limites.  Le nombre de colonnes de ce ResultSet est ''{1}''.
XSAJH.U=sort
X0Y83.S=AVERTISSEMENT \: Lors de la suppression d''une ligne d''une table, la ligne d''index correspondant \u00E0 la ligne de la table de base {0} n''a pas \u00E9t\u00E9 trouv\u00E9e dans l''index avec l''ID de conglom\u00E9rat {1}.  Ce probl\u00E8me a \u00E9t\u00E9 corrig\u00E9 automatiquement dans le cadre de l''op\u00E9ration de suppression.
X0Y38.S=Impossible de cr\u00E9er l''index ''{0}'' car la table ''{1}'' n''existe pas.
2200V=El\u00E9ment contextuel incorrect pour l''op\u00E9rateur {0} ; les \u00E9l\u00E9ments contextuels doivent \u00EAtre des noeuds de type DOCUMENT syntaxiquement corrects.
XBM05.D=Echec du d\u00E9marrage en raison d''informations absentes sur la version du produit pour {0}.
X0X57.S=Une tentative de placement d''une valeur Java de type ''{0}'' dans une valeur SQL a \u00E9t\u00E9 effectu\u00E9e alors qu''il n''existe pas de type SQL correspondant.  La valeur Java est probablement le r\u00E9sultat d''un appel de m\u00E9thode ou de l''acc\u00E8s \u00E0 une zone.
X0Y56.S=''{0}'' n''est pas autoris\u00E9 sur la table syst\u00E8me ''{1}''.
XCL50.S=La mise \u00E0 niveau de la base de donn\u00E9es \u00E0 partir d''une version ant\u00E9rieure n''est pas prise en charge.  Le niveau de version de la base de donn\u00E9es est ''{0}'' et celui du logiciel est ''{1}''.    
XIE06.S=Le nom de l''entit\u00E9 \u00E9tait nul.
XCL05.S=L''activation est ferm\u00E9e, l''op\u00E9ration {0} n''est pas autoris\u00E9e.
X0Y29.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}'' car TABLE ''{2}'' d\u00E9pend de cet objet.
XCL23.S=Le type SQL num\u00E9ro ''{0}'' n''est pas un type pris en charge par registerOutParameter().
XSLAF.D=Une base de donn\u00E9es en lecture seule a \u00E9t\u00E9 cr\u00E9\u00E9e avec des m\u00E9moires tampon de donn\u00E9es non valides.
XBCXI.S=Le mode commentaires ''{0}'' n''est pas pris en charge. Les modes commentaires pris en charge sont CBC, CFB, OFB et ECB.
R006=Perte de la connexion avec le ma\u00EEtre de r\u00E9plication de la base de donn\u00E9es ''{0}''.
XCL41.S=la r\u00E8gle de suppression de la cl\u00E9 primaire ne peut pas \u00EAtre CASCADE. Dans le cadre de la relation, une d\u00E9pendance en cas de suppression est \u00E9tablie entre une autre table et la m\u00EAme table par le biais de plusieurs chemins associ\u00E9s \u00E0 des r\u00E8gles de suppression diff\u00E9rentes ou \u00E0 une r\u00E8gle de suppression SET NULL.) 
