#Thu May 16 17:55:33 BRT 2013
XSDFI.S=Se ha producido un error al intentar grabar datos en el disco durante la recuperaci\u00F3n de la base de datos.  Compruebe que el disco de la base de datos no est\u00E9 lleno. Si est\u00E1 lleno, suprima los archivos innecesarios y vuelva a intentar conectarse a la base de datos.  Tambi\u00E9n es posible que el sistema de archivos sea de s\u00F3lo lectura, que el disco haya fallado o que se haya producido alg\u00FAn otro problema en el soporte.  El sistema ha encontrado un error mientras procesaba la p\u00E1gina {0}.
XSDAN.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. La clase especificada ha encontrado una excepci\u00F3n de acceso no permitida.
XCL14.S=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de columnas de esta sentencia ResultSet es ''{1}''.
XSAJH.U=sort
X0Y83.S=AVISO\: al suprimir una fila de la tabla no se ha encontrado la fila de \u00EDndice de la fila de la tabla base {0} en el \u00EDndice con el id de conglomerado {1}.  Este problema se ha corregido autom\u00E1ticamente como parte de la operaci\u00F3n de supresi\u00F3n.
X0Y38.S=No se puede crear el \u00EDndice ''{0}'' porque la tabla ''{1}'' no existe.
2200V=Elemento de contexto no v\u00E1lido para el operador {0}; los elementos de contexto deben ser nodos DOCUMENT formados correctamente.
XBM05.D=Error de arranque debido a la falta de informaci\u00F3n sobre la versi\u00F3n del producto para {0}.
X0X57.S=Se ha realizado un intento de situar un valor Java de tipo ''{0}'' en un valor SQL, pero no existe el tipo SQL correspondiente.  El valor Java es probablemente el resultado de una llamada de m\u00E9todo o acceso de campo.
X0Y56.S=''{0}'' no se permite en la tabla del sistema ''{1}''.
XCL50.S=No se ha soporte a una actualizaci\u00F3n de base de datos de una versi\u00F3n anterior.  La base de datos a la que se accede est\u00E1 al nivel de versi\u00F3n ''{0}'', este software est\u00E1 al nivel de versi\u00F3n ''{1}''.    
XIE06.S=Nombre de entidad nulo.
XCL05.S=Activaci\u00F3n cerrada, operaci\u00F3n {0} no permitida.
X0Y29.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque TABLE ''{2}'' depende de ese objeto.
XCL23.S=El n\u00FAmero de tipo SQL ''{0}'' no es un tipo soportado por registerOutParameter().
XSLAF.D=Se ha creado una base de datos de s\u00F3lo lectura con almacenamientos intermedios de datos dirty.
XBCXI.S=La modalidad de retroalimentaci\u00F3n ''{0}'' no est\u00E1 soportada. Las modalidades de retroalimentaci\u00F3n soportadas son CBC, CFB, OFB y ECB.
R006=Se ha perdido la conexi\u00F3n con la repetici\u00F3n principal de la base de datos ''{0}''.
XCL41.S=La norma de supresi\u00F3n de la clave for\u00E1nea no puede ser CASCADE. (La relaci\u00F3n har\u00EDa que otra tabla estuviera conectada para suprimir con la misma tabla a trav\u00E9s de distintas v\u00EDas con distintas normas de supresi\u00F3n o con normas de supresi\u00F3n iguales a SET NULL). 
