#Thu May 16 17:55:33 BRT 2013
XSDFI.S=Bei dem Versuch, w\u00E4hrend der Datenbankwiederherstellung Daten auf Platte zu schreiben, wurde ein Fehler festgestellt. \u00DCberpr\u00FCfen Sie, ob die Platte mit der Datenbank voll ist. Sollte dies der Fall sein, l\u00F6schen Sie nicht ben\u00F6tigte Dateien und versuchen Sie erneut, eine Verbindung zur Datenbank herzustellen. Es kann auch sein, dass das Dateisystem schreibgesch\u00FCtzt ist oder ein Datentr\u00E4gerfehler vorliegt. Das System hat bei der Verarbeitung der Seite {0} einen Fehler festgestellt.
XSDAN.S=Ausnahme beim Wiederherstellen eines SQLData-Objekts der Klasse {0}. Die angegebene Klasse hat eine Ausnahme durch unzul\u00E4ssigen Zugriff festgestellt.
XCL14.S=Die Spaltenposition ''{0}'' befindet sich au\u00DFerhalb des Bereichs. Die Anzahl der Spalten f\u00FCr dieses ResultSet liegt bei ''{1}''.
XSAJH.U=Sortierung
X0Y83.S=WARNUNG\: Beim L\u00F6schen einer Zeile aus einer Tabelle wurde die Indexzeile f\u00FCr die Zeile {0} der Basistabelle im Index mit der Konglomerat-ID {1} nicht gefunden. Dieser Fehler wurde automatisch im Rahmen der L\u00F6schoperation behoben.
X0Y38.S=Der Index ''{0}'' kann nicht erstellt werden, weil die Tabelle ''{1}'' nicht vorhanden ist.
2200V=Ung\u00FCltiges Kontextelement f\u00FCr den Operator {0}. Kontextelemente m\u00FCssen korrekt formatierte DOCUMENT-Knoten sein.
XBM05.D=Der Systemstart ist aufgrund der fehlenden Produktversionsnummer f\u00FCr {0} gescheitert.
X0X57.S=Es wurde versucht, einen Java-Wert vom Typ ''{0}'' in einen SQL-Wert aufzunehmen. Es ist jedoch kein entsprechender SQL-Typ vorhanden. Der Java-Wert ist wahrscheinlich das Ergebnis eines Methodenaufrufs oder Feldzugriffs.
X0Y56.S=''{0}'' ist f\u00FCr die Systemtabelle ''{1}'' unzul\u00E4ssig.
XCL50.S=Ein Upgrade f\u00FCr eine fr\u00FChere Version der Datenbank wird nicht unterst\u00FCtzt. Die Datenbank, auf die zugegriffen wird, hat den Versionsstand ''{0}'' und diese Software den Versionsstand ''{1}''. 
XIE06.S=Der Name der Definitionseinheit wurde nicht angegeben.
XCL05.S=Die Aktivierung wurde geschlossen. Die Operation {0} ist unzul\u00E4ssig.
X0Y29.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil die Tabelle ''{2}'' von diesem Objekt abh\u00E4ngt.
XCL23.S=Die SQL-Typnummer ''{0}'' ist kein Typ, der von registerOutParameter() unterst\u00FCtzt wird.
XSLAF.D=Eine schreibgesch\u00FCtzte Datenbank wurde mit benutzten Datenpuffern erstellt.
XBCXI.S=Der Feedbackmodus ''{0}'' wird nicht unterst\u00FCtzt. Unterst\u00FCtzte Feedbackmodi sind CBC, CFB, OFB und ECB.
R006=Verbindung unterbrochen zum Replication Master von Datenbank ''{0}''.
XCL41.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Die Beziehung w\u00FCrde dazu f\u00FChren, dass eine andere Tabelle \u00FCber mehrere Pfade mit verschiedenen L\u00F6schregeln oder der einheitlichen L\u00F6schregel SET NULL f\u00FCr das mehrstufige L\u00F6schen auf dieselbe Tabelle verweisen w\u00FCrde.)
