#Thu May 16 17:55:33 BRT 2013
X0Y38.S=N\u00E3o \u00E9 poss\u00EDvel criar o \u00EDndice ''{0}'', porque a tabela ''{1}'' n\u00E3o existe.
X0Y56.S=''{0}'' n\u00E3o \u00E9 permitido na tabela Sistema''{1}''.
XCL05.S=Ativa\u00E7\u00E3o fechada, opera\u00E7\u00E3o {0} n\u00E3o permitida.
XCL23.S=O n\u00FAmero do tipo SQL ''{0}'' n\u00E3o \u00E9 um tipo suportado por registerOutParameter().
XCL41.S=A regra de exclus\u00E3o da chave estrangeira n\u00E3o pode ser CASCADE (O relacionamento faria com que outra tabela fosse conectada para exclus\u00E3o com a mesma tabela atrav\u00E9s de diversos caminhos com diferentes regras de exclus\u00E3o, ou com a regra de exclus\u00E3o igual a SET NULL).
XSAJH.U=sort
XSDFI.S=Erro encontrado ao tentar escrever dados no disco durante a recupera\u00E7\u00E3o do banco de dados.  Verifique se o disco da banco de dados n\u00E3o est\u00E1 cheio. Se estiver remova os arquivos desnecess\u00E1rios, e tente conectar ao banco de dados.  Tamb\u00E9m \u00E9 poss\u00EDvel que o sistema de arquivos seja apenas-de-leitura, ou tenha havido falha no disco, ou algum outro tipo de problema com a m\u00EDdia.  O sistema encontrou erro ao processar a p\u00E1gina {0}.
XBM05.D=Falha na inicializa\u00E7\u00E3o devido a aus\u00EAncia de informa\u00E7\u00E3o sobre a vers\u00E3o do produto para {0}.
X0X57.S=Tentativa de colocar um valor Java do tipo ''{0}'' em um valor SQL, mas n\u00E3o existe tipo SQL correspondente.  O valor Java provavelmente \u00E9 o resultado de uma chamada de m\u00E9todo ou acesso a campo.
XBCXI.S=O modo de feedback ''{0}'' n\u00E3o \u00E9 suportado. Os modos de feedback suportados s\u00E3o CBC, CFB, OFB e ECB.
XCL14.S=A posi\u00E7\u00E3o da coluna ''{0}'' est\u00E1 fora da faixa.  O n\u00FAmero de colunas desse ResultSet \u00E9 ''{1}''.
2200V=Item de contexto inv\u00E1lido para o operador {0}; itens de contexto devem ser n\u00F3s DOCUMENT bem-formados.
X0Y83.S=ADVERT\u00CANCIA\: Durante a exclus\u00E3o de uma linha da tabela, a linha do \u00EDndice para a linha da tabela base {0} n\u00E3o foi encontrada no \u00EDndice com id de conglomerado {1}.  Esse problema foi automaticamente corrigido como parte da opera\u00E7\u00E3o de exclus\u00E3o.
XSDAN.S=Exce\u00E7\u00E3o durante a restaura\u00E7\u00E3o de um objeto SQLData de classe {0}. A classe especificada encontrou uma exce\u00E7\u00E3o de acesso inv\u00E1lido.
XCL50.S=A atualiza\u00E7\u00E3o do banco de dados a partir de uma vers\u00E3o anterior n\u00E3o \u00E9 suportado.  O banco de dados sendo acessado est\u00E1 no n\u00EDvel de vers\u00E3o ''{0}'', e este software est\u00E1 no n\u00EDvel de vers\u00E3o ''{1}''.
XIE06.S=A entidade (tabela/vis\u00E3o) n\u00E3o existe no banco de dados.
XSLAF.D=Foi criado um banco de dados apenas-de-leitura com buffers de dados sujos.
