#Thu May 16 17:55:33 BRT 2013
X0X67.S=Sloupce typu ''{0}'' nelze pou\u017E\u00EDt v p\u0159\u00EDkazech CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT nebo DISTINCT, proto\u017Ee porovn\u00E1n\u00ED tohoto typu nejsou podporov\u00E1na.
X0X85.S=Index ''{0}'' nebyl vytvo\u0159en, proto\u017Ee ''{1}'' nen\u00ED platn\u00FDm typem indexu.
X0Y57.S=Sloupec, kter\u00FD nem\u016F\u017Ee nab\u00FDvat hodnoty ''null'', nelze p\u0159idat do tabulky ''{0}'', proto\u017Ee tabulka obsahuje alespo\u0148 jeden \u0159\u00E1dek. Sloupce, kter\u00E9 nemohou nab\u00FDvat hodnoty ''null'', lze p\u0159id\u00E1vat pouze do pr\u00E1zdn\u00FDch tabulek.
XCL24.S=Parametr {0} se zd\u00E1 b\u00FDt v\u00FDstupn\u00EDm parametrem, ale nebyl tak ozna\u010Den metodou registerOutParameter(). Pokud se nejedn\u00E1 o v\u00FDstupn\u00ED parametr, mus\u00ED b\u00FDt nastaven na typ {1}.
XSAJI.U=vn\u011Bj\u0161\u00ED
XCL42.S=CASCADE
2200W=Chyba serializace XQuery\: Pokus o serializaci jednoho nebo v\u00EDce uzl\u016F Atribut vy\u0161\u0161\u00ED \u00FArovn\u011B.
XBM06.D=Spu\u0161t\u011Bn\u00ED selhalo. K za\u0161ifrovan\u00E9 datab\u00E1zi nelze p\u0159istupovat bez spr\u00E1vn\u00E9ho zav\u00E1d\u011Bc\u00EDho hesla.  
XBCXJ.S=Aplikace pou\u017E\u00EDv\u00E1 verzi JCE (Java Cryptography Extension) star\u0161\u00ED ne\u017E 1.2.1. P\u0159ejd\u011Bte na JCE 1.2.1 a zopakujte operaci.    
X0Y66.S=Nelze zadat operaci commit ve vno\u0159en\u00E9m spojen\u00ED, kdy\u017E se v nad\u0159\u00EDzen\u00E9m spojen\u00ED nach\u00E1z\u00ED nevy\u0159\u00EDzen\u00E1 operace.
XCL15.S=Vyskytla se v\u00FDjimka ClassCastException p\u0159i vol\u00E1n\u00ED metody compareTo() na objekt ''{0}''. Parametr metody compareTo() je ze t\u0159\u00EDdy ''{1}''.
XCL33.S=Tabulku nelze definovat tak, aby byla z\u00E1visl\u00E1 na tabulce {0}, kv\u016Fli omezen\u00EDm pravidla v\u00FDmazu. (Vztah se odkazuje s\u00E1m na sebe a v pravidle v\u00FDmazu SET NULL ji\u017E existuje vztah, kter\u00FD se odkazuje s\u00E1m na sebe.) 
XCL51.S=Po\u017Eadovan\u00E1 funkce se nem\u016F\u017Ee odkazovat na tabulky ve sch\u00E9matu SESSION.
XIE07.S=Odd\u011Blova\u010De pol\u00ED a z\u00E1znam\u016F nemohou b\u00FDt pod\u0159et\u011Bzci sebe sama. 
