#Thu May 16 17:55:33 BRT 2013
X0X67.S=Las columnas de tipo ''{0}'' no se pueden utilizar en sentencias CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT o DISTINCT, porque no se soportan las comparaciones de ese tipo.
X0X85.S=No se ha creado el \u00EDndice ''{0}'' porque ''{1}'' no es un tipo de \u00EDndice v\u00E1lido.
X0Y57.S=No se puede a\u00F1adir una columna que no acepta nulos a la tabla ''{0}'' porque la tabla contiene al menos una fila. Las columnas que no aceptan nulos s\u00F3lo pueden a\u00F1adirse en tablas vac\u00EDas.
XCL24.S=El par\u00E1metro {0} parece ser un par\u00E1metro de salida, pero no ha sido designado de esa forma por registerOutParameter().  Si no es un par\u00E1metro de salida, entonces debe establecerse como del tipo {1}.
XSAJI.U=externa
XCL42.S=CASCADE
XBM06.D=Error de arranque. No se puede acceder a una base de datos cifrada sin la contrase\u00F1a de arranque correcta.  
2200W=Error de serializaci\u00F3n de XQuery\: Se ha intentado serializar uno o m\u00E1s nodos de Atributo de nivel superior.
XBCXJ.S=La aplicaci\u00F3n est\u00E1 utilizando una versi\u00F3n de JCE (Java Cryptography Extension) anterior a la 1.2.1.  Actualice a JCE 1.2.1 e intente de nuevo la operaci\u00F3n.    
XCL15.S=Se ha producido una ClassCastException al llamar al m\u00E9todo compareTo() sobre un objeto ''{0}''.  El par\u00E1metro para compareTo() es de clase ''{1}''.
X0Y66.S=No se puede emitir comprometer en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n padre.
XCL33.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00F3n. (La relaci\u00F3n es de autoreferencia y ya existe una relaci\u00F3n de autoreferencia con la norma de supresi\u00F3n SET NULL). 
XSDAO.S=Error interno\: la p\u00E1gina {0} a la que se intenta acceder se ha enclavado dos veces.
X0Y84.S=Demasiada contenci\u00F3n en la secuencia {0}.
XCL51.S=La funci\u00F3n solicitada no puede hacer referencia a tablas en el esquema SESSION.
R007=Se ha iniciado la funci\u00F3n de repetici\u00F3n principal para la base de datos ''{0}''.
XIE07.S=Los separadores de campo y registro no pueden ser una subserie uno de otro. 
