#Thu May 16 17:55:33 BRT 2013
X0X67.S=\u0421\u0442\u043E\u043B\u0431\u0446\u044B \u0442\u0438\u043F\u0430 ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430\u0445 CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT \u0438 DISTINCT, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0434\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0442\u0438\u043F\u0430 \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u0435.
X0X85.S=\u0418\u043D\u0434\u0435\u043A\u0441 ''{0}'' \u043D\u0435 \u0441\u043E\u0437\u0434\u0430\u043D, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 ''{1}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0442\u0438\u043F\u043E\u043C \u0438\u043D\u0434\u0435\u043A\u0441\u0430.
X0Y57.S=\u041D\u0435\u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u0439 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 \u043D\u0435\u043B\u044C\u0437\u044F \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 ''{0}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u043D\u0443 \u0441\u0442\u0440\u043E\u043A\u0443. \u041D\u0435\u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u044B \u043C\u043E\u0436\u043D\u043E \u0434\u043E\u0431\u0430\u0432\u043B\u044F\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043F\u0443\u0441\u0442\u044B\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B.
XCL24.S=\u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 {0}, \u043F\u043E\u0445\u043E\u0436\u0435, \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432\u044B\u0445\u043E\u0434\u043D\u044B\u043C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C, \u043D\u043E \u043E\u043D \u043D\u0435 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D \u043A\u0430\u043A \u0442\u0430\u043A\u043E\u0432\u043E\u0439 \u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 registerOutParameter().  \u0415\u0441\u043B\u0438 \u044D\u0442\u043E \u043D\u0435 \u0432\u044B\u0445\u043E\u0434\u043D\u043E\u0439 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440, \u0442\u043E \u0435\u043C\u0443 \u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u043F\u0440\u0438\u0441\u0432\u043E\u0438\u0442\u044C \u0442\u0438\u043F {1}.
XSAJI.U=\u0432\u043D\u0435\u0448\u043D\u044F\u044F
XCL42.S=CASCADE
2200W=\u041E\u0448\u0438\u0431\u043A\u0430 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 XQuery\: \u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u043E\u0434\u0438\u043D \u0438\u043B\u0438 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0443\u0437\u043B\u043E\u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u0432\u0435\u0440\u0445\u043D\u0435\u0433\u043E \u0443\u0440\u043E\u0432\u043D\u044F.
XBM06.D=\u0417\u0430\u043F\u0443\u0441\u043A \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0441\u044F \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E. \u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u0437\u0430\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u0431\u0435\u0437 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438.  
XBCXJ.S=\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442 Java Cryptography Extension (JCE) \u0431\u043E\u043B\u0435\u0435 \u0440\u0430\u043D\u043D\u0435\u0439 \u0432\u0435\u0440\u0441\u0438\u0438, \u0447\u0435\u043C 1.2.1.  \u041F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0438\u0442\u0435 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0435 \u0434\u043E JCE 1.2.1 \u0438 \u0441\u043D\u043E\u0432\u0430 \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044E.    
X0Y66.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u0435 \u0432\u043E \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u043C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438, \u0435\u0441\u043B\u0438 \u0432 \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u044C\u0441\u043A\u043E\u043C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438 \u0435\u0441\u0442\u044C \u043E\u0442\u043B\u043E\u0436\u0435\u043D\u043D\u0430\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F.
XCL15.S=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 ClassCastException \u043F\u0440\u0438 \u0432\u044B\u0437\u043E\u0432\u0435 \u043C\u0435\u0442\u043E\u0434\u0430 compareTo() \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u0430 ''{0}''.  \u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C \u0434\u043B\u044F compareTo() \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043A\u043B\u0430\u0441\u0441 ''{1}''.
XCL33.S=\u0422\u0430\u0431\u043B\u0438\u0446\u0443 \u043D\u0435\u043B\u044C\u0437\u044F \u0437\u0430\u0434\u0430\u0442\u044C \u043A\u0430\u043A \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u0443\u044E \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u044B {0} \u0438\u0437-\u0437\u0430 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0439 \u043F\u0440\u0430\u0432\u0438\u043B \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F. (\u0412\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u044C \u0441\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F \u0441\u0430\u043C\u0430 \u043D\u0430 \u0441\u0435\u0431\u044F, \u0430 \u0441\u0441\u044B\u043B\u0430\u044E\u0449\u0430\u044F\u0441\u044F \u0441\u0430\u043C\u0430 \u043D\u0430 \u0441\u0435\u0431\u044F \u0432\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u044C \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u0441\u043E\u0447\u0435\u0442\u0430\u043D\u0438\u0438 \u0441 \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F SET NULL.) 
XCL51.S=\u0417\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0441\u0441\u044B\u043B\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0432 \u0441\u0445\u0435\u043C\u0435 SESSION.
XIE07.S=\u0420\u0430\u0437\u0434\u0435\u043B\u0438\u0442\u0435\u043B\u0438 \u043F\u043E\u043B\u0435\u0439 \u0438 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043D\u0435 \u043C\u043E\u0433\u0443\u0442 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u043F\u043E\u0434\u0441\u0442\u0440\u043E\u043A\u0438 \u0434\u0440\u0443\u0433 \u0434\u0440\u0443\u0433\u0430. 
