#Thu May 16 17:55:33 BRT 2013
X0X67.S=''{0}'' t\u00EDpus\u00FA oszlop CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT vagy DISTINCT utas\u00EDt\u00E1sban nem haszn\u00E1lhat\u00F3, mivel az \u00F6sszehasonl\u00EDt\u00E1sok az adott t\u00EDpus eset\u00E9n nem t\u00E1mogatottak.
X0X85.S=''{0}'' index nem ker\u00FClt l\u00E9trehoz\u00E1sra, mivel a(z) ''{1}'' \u00E9rv\u00E9nytelen indext\u00EDpus.
X0Y57.S=Nem nullk\u00E9pes oszlop nem adhat\u00F3 a(z) ''{0}'' t\u00E1bl\u00E1hoz, mivel a t\u00E1bla legal\u00E1bb egy sort tartalmaz. Nem nullk\u00E9pes oszlopok csak \u00FCres t\u00E1bl\u00E1khoz adhat\u00F3k.
XCL24.S=A(z) {0} param\u00E9ter kimen\u0151 param\u00E9ternek t\u0171nik, de a registerOutParameter() nem \u00EDgy jel\u00F6li ki.  Ha nem kimen\u0151 param\u00E9ter, akkor {1} t\u00EDpusra kell \u00E1ll\u00EDtani.
XSAJI.U=k\u00FCls\u0151
XCL42.S=CASCADE
2200W=XQuery soros\u00EDt\u00E1si hiba\: legal\u00E1bb egy fels\u0151 szint\u0171 attrib\u00FAtum csom\u00F3pont soros\u00EDt\u00E1s\u00E1ra t\u00F6rt\u00E9nt k\u00EDs\u00E9rlet.
XBM06.D=Az ind\u00EDt\u00E1s meghi\u00FAsult. A megfelel\u0151 rendszerind\u00EDt\u00F3 jelsz\u00F3 n\u00E9lk\u00FCl nem \u00E9rhet\u0151 el titkos\u00EDtott adatb\u00E1zis.  
XBCXJ.S=Az alkalmaz\u00E1s a Java kriptogr\u00E1fia kiterjeszt\u00E9s (JCE) 1.2.1-n\u00E9l kor\u00E1bbi v\u00E1ltozat\u00E1t haszn\u00E1lja.  Friss\u00EDtsen a JCE 1.2.1 v\u00E1ltozat\u00E1ra \u00E9s pr\u00F3b\u00E1lkozzon \u00FAjra a m\u0171velettel.    
X0Y66.S=Be\u00E1gyazott kapcsolatban nem adhat\u00F3 ki v\u00E9gleges\u00EDt\u00E9s, ha a sz\u00FCl\u0151 kapcsolatban f\u00FCgg\u0151 m\u0171velet tal\u00E1lhat\u00F3.
XCL15.S=ClassCastException t\u00F6rt\u00E9nt a compareTo() met\u00F3dus ''{0}'' objektumon megh\u00EDv\u00E1sa sor\u00E1n.  A compareTo() param\u00E9tere ''{1}'' oszt\u00E1ly\u00FA.
XCL33.S=A t\u00E1bla nem adhat\u00F3 meg a(z) {0} t\u00E1bl\u00E1t\u00F3l f\u00FCgg\u0151k\u00E9nt a t\u00F6rl\u00E9si szab\u00E1ly korl\u00E1toz\u00E1sai miatt. (A kapcsolat \u00F6nmag\u00E1ra hivatkozik \u00E9s ilyen kapcsolat m\u00E1r l\u00E9tezik a SET NULL t\u00F6rl\u00E9si szab\u00E1llyal.) 
XCL51.S=A k\u00E9rt f\u00FCggv\u00E9ny nem hivatkozhat a SESSION s\u00E9m\u00E1ban l\u00E9v\u0151 t\u00E1bl\u00E1kra.
XIE07.S=A mez\u0151- \u00E9s rekordelv\u00E1laszt\u00F3k nem lehetnek egym\u00E1s r\u00E9sz-karaktersorozatai. 
