#Thu May 16 17:55:33 BRT 2013
X0X67.S=Les colonnes de type ''{0}'' ne peuvent pas \u00EAtre utilis\u00E9es dans CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT ou DISTINCT parce que les comparaisons ne sont pas prises en charge pour ce type.
X0X85.S=L''index ''{0}'' n''a pas \u00E9t\u00E9 cr\u00E9\u00E9 parce que ''{1}'' n''est pas un type d''index valide.
X0Y57.S=Une colonne n''acceptant pas de valeurs NULL ne peut pas \u00EAtre ajout\u00E9e \u00E0 la table ''{0}'' \u00E9tant donn\u00E9 que la table contient au moins une ligne. Les colonnes n''acceptant pas de valeurs NULL peuvent uniquement \u00EAtre ajout\u00E9es \u00E0 des tables vides.
XCL24.S=Le param\u00E8tre {0} semble \u00EAtre un param\u00E8tre de sortie, mais il n''a pas \u00E9t\u00E9 d\u00E9sign\u00E9 ainsi par registerOutParameter().  S''il ne s''agit pas d''un param\u00E8tre de sortie, alors il doit \u00EAtre d\u00E9fini sur le type {1}.
XSAJI.U=externe
XCL42.S=CASCADE
XBM06.D=Echec du d\u00E9marrage. Il est impossible d''acc\u00E9der \u00E0 une base de donn\u00E9es chiffr\u00E9e sans le mot de passe d''amor\u00E7age appropri\u00E9.  
2200W=Erreur de s\u00E9rialisation XQuery \: Le programme a tent\u00E9 de s\u00E9rialiser un ou plusieurs noeuds d''attribut de niveau sup\u00E9rieur.
XBCXJ.S=L''application utilise une version de Java Cryptography Extension (JCE) ant\u00E9rieure \u00E0 1.2.1.  Effectuez la mise \u00E0 niveau vers JCE 1.2.1 puis recommencez l''op\u00E9ration.    
XCL15.S=Une exception ClassCastException s''est produite lors de l''appel de la m\u00E9thode compareTo() sur un objet ''{0}''.  Le param\u00E8tre pour compareTo() est de classe ''{1}''.
X0Y66.S=Impossible d''\u00E9mettre une validation dans une connexion imbriqu\u00E9e dont la connexion parent contient une op\u00E9ration en attente.
XCL33.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. (La relation est auto-r\u00E9f\u00E9renc\u00E9e et ce type de relation est d\u00E9j\u00E0 associ\u00E9 \u00E0 la r\u00E8gle de suppression SET NULL.) 
XSDAO.S=Erreur interne \: la page {0} a effectu\u00E9 deux tentatives de verrouillage.
X0Y84.S=Conflit d''utilisation dans la s\u00E9quence {0}.
XCL51.S=La fonction demand\u00E9e ne peut pas faire r\u00E9f\u00E9rence \u00E0 des tables du sch\u00E9ma SESSION.
R007=R\u00F4le ma\u00EEtre de r\u00E9plication d\u00E9marr\u00E9 pour la base de donn\u00E9es ''{0}''.
XIE07.S=Les s\u00E9parateurs de zone et d''enregistrements ne peuvent pas \u00EAtre des sous-cha\u00EEnes les uns des autres. 
