#Thu May 16 17:55:33 BRT 2013
X0X67.S=Kolumny typu ''{0}'' nie mog\u0105 by\u0107 u\u017Cywane w instrukcjach CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT lub DISTINCT, poniewa\u017C dla tego typu por\u00F3wnania nie s\u0105 obs\u0142ugiwane.
X0X85.S=Indeks ''{0}'' nie zosta\u0142 utworzony, poniewa\u017C ''{1}'' nie jest poprawnym typem indeksu.
X0Y57.S=Do tabeli ''{0}'' nie mo\u017Cna doda\u0107 kolumny niedopuszczaj\u0105cej warto\u015Bci null, poniewa\u017C tabela zawiera przynajmniej jeden wiersz. Kolumny niedopuszczaj\u0105ce warto\u015Bci null mog\u0105 by\u0107 dodawane tylko do pustych tabel.
XCL24.S=Parametr {0} jest parametrem wyj\u015Bciowym, ale nie zosta\u0142 wyznaczony przez funkcj\u0119 registerOutParameter(). Je\u015Bli to nie jest parametr wyj\u015Bciowy, nale\u017Cy ustawi\u0107 dla niego typ {1}.
XSAJI.U=zewn\u0119trzne
XCL42.S=CASCADE
2200W=B\u0142\u0105d serializacji XQuery\: Pr\u00F3ba przekszta\u0142cenia do postaci szeregowej jednego lub wi\u0119cej w\u0119z\u0142\u00F3w atrybutu najwy\u017Cszego poziomu.
XBM06.D=Uruchamianie nie powiod\u0142o si\u0119. Dost\u0119p do zaszyfrowanej bazy danych bez poprawnego has\u0142a startowego nie jest mo\u017Cliwy. 
XBCXJ.S=Aplikacja korzysta z rozszerzenia Java Cryptography Extension (JCE) starszego ni\u017C 1.2.1. Zaktualizuj rozszerzenie JCE do wersji 1.2.1 i spr\u00F3buj wykona\u0107 operacj\u0119 ponownie. 
X0Y66.S=Nie mo\u017Cna wywo\u0142a\u0107 zatwierdzenia w po\u0142\u0105czeniu zagnie\u017Cd\u017Conym, gdy w po\u0142\u0105czeniu nadrz\u0119dnym istnieje oczekuj\u0105ca operacja.
XCL15.S=Wyst\u0105pi\u0142 wyj\u0105tek ClassCastException podczas wywo\u0142ywania metody compareTo() dla obiektu ''{0}''. Parametr metody compareTo() jest z klasy ''{1}''.
XCL33.S=Nie mo\u017Cna zdefiniowa\u0107 tabeli jako zale\u017Cnej od tabeli {0} z powodu ogranicze\u0144 regu\u0142y usuwania. (Relacja jest samoodwo\u0142uj\u0105ca si\u0119, a samoodwo\u0142uj\u0105ca si\u0119 relacja ju\u017C istnieje dla regu\u0142y usuwania SET NULL). 
XCL51.S=\u017B\u0105dana funkcja nie mo\u017Ce odwo\u0142ywa\u0107 si\u0119 do tabel w schemacie SESSION.
XIE07.S=Separatory p\u00F3l i rekord\u00F3w nie mog\u0105 by\u0107 dla siebie pod\u0142a\u0144cuchami. 
