#Thu May 16 17:55:33 BRT 2013
X0Y67.S=N\u00E3o \u00E9 poss\u00EDvel emitir a a\u00E7\u00E3o de revers\u00E3o em uma conex\u00E3o aninhada quando houver uma opera\u00E7\u00E3o pendente na conex\u00E3o pai.
XBCA0.S=N\u00E3o foi poss\u00EDvel criar um novo objeto com a chave {1} no cache {0}. O objeto j\u00E1 existe no cache.
XCL16.S=O ResultSet n\u00E3o est\u00E1 aberto. A opera\u00E7\u00E3o ''{0}'' n\u00E3o \u00E9 permitida. Verifique se a auto-efetiva\u00E7\u00E3o est\u00E1 desabilitada.
XCL34.S=A tabela n\u00E3o pode ser definida como dependente da tabela {0} devido a restri\u00E7\u00F5es da regra de exclus\u00E3o. (O relacionamento forma um ciclo de duas ou mais tabelas que fazem com que a tabela seja conectada para exclus\u00E3o consigo mesma (todas as outras regras de exclus\u00E3o no ciclo seriam CASCADE)).
XCL52.S=A instru\u00E7\u00E3o foi cancelada ou expirou.
XIE08.S=N\u00E3o existe uma coluna chamada\: {0}.
XSRS0.S=N\u00E3o \u00E9 poss\u00EDvel congelar o banco de dados ap\u00F3s o mesmo j\u00E1 ter sido congelado.
XSLAH.D=Est\u00E1 sendo atualizado um banco de dados apenas-de-leitura.
X0X86.S=0 \u00E9 um valor de par\u00E2metro inv\u00E1lido para ResultSet.absolute(int row).
X0Y58.S=A tentativa de incluir uma restri\u00E7\u00E3o de chave prim\u00E1ria \u00E0 tabela ''{0}'' falhou, porque a tabela j\u00E1 possui uma restri\u00E7\u00E3o desse tipo.  As tabelas somente podem ter uma \u00FAnica restri\u00E7\u00E3o de chave prim\u00E1ria.
XCL07.S=O cursor ''{0}'' est\u00E1 fechado. Verifique se a auto-efetiva\u00E7\u00E3o est\u00E1 desabilitada.
XCL25.S=O par\u00E2metro {0} n\u00E3o pode ser registrado como sendo do tipo {1}, porque faz mapeamentos para o tipo {2} e eles s\u00E3o incompat\u00EDveis.
XCL43.S=SET NULL
XSAJJ.U=interna
XBM07.D=Falha na inicializa\u00E7\u00E3o. A senha de inicializa\u00E7\u00E3o deve ter pelo menos 8 bytes.
XBCXK.S=A chave de criptografia fornecida n\u00E3o corresponde \u00E0 chave de criptografia usada na cria\u00E7\u00E3o do banco de dados. Assegure-se de estar utilizando a chave de criptografia correta e tente novamente.
X0X95.S=N\u00E3o p\u00F4de ser efetuada a opera\u00E7\u00E3o ''{0}'' no objeto ''{1}'', porque h\u00E1 um ResultSet aberto dependente deste objeto.
