#Thu May 16 17:55:33 BRT 2013
X0Y67.S=Nelze zadat operaci rollback ve vno\u0159en\u00E9m spojen\u00ED, kdy\u017E se v nad\u0159\u00EDzen\u00E9m spojen\u00ED nach\u00E1z\u00ED nevy\u0159\u00EDzen\u00E1 operace.
XBCA0.S=Nelze vytvo\u0159it nov\u00FD objekt s kl\u00ED\u010Dem {1} v pam\u011Bti cache {0}. Objekt ji\u017E existuje v pam\u011Bti cache. 
XCL16.S=Mno\u017Eina v\u00FDsledk\u016F nen\u00ED otev\u0159ena. Operace ''{0}'' nen\u00ED povolena. Ov\u011B\u0159te, \u017Ee automatick\u00E9 potvrzov\u00E1n\u00ED je VYPNUTO.
XCL34.S=Tabulku nelze definovat tak, aby byla z\u00E1visl\u00E1 na tabulce {0}, kv\u016Fli omezen\u00EDm pravidla v\u00FDmazu. (Vztah formuje cyklus dvou nebo v\u00EDce tabulek, kter\u00E9 zp\u016Fsobuj\u00ED, \u017Ee tabulka je v r\u00E1mci v\u00FDmazu spojena sama se sebou (v\u0161echna ostatn\u00ED pravidla v\u00FDmazu v cyklu by byla SE\u0158AZENA ZA SEBOU)). 
XCL52.S=P\u0159\u00EDkaz byl zru\u0161en nebo vypr\u0161el jeho \u010Dasov\u00FD limit.
XIE08.S=Neexistuje jmenovan\u00FD sloupec\: {0}. 
XSRS0.S=Nelze zmrazit datab\u00E1zi, kdy\u017E ji\u017E je zmra\u017Eena.
XSLAH.D=Datab\u00E1ze, kter\u00E1 slou\u017E\u00ED pouze pro \u010Dten\u00ED, je aktualizov\u00E1na.
X0X86.S=0 je neplatn\u00E1 hodnota parametru pro ResultSet.absolute(int row).
X0Y58.S=Do\u0161lo k selh\u00E1n\u00ED pokusu o p\u0159id\u00E1n\u00ED omezen\u00ED prim\u00E1rn\u00EDho kl\u00ED\u010De do tabulky ''{0}'', proto\u017Ee tabulka ji\u017E m\u00E1 omezen\u00ED tohoto typu. Tabulka m\u016F\u017Ee m\u00EDt pouze jedin\u00E9 omezen\u00ED prim\u00E1rn\u00EDho kl\u00ED\u010De.
XCL07.S=Kurzor ''{0}'' je zav\u0159en. Ov\u011B\u0159te, \u017Ee automatick\u00E9 potvrzov\u00E1n\u00ED je VYPNUTO.
XCL25.S=Parametr {0} nelze registrovat jako typ {1}, proto\u017Ee se mapuje na typ {2} a tyto typy jsou nekompatibiln\u00ED.
XCL43.S=SET NULL
XSAJJ.U=vnit\u0159n\u00ED
XBM07.D=Spu\u0161t\u011Bn\u00ED selhalo. Zav\u00E1d\u011Bc\u00ED heslo mus\u00ED b\u00FDt alespo\u0148 8 bajt\u016F dlouh\u00E9.
XBCXK.S=Poskytnut\u00FD \u0161ifrovac\u00ED kl\u00ED\u010D neodpov\u00EDd\u00E1 \u0161ifrovac\u00EDmu kl\u00ED\u010Di pou\u017Eit\u00E9mu p\u0159i vytv\u00E1\u0159en\u00ED datab\u00E1ze. Ujist\u011Bte se, \u017Ee pou\u017E\u00EDv\u00E1te spr\u00E1vn\u00FD \u0161ifrovac\u00ED kl\u00ED\u010D, a zopakujte akci. 
X0X95.S=Operaci ''{0}'' nelze prov\u00E9st na objektu ''{1}'', proto\u017Ee existuje otev\u0159en\u00E1 mno\u017Eina v\u00FDsledk\u016F, kter\u00E1 je z\u00E1visl\u00E1 na tomto objektu.
