#Thu May 16 17:55:33 BRT 2013
XBCXK.S=La cl\u00E9 de chiffrement donn\u00E9e ne concorde pas avec celle qui est utilis\u00E9e lors de la cr\u00E9ation de la base de donn\u00E9es. V\u00E9rifiez que vous utilisez la cl\u00E9 de chiffrement correcte et faites une nouvelle tentative. 
XCL43.S=SET NULL
X0Y67.S=Impossible d''\u00E9mettre une annulation dans une connexion imbriqu\u00E9e dont la connexion parent contient une op\u00E9ration en attente.
XSAJJ.U=interne
XCL16.S=ResultSet n''est pas ouvert. Op\u00E9ration ''{0}'' non autoris\u00E9e. V\u00E9rifiez que la validation automatique est d\u00E9sactiv\u00E9e.
X0X86.S=0 est une valeur de param\u00E8tre incorrecte pour ResultSet.absolute(int row).
XCL34.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. La relation engendre un cycle de deux ou plusieurs tables qui \u00E9tablit une d\u00E9pendance en cas de suppression entre chaque table (toutes les autres r\u00E8gles de suppression du cycle sont en CASCADE).  
XBM07.D=Echec du d\u00E9marrage. Le mot de passe d''amor\u00E7age doit avoir une longueur maximale de huit octets.
X0Y58.S=La tentative d''ajout d''une contrainte de cl\u00E9 primaire \u00E0 la table ''{0}'' a \u00E9chou\u00E9 parce que la table contient d\u00E9j\u00E0 une contrainte de ce type.  Une table ne peut avoir qu''une seule contrainte de cl\u00E9 primaire.
2201W=Nombre de lignes incorrect pour FIRST/NEXT. Il doit \u00EAtre >\= 1.
XCL52.S=Cette instruction a \u00E9t\u00E9 annul\u00E9e ou interrompue.
XBCA0.S=Impossible de cr\u00E9er un objet avec la cl\u00E9 {1} dans la {0}. L''objet existe d\u00E9j\u00E0 dans la cache. 
XCL07.S=Le curseur ''{0}'' est ferm\u00E9. V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
XIE08.S=Il n''existe aucune colonne nomm\u00E9e \: {0}.  
XSRS0.S=Impossible de geler la base de donn\u00E9es lorsqu''elle a d\u00E9j\u00E0 \u00E9t\u00E9 gel\u00E9e.
XCL25.S=Le param\u00E8tre {0} ne peut pas \u00EAtre enregistr\u00E9 pour \u00EAtre de type {1} parce qu''il est mapp\u00E9 vers le type {2} et qu''ils sont incompatibles.
X0X95.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre ex\u00E9cut\u00E9e sur l''objet ''{1}'' parce qu''il existe un ResultSet ouvert d\u00E9pendant de cet objet.
R008=R\u00F4le ma\u00EEtre de r\u00E9plication arr\u00EAt\u00E9 pour la base de donn\u00E9es ''{0}''.
XSLAH.D=Une base de donn\u00E9es en lecture seule est en cours de mise \u00E0 jour.
