#Thu May 16 17:55:33 BRT 2013
X0Y67.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u043E\u0442\u043A\u0430\u0442 \u0432\u043E \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u043C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438, \u0435\u0441\u043B\u0438 \u0432 \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u044C\u0441\u043A\u043E\u043C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438 \u0435\u0441\u0442\u044C \u043E\u0442\u043B\u043E\u0436\u0435\u043D\u043D\u0430\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F.
XBCA0.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0439 \u043E\u0431\u044A\u0435\u043A\u0442 \u0441 \u043A\u043B\u044E\u0447\u043E\u043C {1} \u0432 \u043A\u044D\u0448\u0435 {0}. \u041E\u0431\u044A\u0435\u043A\u0442 \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u043A\u044D\u0448\u0435. 
XCL16.S=\u041D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u043D\u0435 \u043E\u0442\u043A\u0440\u044B\u0442. \u041E\u043F\u0435\u0440\u0430\u0446\u0438\u044F ''{0}'' \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0430. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u043E\u043F\u0446\u0438\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u044F \u0432\u044B\u043A\u043B\u044E\u0447\u0435\u043D\u0430 (OFF).
XCL34.S=\u0422\u0430\u0431\u043B\u0438\u0446\u0443 \u043D\u0435\u043B\u044C\u0437\u044F \u0437\u0430\u0434\u0430\u0442\u044C \u043A\u0430\u043A \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u0443\u044E \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u044B {0} \u0438\u0437-\u0437\u0430 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0439 \u043F\u0440\u0430\u0432\u0438\u043B \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F. (\u0412\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u044C \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u0442 \u0446\u0438\u043A\u043B \u0438\u0437 \u0434\u0432\u0443\u0445 \u0438\u043B\u0438 \u0431\u043E\u043B\u0435\u0435 \u0442\u0430\u0431\u043B\u0438\u0446, \u0438\u0437-\u0437\u0430 \u0447\u0435\u0433\u043E \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u0441\u0432\u044F\u0437\u0430\u043D\u0430 \u043F\u0440\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u0438 \u0441\u0430\u043C\u0430 \u0441 \u0441\u043E\u0431\u043E\u0439 - \u0432\u0441\u0435 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0432 \u0446\u0438\u043A\u043B\u0435 \u0431\u0443\u0434\u0443\u0442 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u043F\u0440\u0430\u0432\u0438\u043B\u043E CASCADE).  
XCL52.S=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u043E\u0442\u043C\u0435\u043D\u0435\u043D, \u0438\u043B\u0438 \u0438\u0441\u0442\u0435\u043A \u0435\u0433\u043E \u0442\u0430\u0439\u043C-\u0430\u0443\u0442.
XIE08.S=\u041D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C {0}.  
XSRS0.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u0438\u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u043E\u043D\u0430 \u0443\u0436\u0435 \u0431\u044B\u043B\u0430 \u043F\u0440\u0438\u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0430.
XSLAH.D=\u041E\u0431\u043D\u043E\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0431\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u0430\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F.
X0X86.S=0 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 \u0434\u043B\u044F ResultSet.absolute(int row).
X0Y58.S=\u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0433\u043B\u0430\u0432\u043D\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 ''{0}'' \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0430\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0443 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0443\u0436\u0435 \u0435\u0441\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u044D\u0442\u043E\u0433\u043E \u0442\u0438\u043F\u0430.  \u0423 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0433\u043B\u0430\u0432\u043D\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430.
XCL07.S=\u041A\u0443\u0440\u0441\u043E\u0440 ''{0}'' \u0437\u0430\u043A\u0440\u044B\u0442. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u043E\u043F\u0446\u0438\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u044F \u0432\u044B\u043A\u043B\u044E\u0447\u0435\u043D\u0430 (OFF).
XCL25.S=\u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 {0} \u043D\u0435\u043B\u044C\u0437\u044F \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043A\u0430\u043A \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \u0442\u0438\u043F\u0430 {1}, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043E\u043D \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u0442\u0438\u043F {2},  \u0430 \u044D\u0442\u0438 \u0434\u0432\u0430 \u0442\u0438\u043F\u0430 \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043D\u0435\u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C\u044B\u043C\u0438.
XCL43.S=SET NULL
XSAJJ.U=\u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u044F\u044F
XBM07.D=\u0417\u0430\u043F\u0443\u0441\u043A \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0441\u044F \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E. \u0414\u043B\u0438\u043D\u0430 \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0434\u043E\u043B\u0436\u043D\u0430 \u0441\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 8 \u0431\u0430\u0439\u0442.
XBCXK.S=\u0414\u0430\u043D\u043D\u044B\u0439 \u043A\u043B\u044E\u0447 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0435\u0442 \u0441 \u043A\u043B\u044E\u0447\u043E\u043C \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u0441\u044F \u043F\u0440\u0438 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0438 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u0432\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0439 \u043A\u043B\u044E\u0447 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u0438 \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0435\u0449\u0435 \u0440\u0430\u0437. 
X0X95.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044E ''{0}'' \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u0430 ''{1}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043D\u0435\u0442 \u043E\u0442\u043A\u0440\u044B\u0442\u043E\u0433\u043E \u043D\u0430\u0431\u043E\u0440\u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432(ResultSet), \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u044B \u0437\u0430\u0432\u0438\u0441\u0435\u043B \u043E\u0442 \u044D\u0442\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430.
