#Thu May 16 17:55:33 BRT 2013
XBCXK.S=Der angegebene Chiffrierschl\u00FCssel stimmt nicht mit dem bei der Erstellung der Datenbank verwendeten Chiffrierschl\u00FCssel \u00FCberein. Vergewissern Sie sich, dass Sie den richtigen Chiffrierschl\u00FCssel verwenden, und versuchen Sie es erneut. 
XCL43.S=SET NULL
X0Y67.S=In einer verschachtelten Verbindung kann keine ROLLBACK-Operation abgesetzt werden, solange es eine anstehende Operation in der \u00FCbergeordneten Verbindung gibt.
XSAJJ.U=innere
XCL16.S=ResultSet nicht ge\u00F6ffnet. Vorgang ''{0}'' nicht zul\u00E4ssig. Stellen Sie sicher, dass autocommit deaktiviert ist.
X0X86.S=0 ist ein ung\u00FCltiger Parameterwert f\u00FCr ResultSet.absolute(int row).
XCL34.S=Aufgrund von L\u00F6schregeleinschr\u00E4nkungen kann die Tabelle nicht als abh\u00E4ngig von der Tabelle {0} definiert werden. (Die Beziehung umfasst zwei oder mehr Tabellen, so dass die Tabelle f\u00FCr das mehrstufige L\u00F6schen auf sich selbst verweist. F\u00FCr alle \u00FCbrigen Tabellen gilt die L\u00F6schregel CASCADE.)
XBM07.D=Der Systemstart ist gescheitert. Das Boot-Passwort muss eine Mindestl\u00E4nge von 8 Bytes haben.
X0Y58.S=Der Versuch, zur Tabelle ''{0}'' eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel hinzuzuf\u00FCgen, ist gescheitert, weil es f\u00FCr die Tabelle bereits eine Integrit\u00E4tsbedingung dieses Typs gibt. F\u00FCr eine Tabelle kann es nur eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel geben.
2201W=Ung\u00FCltige Zeilenanzahl f\u00FCr FIRST/NEXT, muss >\= 1 sein.
XCL52.S=Die Anweisung wurde abgebrochen, oder das Zeitlimit f\u00FCr die Anweisung wurde \u00FCberschritten.
XBCA0.S=Im {0}-Cache kann kein neues Objekt mit dem Schl\u00FCssel {1} erstellt werden, da es bereits im Cache vorhanden ist. 
XCL07.S=Der Cursor ''{0}'' wurde geschlossen. Pr\u00FCfen Sie, ob das automatische Festschreiben inaktiviert ist.
XIE08.S=Es gibt keine Spalte mit dem Namen {0}. 
XSRS0.S=Die Datenbank kann nicht eingefroren werden, da sie bereits eingefroren ist.
XCL25.S=Der Parameter {0} kann nicht als Parameter des Typs {1} registriert werden, weil er dem Typ {2} zugeordnet wird und beide Typen inkompatibel sind.
X0X95.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil es ein offenes ResultSet gibt, das von diesem Objekt abh\u00E4ngig ist.
R008=Replication Master-Rolle angehalten f\u00FCr Datenbank''{0}''.
XSLAH.D=Sie aktualisieren eine schreibgesch\u00FCtzte Datenbank.
