#Thu May 16 17:55:33 BRT 2013
X0Y67.S=Nie mo\u017Cna wywo\u0142a\u0107 wycofania w po\u0142\u0105czeniu zagnie\u017Cd\u017Conym, gdy w po\u0142\u0105czeniu nadrz\u0119dnym istnieje oczekuj\u0105ca operacja.
XBCA0.S=Nie mo\u017Cna utworzy\u0107 nowego obiektu za pomoc\u0105 klucza {1} w pami\u0119ci podr\u0119cznej {0}. Obiekt ju\u017C istnieje w pami\u0119ci podr\u0119cznej. 
XCL16.S=Obiekt ResultSet nie jest otwarty. Operacja ''{0}'' nie jest dozwolona. Sprawd\u017A, czy funkcja automatycznego zatwierdzania jest wy\u0142\u0105czona (OFF).
XCL34.S=Nie mo\u017Cna zdefiniowa\u0107 tabeli jako zale\u017Cnej od tabeli {0} z powodu ogranicze\u0144 regu\u0142y usuwania. (Relacja tworzy cykl dw\u00F3ch lub wi\u0119cej tabel, co powoduje, \u017Ce s\u0105 one po\u0142\u0105czone ze sob\u0105 podczas usuwania - wszystkie pozosta\u0142e regu\u0142y usuwania w cyklu b\u0119d\u0105 mia\u0142y typ CASCADE). 
XCL52.S=Instrukcja zosta\u0142a anulowana lub up\u0142yn\u0105\u0142 limit czasu.
XIE08.S=Brak kolumny o nazwie\: {0}. 
XSRS0.S=Nie mo\u017Cna zamrozi\u0107 bazy danych, kt\u00F3ra jest ju\u017C zamro\u017Cona.
XSLAH.D=Aktualizowana jest baza danych tylko do odczytu.
X0X86.S=0 jest niepoprawn\u0105 warto\u015Bci\u0105 parametru dla funkcji ResultSet.absolute(int row).
X0Y58.S=Pr\u00F3ba dodania regu\u0142y ograniczaj\u0105cej klucz podstawowy do tabeli ''{0}'' nie powiod\u0142a si\u0119, poniewa\u017C tabela ma ju\u017C regu\u0142\u0119 ograniczaj\u0105c\u0105 tego typu. Tabela mo\u017Ce mie\u0107 tylko pojedyncz\u0105 regu\u0142\u0119 ograniczaj\u0105c\u0105 klucz podstawowy.
XCL07.S=Kursor ''{0}'' zosta\u0142 zamkni\u0119ty. Sprawd\u017A, czy funkcja automatycznego zatwierdzania jest wy\u0142\u0105czona (OFF).
XCL25.S=Nie mo\u017Cna zarejestrowa\u0107 parametru {0} jako parametru typu {1}, poniewa\u017C jest on odwzorowywany na typ {2}, a te typy s\u0105 niekompatybilne.
XCL43.S=SET NULL
XSAJJ.U=wewn\u0119trzne
XBM07.D=Uruchamianie nie powiod\u0142o si\u0119. Has\u0142o startowe musi mie\u0107 co najmniej 8 bajt\u00F3w d\u0142ugo\u015Bci.
XBCXK.S=Podany klucz szyfrowania nie zgadza si\u0119 z kluczem szyfrowania u\u017Cytym podczas tworzenia bazy danych. Upewnij si\u0119, \u017Ce wykorzystywany jest poprawny klucz szyfrowania i spr\u00F3buj ponownie. 
X0X95.S=Operacja ''{0}'' nie mo\u017Ce by\u0107 wykonana na obiekcie ''{1}'', poniewa\u017C istnieje otwarty interfejs ResultSet zale\u017Cny od tego obiektu.
