#Thu May 16 17:55:33 BRT 2013
XBCXK.S=La clave de cifrado proporcionada no coincide con la clave de cifrado utilizada al crear la base de datos. Aseg\u00FArese de utilizar la clave de cifrado correcta e int\u00E9ntelo de nuevo. 
XCL43.S=SET NULL
X0Y67.S=No se puede emitir retrotraer en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n padre.
XSAJJ.U=interna
XCL16.S=ResultSet no se ha abierto. La operaci\u00F3n ''{0}'' no est\u00E1 permitida. Compruebe que autocommit est\u00E9 desactivado.
X0X86.S=0 es un valor de par\u00E1metro no v\u00E1lido para ResultSet.absolute(int row).
XCL34.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00F3n. (La relaci\u00F3n forma un ciclo de dos o m\u00E1s tablas que hacen que la tabla est\u00E9 conectada para suprimirse a s\u00ED misma (todas las otras normas de supresi\u00F3n en el ciclo deber\u00EDan ser CASCADE)).  
XBM07.D=Error de arranque. La contrase\u00F1a de arranque debe tener al menos 8 bytes de longitud.
X0Y58.S=Se ha intentado a\u00F1adir una restricci\u00F3n de clave primaria en la tabla ''{0}'' y no se ha podido porque la tabla ya tiene una restricci\u00F3n de ese tipo.  Una tabla puede tener una sola restricci\u00F3n de clave primaria.
2201W=El recuento de filas de FIRST/NEXT no es v\u00E1lido, debe ser >\= 1.
XCL52.S=La sentencia se ha cancelado o ha excedido el tiempo de espera.
XBCA0.S=No se puede crear un nuevo objeto con la clave {1} en antememoria {0}. El objeto ya existe en la antememoria. 
XCL07.S=El cursor ''{0}'' est\u00E1 cerrado. Verifique que AutoCommit sea OFF.
XIE08.S=No existe una columna denominada\: {0}.  
XSRS0.S=No se puede inmovilizar la base de datos despu\u00E9s de que ya ha sido inmovilizada.
XCL25.S=El par\u00E1metro {0} no puede registrarse como del tipo {1} porque se correlaciona con el tipo {2} y son incompatibles.
X0X95.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.
R008=Se ha detenido la funci\u00F3n de repetici\u00F3n principal para la base de datos ''{0}''.
XSLAH.D=Se va a actualizar una base de datos de s\u00F3lo lectura.
