#Thu May 16 17:55:33 BRT 2013
X0Y67.S=Be\u00E1gyazott kapcsolatban nem adhat\u00F3 ki visszag\u00F6rget\u00E9s, ha a sz\u00FCl\u0151 kapcsolatban f\u00FCgg\u0151 m\u0171velet tal\u00E1lhat\u00F3.
XBCA0.S=A(z) {0} gyors\u00EDt\u00F3t\u00E1rban nem hozhat\u00F3 l\u00E9tre {1} kulcs\u00FA \u00FAj objektum. Az objektum m\u00E1r l\u00E9tezik a gyors\u00EDt\u00F3t\u00E1rban. 
XCL16.S=A ResultSet nincs megnyitva. A(z) ''{0}'' m\u0171velet nem megengedett. Ellen\u0151rizze, hogy az autocommit ki van-e kapcsolva (OFF).
XCL34.S=A t\u00E1bla nem adhat\u00F3 meg a(z) {0} t\u00E1bl\u00E1t\u00F3l f\u00FCgg\u0151k\u00E9nt a t\u00F6rl\u00E9si szab\u00E1ly korl\u00E1toz\u00E1sai miatt. (A kapcsolat legal\u00E1bb k\u00E9t t\u00E1bla ciklus\u00E1t okozza, amelyek hat\u00E1s\u00E1ra a t\u00E1bla t\u00F6rl\u00E9si szempontb\u00F3l kapcsolat lesz saj\u00E1t mag\u00E1hoz (a ciklus minden m\u00E1s t\u00F6rl\u00E9s szab\u00E1lya CASCADE lenne)).  
XCL52.S=Az utas\u00EDt\u00E1s visszavon\u00E1sra ker\u00FClt vagy t\u00FAll\u00E9pte az id\u0151korl\u00E1tot.
XIE08.S=Nincs {0} nev\u0171 oszlop.  
XSRS0.S=Az adatb\u00E1zis nem fagyaszthat\u00F3, mivel m\u00E1r fagyasztva van.
XSLAH.D=\u00CDr\u00E1sv\u00E9dett adatb\u00E1zis ker\u00FCl friss\u00EDt\u00E9sre.
X0X86.S=A 0 \u00E9rv\u00E9nytelen param\u00E9ter\u00E9rt\u00E9k ResultSet.absolute(int row) eset\u00E9n.
X0Y58.S=Els\u0151dleges kulcs ''{0}'' t\u00E1bl\u00E1hoz ad\u00E1sa meghi\u00FAsult, mivel a t\u00E1bla m\u00E1r rendelkezik ilyen t\u00EDpus\u00FA megszor\u00EDt\u00E1ssal.  A t\u00E1bla csak egy els\u0151dleges kulcs megszor\u00EDt\u00E1ssal rendelkezhet.
XCL07.S=A(z) ''{0}'' kurzor be van z\u00E1rva. Ellen\u0151rizze, hogy az autocommit ki van-e kapcsolva (OFF).
XCL25.S=A(z) {0} param\u00E9ter nem jegyezhet\u0151 be {1} t\u00EDpus\u00FAk\u00E9nt, mivel {2} t\u00EDpusra ker\u00FCl lek\u00E9pez\u00E9sre \u00E9s ez a k\u00E9t t\u00EDpus nem kompatibilis.
XCL43.S=SET NULL
XSAJJ.U=bels\u0151
XBM07.D=Az ind\u00EDt\u00E1s meghi\u00FAsult. A rendszerind\u00EDt\u00F3 jelsz\u00F3nak legal\u00E1bb 8 byte hossz\u00FAnak kell lennie.
XBCXK.S=A megadott titkos\u00EDt\u00E1si kulcs nem egyezik az adatb\u00E1zis l\u00E9trehoz\u00E1sakor haszn\u00E1lttal. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a megfelel\u0151 titkos\u00EDt\u00E1si kulcsot haszn\u00E1lja \u00E9s pr\u00F3b\u00E1lkozzon \u00FAjra. 
X0X95.S=''{0}'' m\u0171velet ''{1}'' objektumon nem hajthat\u00F3 v\u00E9gre, mivel az objektumt\u00F3l f\u00FCgg\u0151 megnyitott ResultSet tal\u00E1lhat\u00F3.
