#Thu May 16 17:55:33 BRT 2013
XBCXK.S=\u4E0E\u3048\u3089\u308C\u305F\u6697\u53F7\u9375\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u7528\u3055\u308C\u305F\u6697\u53F7\u9375\u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002 \u6B63\u3057\u3044\u6697\u53F7\u9375\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u3001\u518D\u8A66\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
XCL43.S=SET NULL
X0Y67.S=\u89AA\u63A5\u7D9A\u306B\u4FDD\u7559\u4E2D\u306E\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u304C\u3042\u308B\u3068\u304D\u306F\u3001\u30CD\u30B9\u30C8\u3055\u308C\u305F\u63A5\u7D9A\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u306F\u767A\u884C\u3067\u304D\u307E\u305B\u3093\u3002
XSAJJ.U=\u5185\u90E8
XCL16.S=ResultSet \u304C\u30AA\u30FC\u30D7\u30F3\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''{0}'' \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002 \u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u304C\u30AA\u30D5\u306B\u306A\u3063\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
X0X86.S=0 \u306F\u3001ResultSet.absolute(int row) \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3067\u3059\u3002
XCL34.S=\u524A\u9664\u898F\u5247\u306E\u5236\u7D04\u4E8B\u9805\u306E\u305F\u3081\u3001\u8868 {0} \u306B\u5F93\u5C5E\u3059\u308B\u8868\u3068\u3057\u3066\u305D\u306E\u8868\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002 (\u305D\u306E\u95A2\u4FC2\u306B\u3088\u308A\u3001\u8907\u6570\u8868\u306E\u5FAA\u74B0\u304C\u69CB\u6210\u3055\u308C\u3001\u7D50\u679C\u3068\u3057\u3066\u305D\u306E\u8868\u306F\u5FAA\u74B0\u3068\u9023\u7D50\u524A\u9664\u3055\u308C\u308B\u3082\u306E\u306B\u306A\u308A\u307E\u3059 (\u5FAA\u74B0\u306E\u4ED6\u306E\u3059\u3079\u3066\u306E\u524A\u9664\u898F\u5247\u306F\u3001CASCADE \u306B\u306A\u308A\u307E\u3059\u3002))  
XBM07.D=\u59CB\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002 \u30D6\u30FC\u30C8\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u9577\u3055\u306F 8 \u30D0\u30A4\u30C8\u4EE5\u4E0A\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
X0Y58.S=\u4E3B\u30AD\u30FC\u5236\u7D04\u3092\u8868 ''{0}'' \u306B\u8FFD\u52A0\u3057\u3088\u3046\u3068\u3057\u3066\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u3053\u306E\u8868\u306F\u3059\u3067\u306B\u3053\u306E\u578B\u306E\u5236\u7D04\u3092\u6301\u3063\u3066\u3044\u307E\u3059\u3002  \u8868\u306F\u30011 \u3064\u306E\u4E3B\u30AD\u30FC\u5236\u7D04\u3057\u304B\u6301\u3064\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
2201W=FIRST/NEXT \u306E\u884C\u30AB\u30A6\u30F3\u30C8\u304C\u7121\u52B9\u3067\u3059\u30021 \u4EE5\u4E0A\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
XCL52.S=\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u53D6\u308A\u6D88\u3055\u308C\u305F\u304B\u3001\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306B\u306A\u308A\u307E\u3057\u305F\u3002
XBCA0.S=\u30AD\u30FC {1} \u3092\u4F7F\u3063\u3066 {0} \u30AD\u30E3\u30C3\u30B7\u30E5\u5185\u306B\u65B0\u898F\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002 \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3059\u3067\u306B\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u5B58\u5728\u3057\u307E\u3059\u3002 
XCL07.S=\u30AB\u30FC\u30BD\u30EB ''{0}'' \u306F\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u3066\u3044\u307E\u3059\u3002 \u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u304C\u30AA\u30D5\u306B\u306A\u3063\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XIE08.S=\u3053\u306E\u540D\u524D\u306E\u5217\u306F\u3042\u308A\u307E\u305B\u3093\: {0}\u3002  
XSRS0.S=\u3059\u3067\u306B\u30D5\u30EA\u30FC\u30BA\u3057\u305F\u5F8C\u306B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u30D5\u30EA\u30FC\u30BA\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XCL25.S=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC {0} \u306F\u578B {1} \u3068\u3057\u3066\u767B\u9332\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u578B {2} \u3092\u30DE\u30C3\u30D7\u3057\u3066\u304A\u308A\u3001\u3053\u306E 2 \u3064\u306F\u975E\u4E92\u63DB\u3067\u3059\u3002
X0X95.S=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 ''{1}'' \u306B\u304A\u3044\u3066\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''{0}'' \u3092\u5B9F\u884C\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u305D\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u5F93\u5C5E\u3059\u308B\u30AA\u30FC\u30D7\u30F3\u3055\u308C\u3066\u3044\u308B ResultSet \u304C\u3042\u308A\u307E\u3059\u3002
R008=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u8907\u88FD\u30DE\u30B9\u30BF\u30FC\u30ED\u30FC\u30EB\u304C\u505C\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
XSLAH.D=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u66F4\u65B0\u3055\u308C\u3066\u3044\u307E\u3059\u3002
