#Thu May 16 17:55:33 BRT 2013
XBCXL.S=La proc\u00E9dure de v\u00E9rification de la cl\u00E9 de chiffrement n''a pas abouti. Cette situation peut \u00EAtre due au fait qu''une erreur s''est produite lors de l''acc\u00E8s au fichier appropri\u00E9 pour la proc\u00E9dure de v\u00E9rification.  Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante.  
XRE00=Ce module LogFactory ne prend pas en charge la r\u00E9plication.
2201X=Nombre de lignes incorrect pour OFFSET. Il doit \u00EAtre >\= 0.
X0Y68.S={0} ''{1}'' existe d\u00E9j\u00E0.
XCL35.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. Dans le cadre de la relation, une d\u00E9pendance en cas de suppression s''\u00E9tablit entre cette table et la table indiqu\u00E9e en vertu de plusieurs relations et la r\u00E8gle de suppression de la relation existante est SET NULL.  
XIE09.S=Le nombre total de colonnes dans la ligne est \: {0}.  
XSRS1.S=Impossible de sauvegarder la base de donn\u00E9es dans {0} car il ne s''agit pas d''un r\u00E9pertoire.
XSLAI.D=Impossible de consigner l''enregistrement de journal des points de contr\u00F4le.
X0X87.S=ResultSet.relative(int row) ne peut pas \u00EAtre appel\u00E9e lorsque le curseur n''est pas positionn\u00E9 sur une ligne.
X0Y59.S=La tentative d''ajout ou d''activation d''une ou plusieurs contraintes sur la table ''{1}'' a \u00E9chou\u00E9 parce que la table contient {2} ligne(s) qui violent la ou les contraintes de v\u00E9rification suivantes \: {0}.
XCL08.S=Le curseur ''{0}'' ne se trouve pas sur une ligne.
X0Y77.S=Impossible d''\u00E9mettre une instruction SET TRANSACTION ISOLATION sur une transaction globale qui est en cours car cela entra\u00EEnerait implicitement la validation de la transaction globale.
XCL26.S=Le param\u00E8tre {0} n''est pas un param\u00E8tre de sortie.
XCL44.S=RESTRICT
R009=Une erreur s''est produite lors de l''exp\u00E9dition du journal.
XBM08.D=Impossible d''instancier la classe {0} StorageFactory {1}.
