#Thu May 16 17:55:33 BRT 2013
XCL45.S=NO ACTION
XBCXM.S=\u0414\u043B\u0438\u043D\u0430 \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043E\u043B\u0436\u043D\u0430 \u0432\u044B\u0440\u0430\u0436\u0430\u0442\u044C\u0441\u044F \u0447\u0435\u0442\u043D\u044B\u043C \u0447\u0438\u0441\u043B\u043E\u043C.
X0Y69.S={1} \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0435 {0}.
XCL36.S=\u041F\u0440\u0430\u0432\u0438\u043B\u043E\u043C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C {0}. (\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0441\u0441\u044B\u043B\u043E\u043A \u0441\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F \u0441\u0430\u043C\u043E \u043D\u0430 \u0441\u0435\u0431\u044F, \u0430 \u0443 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F, \u0441\u0441\u044B\u043B\u0430\u044E\u0449\u0435\u0433\u043E\u0441\u044F \u0441\u0430\u043C\u043E \u043D\u0430 \u0441\u0435\u0431\u044F, \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u043E \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F (NO ACTION, RESTRICT \u0438\u043B\u0438 CASCADE).)
X0Y78.S.2=\u0412\u044B\u0437\u0432\u0430\u043D \u043C\u0435\u0442\u043E\u0434 {0}.executeQuery(), \u043D\u043E \u043D\u0438\u043A\u0430\u043A\u043E\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D. \u041F\u0440\u0438 \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0438\u0438 \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 {1}.executeUpdate().
X0Y78.S.1=\u041D\u0435\u043B\u044C\u0437\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u043C\u0435\u0442\u043E\u0434 {0}.executeQuery(), \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043E \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432.  \u0427\u0442\u043E\u0431\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432. \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043C\u0435\u0442\u043E\u0434 {1}.execute().
XSLAJ.D=\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u0432\u0435\u0434\u0435\u043D\u0438\u044F \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043F\u043E\u043C\u0435\u0447\u0435\u043D\u0430 \u0434\u043B\u044F \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0438\u0437-\u0437\u0430 \u0440\u0430\u043D\u0435\u0435 \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u0435\u0434\u0448\u0435\u0439 \u043E\u0448\u0438\u0431\u043A\u0438, \u0438 \u0431\u043E\u043B\u044C\u0448\u0435 \u043D\u0438\u043A\u0430\u043A\u0438\u0435 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \u043D\u0435 \u0431\u0443\u0434\u0443\u0442 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0442\u044C\u0441\u044F, \u043F\u043E\u043A\u0430 \u0441\u0438\u0441\u0442\u0435\u043C\u0430 \u043D\u0435 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442 \u0440\u0430\u0431\u043E\u0442\u0443 \u0438 \u043D\u0435 \u043F\u0435\u0440\u0435\u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u0441\u044F.
XCL09.S=\u0410\u043A\u0442\u0438\u0432\u0430\u0446\u0438\u044F \u0431\u044B\u043B\u0430 \u043F\u0435\u0440\u0435\u0434\u0430\u043D\u0430 \u043C\u0435\u0442\u043E\u0434\u0443 ''{0}'', \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D\u043D\u043E\u043C\u0443 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0443 (PreparedStatement).
X0Y78.S=\u041C\u0435\u0442\u043E\u0434 Statement.executeQuery() \u043D\u0435\u043B\u044C\u0437\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0432 \u0441\u043E\u0447\u0435\u0442\u0430\u043D\u0438\u0438 \u0441 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u0447\u0438\u0441\u043B\u043E \u0441\u0442\u0440\u043E\u043A.
XCL27.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u043C\u044B\u0435 \u0432\u044B\u0445\u043E\u0434\u043D\u044B\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B.
