#Thu May 16 17:55:33 BRT 2013
X0Y79.S=\u041C\u0435\u0442\u043E\u0434 Statement.executeUpdate() \u043D\u0435\u043B\u044C\u0437\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0432 \u0441\u043E\u0447\u0435\u0442\u0430\u043D\u0438\u0438 \u0441 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet).
XCL46.S=SET DEFAULT
43X00.U=\u041F\u0440\u0438\u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D \u043A
42X10=''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u044B\u043C \u0438\u043C\u0435\u043D\u0435\u043C \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0432 \u043E\u0431\u043B\u0430\u0441\u0442\u0438, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043E\u043D\u043E \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F.
XBCXN.S=\u0412\u043D\u0435\u0448\u043D\u0438\u0439 \u043A\u043B\u044E\u0447 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043E\u0434\u0438\u043D \u0438\u043B\u0438 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432. \u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0435 \u0441\u0438\u043C\u0432\u043E\u043B\u044B \u0434\u043B\u044F \u0448\u0435\u0441\u0442\u043D\u0430\u0434\u0446\u0430\u0442\u0435\u0440\u0438\u0447\u043D\u043E\u0433\u043E \u0447\u0438\u0441\u043B\u0430\: 0-9, a-f \u0438 A-F.
XCL19.S=\u041E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u0442\u0440\u043E\u043A\u0430 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 ''{0}'' \u0434\u043B\u044F \u043A\u043B\u044E\u0447\u0430 ''{1}''.
42X01=\u0421\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430\: {0}.
XCL37.S=\u041F\u0440\u0430\u0432\u0438\u043B\u043E\u043C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C {0}. (\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0441\u0441\u044B\u043B\u043E\u043A \u0441\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F \u0441\u0430\u043C\u043E \u043D\u0430 \u0441\u0435\u0431\u044F, \u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0439 \u0432\u043E \u0432\u0437\u0430\u0438\u043C\u043E\u0441\u0432\u044F\u0437\u0438 \u043E\u0442 \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F CASCADE.)
XSLAK.D=\u0423 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u0440\u0435\u0432\u044B\u0448\u0435\u043D \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0444\u0430\u0439\u043B\u0430 \u0436\u0443\u0440\u043D\u0430\u043B\u0430, {0}.
42Y00=\u041A\u043B\u0430\u0441\u0441 ''{0}'' \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 org.apache.derby.iapi.db.AggregateDefinition \u0438 \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043A\u0430\u043A \u0430\u0433\u0440\u0435\u0433\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435.
XML00=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043D\u0430\u0439\u0442\u0438 API \u0438\u043B\u0438 \u043A\u043B\u0430\u0441\u0441\u044B \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 ''{0}''.  \u041E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 XML \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u044E\u0442\u0441\u044F, \u0435\u0441\u043B\u0438 \u044D\u0442\u0438\u0445 \u043A\u043B\u0430\u0441\u0441\u043E\u0432 \u043D\u0435\u0442 \u0432 \u043F\u0443\u0442\u0438 \u043A\u043B\u0430\u0441\u0441\u043E\u0432.
