#Thu May 16 17:55:33 BRT 2013
42Y01=La restricci\u00F3n ''{0}'' no es v\u00E1lida.
42Z00.U=Llamada de m\u00E9todo Java o referencia de campo
XML01=Se ha encontrado un error no esperado al procesar XML\: {0}
44X00.U=Nombre de tipo SQL
X0X99.S=El \u00EDndice ''{0}'' no existe.
43X10.U=Total
XSLAL.D=El tama\u00F1o del registro de anotaci\u00F3n cronol\u00F3gica {2} supera el tama\u00F1o m\u00E1ximo del archivo de anotaciones cronol\u00F3gicas permitido {3}. Se ha encontrado un error en el archivo de anotaciones cronol\u00F3gicas {0}, posici\u00F3n {1}.
42X20=Error de sintaxis; se esperaba un valor literal entero.
XBCXO.S=No se puede cifrar la base de datos cuando existe una transacci\u00F3n global en estado de preparada.
XRE12=Error de protocolo de red de repetici\u00F3n para la base de datos ''{0}''. Se esperaba el tipo de mensaje ''{1}'', pero se ha recibido ''{2}''.
XCL47.S=La utilizaci\u00F3n de ''{0}'' requiere que se actualice la base de datos desde la versi\u00F3n {1} a la versi\u00F3n {2} o posterior.
42Y10=Un constructor de tabla que no est\u00E1 en una sentencia INSERT tiene todos los par\u00E1metros ? en una de sus columnas.  En cada columna, al menos una de las filas debe tener un no-par\u00E1metro.
42X02={0}.
43X01.U=Inicio de subconsulta n\u00FAmero
43Y00.U=ResultSet de agregado escalar
XRE21=Error al efectuar la conmutaci\u00F3n por error para la base de datos ''{0}'', se ha cancelado el intento de conmutaci\u00F3n por error.
XCL38.S=La norma de supresi\u00F3n de la clave for\u00E1nea debe ser {0}. (La relaci\u00F3n har\u00EDa que la tabla estuviera conectada para supresi\u00F3n a la misma tabla a trav\u00E9s de distintas relaciones y dichas relaciones deben tener la misma norma de supresi\u00F3n (NO ACTION, RESTRICT o CASCADE)). 
XCW00.D=Actualizaci\u00F3n no soportada de ''{0}'' a ''{1}''.
XRE03=Error inesperado de repetici\u00F3n. Consulte derby.log para ver los detalles.
XSRS4.S=Error al renombrar el archivo (durante la copia de seguridad) de {0} en {1}.
