#Thu May 16 17:55:33 BRT 2013
XRE04.U.1=Impossible d''\u00E9tablir une connexion avec l''homologue de la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}'' \u00E0 l''adresse ''{1}\:{2}''.
43X02.U=Tout ResultSet
43Y01.U=Optimisation de cl\u00E9 d''index
XCL39.S=La r\u00E8gle de suppression de la cl\u00E9 primaire ne peut pas \u00EAtre CASCADE. Une contrainte auto-r\u00E9f\u00E9renc\u00E9e associ\u00E9e \u00E0 une r\u00E8gle de suppression SET NULL, NO ACTION ou RESTRICT existe d\u00E9j\u00E0. 
43X20.U=ResultSet d''agr\u00E9gat scalaire distinct
XRE40=Impossible d''ex\u00E9cuter l''op\u00E9ration car la base de donn\u00E9es n''est pas en mode esclave de r\u00E9plication.
42Y11=Une sp\u00E9cification de jointure est requise avec la clause ''{0}''.
42X03=Le nom de colonne ''{0}'' se trouve dans plusieurs tables de la liste FROM.
42X30=Le curseur ''{0}'' est introuvable. V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
XSRS5.S=Erreur lors de la copie du fichier (au cours de la sauvegarde) de {0} vers {1}.
XRE22=Le ma\u00EEtre de r\u00E9plication a d\u00E9j\u00E0 \u00E9t\u00E9 amorc\u00E9 pour la base de donn\u00E9es ''{0}''
42Z01.U=UNTYPED
43X11.U=Noeud
43Y10.U=ResultSet d''analyse de table pour {0}
XSLAM.D=Impossible de v\u00E9rifier le format de la base de donn\u00E9es situ\u00E9e dans {1} en raison d''une exception d''E/S.
XBCXP.S=Impossible de chiffrer \u00E0 nouveau la base de donn\u00E9es avec un nouveau mot de passe d''amor\u00E7age ou une cl\u00E9 de chiffrement externe lorsqu''une transaction est dans l''\u00E9tat pr\u00E9par\u00E9.
42X12=Le nom de colonne ''{0}'' figure plusieurs fois dans l''instruction CREATE TABLE.  
XCL48.S=L''instruction TRUNCATE TABLE n''est pas autoris\u00E9e sur ''{0}'' parce que sur cette table, des contraintes de cl\u00E9s uniques/primaires sont r\u00E9f\u00E9renc\u00E9s par des contraintes de cl\u00E9s externes activ\u00E9es \u00E0 partir d''autres tables. 
42Z10=La classe Java li\u00E9e \u00E0 un type d\u00E9fini par l''utilisateur n''est peut-\u00EAtre pas une classe utilis\u00E9e en interne par Derby \: ''{0}''.
XRE04.U.2=Perte de la connexion de la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}''.
