#Thu May 16 17:55:33 BRT 2013
23503={2} en la tabla ''{1}'' ha causado una violaci\u00F3n de restricci\u00F3n de clave for\u00E1nea ''{0}'' para la clave {3}.  La sentencia se ha retrotra\u00EDdo.
XBM0J.D=El directorio {0} ya existe.
XSDA1.S=Se ha intentado acceder a una ranura fuera de rango de una p\u00E1gina
42610=Todos los argumentos de la funci\u00F3n COALESCE/VALUE no pueden ser par\u00E1metros. La funci\u00F3n necesita al menos un argumento que no sea un par\u00E1metro.
42X89=Los tipos ''{0}'' y ''{1}'' no son compatibles. Ning\u00FAn tipo es asignable al otro tipo.  
42502=El usuario ''{0}'' no tiene el permiso de {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}''.
42Z87.U=compartir tabla
43X97.U=tiempo de proyecci\u00F3n (milisegundos)
XIE0K.S=El punto se ha especificado como un delimitador de serie de caracteres.
54004=La sentencia SELECT tiene demasiados elementos en GROUP BY, ORDER BY o lista de selecci\u00F3n.
XSRSC.S=No se puede realizar la copia de seguridad de la base de datos en {0}, es un directorio de base de datos.
42XA0=La cl\u00E1usula de generaci\u00F3n de la columna ''{0}'' tiene el tipo de datos ''{1}'', que no se puede asignar al tipo de datos declarados de la columna.
22018=Formato de serie de caracteres no v\u00E1lido para tipo {0}.
XD003.S=Imposible restaurar dependencia del disco. DependableFinder \= ''{0}''. M\u00E1s informaci\u00F3n\: ''{1}''.
25501=No es posible establecer la propiedad de conexi\u00F3n de s\u00F3lo lectura en una transacci\u00F3n activa.
42X98=No est\u00E1n permitidos par\u00E1metros en una definici\u00F3n VIEW.
42601.S.372=La sentencia ALTER TABLE no puede a\u00F1adir una columna IDENTITY a una tabla.
XSCB1.S=Contenedor {0} no encontrado.
43X88.U=Filas derechas devueltas vac\u00EDas
38002=La rutina intent\u00F3 modificar datos, cuando \u00E9sta no estaba definida como MODIFIES SQL DATA.
42601=En una sentencia ALTER TABLE, la columna ''{0}'' se ha especificado como NOT NULL y no se ha especificado la cl\u00E1usula DEFAULT o bien se ha especificado como DEFAULT NULL.
40XC0=Sentencia muerta. Esto puede haber sido provocado por un error grave de transacci\u00F3n dentro de esta sentencia.
22027=La funci\u00F3n incorporada TRIM() soporta un solo car\u00E1cter de ajuste.  Las funciones incorporadas LTRIM() y RTRIM() soportan varios caracteres de ajuste.
XSDB0.D=Excepci\u00F3n inesperada en la p\u00E1gina en memoria {0}
43X79.U=Filas vistas desde la izquierda
42Y97=Car\u00E1cter de escape en la l\u00EDnea ''{0}'', columna ''{1}''.
