#Thu May 16 17:55:33 BRT 2013
23503={2} sur la table ''{1}'' a entra\u00EEn\u00E9 la violation de la contrainte de cl\u00E9 externe ''{0}'' pour la cl\u00E9 {3}.  L''instruction a \u00E9t\u00E9 annul\u00E9e.
XBM0J.D=Le r\u00E9pertoire {0} existe d\u00E9j\u00E0.
XSDA1.S=Une tentative d''acc\u00E8s \u00E0 un emplacement situ\u00E9 en dehors des limites d''une page a \u00E9t\u00E9 effectu\u00E9e
42610=Les arguments de la fonction COALESCE/VALUE ne peuvent pas tous \u00EAtre des param\u00E8tres. La fonction doit disposer au minimum d''un argument qui n''est pas un param\u00E8tre.
42X89=Les types ''{0}'' et ''{1}'' ne sont pas compatibles. Aucun de ces deux types ne peut \u00EAtre affect\u00E9 \u00E0 l''autre.  
42502=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la colonne ''{2}'' de la table ''{3}''.''{4}''.
42Z87.U=partager la table
43X97.U=dur\u00E9e de projection (millisecondes)
XIE0K.S=Le point a \u00E9t\u00E9 sp\u00E9cifi\u00E9 comme d\u00E9limiteur de cha\u00EEne de caract\u00E8res.
54004=L''instruction SELECT contient trop d''\u00E9l\u00E9ments dans la liste select, ORDER BY ou GROUP BY.
XSRSC.S=Impossible de sauvegarder la base de donn\u00E9es dans {0} car il s''agit d''un r\u00E9pertoire de base de donn\u00E9es.
42XA0=La clause de g\u00E9n\u00E9ration de la colonne ''{0}'' poss\u00E8de le type de donn\u00E9e ''{1}'', qui ne peut pas \u00EAtre affect\u00E9 au type de donn\u00E9e d\u00E9clar\u00E9 de la colonne.
22018=Le format de la cha\u00EEne de caract\u00E8res n''est pas valide pour le type {0}.
XD003.S=Impossible de restaurer la d\u00E9pendance \u00E0 partir du disque. DependableFinder \= ''{0}''. Informations suppl\u00E9mentaires \: ''{1}''.
25501=Impossible de d\u00E9finir la propri\u00E9t\u00E9 en lecture seule de la connexion dans une transaction active.
42X98=Les param\u00E8tres ne sont pas autoris\u00E9s dans une d\u00E9finition VIEW.
42601.S.372=L''instruction ALTER TABLE ne peut pas ajouter de colonne d''identit\u00E9 (IDENTITY) \u00E0 la table.
XSCB1.S=Impossible de trouver le conteneur {0}.
43X88.U=Lignes de droite vides renvoy\u00E9es
38002=La routine a tent\u00E9 de modifier des donn\u00E9es, cependant elle n''a pas \u00E9t\u00E9 d\u00E9finie en ce sens (MODIFIES SQL DATA).
42601=Dans une instruction ALTER TABLE, la colonne ''{0}'' a \u00E9t\u00E9 d\u00E9finie par la valeur NOT NULL et la clause DEFAULT n''a pas \u00E9t\u00E9 sp\u00E9cifi\u00E9e ou a \u00E9t\u00E9 sp\u00E9cifi\u00E9e comme DEFAULT NUL.
40XC0=Instruction supprim\u00E9e. Cela peut r\u00E9sulter de l''interception d''une erreur de gravit\u00E9 concernant la transaction dans cette instruction.
22027=La fonction TRIM() int\u00E9gr\u00E9e ne prend en charge qu''un seul caract\u00E8re d''enl\u00E8vement des espaces de d\u00E9but et de fin.  Les fonctions int\u00E9gr\u00E9es LTRIM() et RTRIM() prennent en charge plusieurs caract\u00E8res d''enl\u00E8vement des espaces de d\u00E9but et de fin.
XSDB0.D=Exception inattendue sur la page en m\u00E9moire {0}
43X79.U=Lignes vues de la gauche
42Y97=Caract\u00E8re d''\u00E9chappement non valide \u00E0 la ligne ''{0}'', colonne ''{1}''.
