#Thu May 16 17:55:33 BRT 2013
23503=\u8868 ''{1}'' \u4E0A\u306E {2} \u304C\u539F\u56E0\u3067\u3001\u30AD\u30FC {3} \u306E\u5916\u90E8\u30AD\u30FC\u5236\u7D04 ''{0}'' \u9055\u53CD\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
XBM0J.D=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC {0} \u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
XSDA1.S=\u30DA\u30FC\u30B8\u4E0A\u306E\u7BC4\u56F2\u5916\u306E\u30B9\u30ED\u30C3\u30C8\u306B\u30A2\u30AF\u30BB\u30B9\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F
42610=COALESCE/VALUE \u95A2\u6570\u306B\u5BFE\u3059\u308B\u5F15\u6570\u306E\u3059\u3079\u3066\u3092\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u306E\u95A2\u6570\u306B\u306F\u3001\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3067\u306A\u3044\u5F15\u6570\u304C\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u5FC5\u8981\u3067\u3059\u3002
42X89=\u578B ''{0}'' \u3068 ''{1}'' \u306F\u3001\u4E92\u63DB\u6027\u306E\u3042\u308B\u578B\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002 \u3069\u3061\u3089\u306E\u578B\u3082\u3082\u3046\u4E00\u65B9\u306E\u578B\u306B\u5272\u308A\u5F53\u3066\u3067\u304D\u307E\u305B\u3093\u3002  
42502=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u8868 ''{3}''.''{4}'' \u306E\u5217 ''{2}'' \u306B\u5BFE\u3059\u308B {1} \u8A31\u53EF\u3092\u4E0E\u3048\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
42Z87.U=\u5171\u7528\u8868
43X97.U=\u5C55\u958B\u6642\u9593 (\u30DF\u30EA\u79D2)
XIE0K.S=\u30D4\u30EA\u30AA\u30C9\u304C\u6587\u5B57\u30B9\u30C8\u30EA\u30F3\u30B0\u533A\u5207\u308A\u6587\u5B57\u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002
54004=SELECT \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C GROUP BY\u3001ORDER BY \u307E\u305F\u306F\u9078\u629E\u30EA\u30B9\u30C8\u306B\u6301\u3064\u9805\u76EE\u304C\u591A\u3059\u304E\u307E\u3059\u3002
XSRSC.S=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092 {0} \u306B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u308C\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3067\u3059\u3002
42XA0=\u5217 ''{0}'' \u306E\u751F\u6210\u6587\u7BC0\u306E\u30C7\u30FC\u30BF\u578B\u304C ''{1}'' \u3067\u3059\u3002\u3053\u308C\u306F\u5217\u306E\u5BA3\u8A00\u6E08\u307F\u30C7\u30FC\u30BF\u578B\u306B\u5272\u308A\u5F53\u3066\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
22018=\u578B {0} \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u6587\u5B57\u30B9\u30C8\u30EA\u30F3\u30B0\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3067\u3059\u3002
XD003.S=\u30C7\u30A3\u30B9\u30AF\u304B\u3089\u5F93\u5C5E\u95A2\u4FC2\u3092\u30EA\u30B9\u30C8\u30A2\u3067\u304D\u307E\u305B\u3093\u3002 DependableFinder \= ''{0}''\u3002 \u8A73\u7D30\u60C5\u5831\: ''{1}''\u3002
25501=\u30A2\u30AF\u30C6\u30A3\u30D6\u30FB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306B\u63A5\u7D9A\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
42X98=\u30D3\u30E5\u30FC\u5B9A\u7FA9\u3067\u306F\u3001\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42601.S.372=ALTER TABLE \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u3001\u8868\u306B IDENTITY \u5217\u3092\u8FFD\u52A0\u3067\u304D\u307E\u305B\u3093\u3002
XSCB1.S=\u30B3\u30F3\u30C6\u30CA\u30FC {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
43X88.U=\u7A7A\u306E\u53F3\u306E\u884C\u304C\u623B\u3055\u308C\u307E\u3057\u305F
38002=\u30EB\u30FC\u30C1\u30F3\u304C\u30C7\u30FC\u30BF\u3092\u5909\u66F4\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u304C\u3001\u305D\u306E\u30EB\u30FC\u30C1\u30F3\u306F MODIFIES SQL DATA \u3068\u3057\u3066\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42601=ALTER TABLE \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u306F\u3001\u5217 ''{0}'' \u306F NOT NULL \u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u3001DEFAULT \u6587\u7BC0\u306F\u3001\u6307\u5B9A\u3055\u308C\u306A\u304B\u3063\u305F\u304B\u3001DEFAULT NULL \u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u304B\u306E\u3044\u305A\u308C\u304B\u3067\u3059\u3002
40XC0=\u975E\u6D3B\u52D5\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3002 \u539F\u56E0\u3068\u3057\u3066\u3001\u3053\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u5185\u3067\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u91CD\u5927\u5EA6\u30A8\u30E9\u30FC\u3092\u30AD\u30E3\u30C3\u30C1\u3057\u305F\u3053\u3068\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002
22027=\u7D44\u307F\u8FBC\u307F TRIM() \u95A2\u6570\u306F\u3001\u5358\u4E00\u30C8\u30EA\u30E0\u6587\u5B57\u306E\u307F\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002  LTRIM() \u304A\u3088\u3073 RTRIM() \u7D44\u307F\u8FBC\u307F\u95A2\u6570\u306F\u8907\u6570\u306E\u30C8\u30EA\u30E0\u6587\u5B57\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
XSDB0.D=\u30E1\u30E2\u30EA\u30FC\u5185\u306E\u30DA\u30FC\u30B8 {0} \u3067\u4E88\u671F\u3057\u306A\u3044\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F
43X79.U=\u5DE6\u65B9\u304B\u3089\u8868\u793A\u3055\u308C\u305F\u884C
42Y97=\u884C ''{0}''\u3001\u5217 ''{1}'' \u306B\u7121\u52B9\u306A\u30A8\u30B9\u30B1\u30FC\u30D7\u6587\u5B57\u3002
