#Thu May 16 17:55:33 BRT 2013
23503={2} na tabela ''{1}'' causou uma viola\u00E7\u00E3o na restri\u00E7\u00E3o de chave estrangeira ''{0}'' para a chave {3}.  A instru\u00E7\u00E3o foi desfeita.
XBM0J.D=O diret\u00F3rio {0} j\u00E1 existe.
XSDA1.S=Tentativa de acessar um encaixe fora da faixa em uma p\u00E1gina
42610=Os argumentos para a fun\u00E7\u00E3o COALESCE/VALUE n\u00E3o podem ser todos eles par\u00E2metros. A fun\u00E7\u00E3o precisa de pelo menos um argumento que n\u00E3o seja um par\u00E2metro.
42X89=Os tipos ''{0}'' e ''{1}'' n\u00E3o s\u00E3o compat\u00EDveis. Nenhum dos tipos pode ser atribu\u00EDdo ao outro tipo.
42502=O usu\u00E1rio ''{0}'' n\u00E3o possui a permiss\u00E3o {1} na coluna ''{2}'' da tabela ''{3}''.''{4}''.
42Z87.U=compartilhar tabela
43X97.U=tempo da proje\u00E7\u00E3o (milissegundos)
XIE0K.S=Foi especificado ponto como delimitador de cadeia de caracteres.
54004=A instru\u00E7\u00E3o SELECT possui um n\u00FAmero excessivo de itens em GROUP BY, ORDER BY ou na lista de sele\u00E7\u00E3o.
XSRSC.S=N\u00E3o \u00E9 poss\u00EDvel fazer backup do banco de dados em {0}, porque este \u00E9 um diret\u00F3rio de banco de dados.
22018=Formato de cadeia de caracteres inv\u00E1lido para o tipo {0}.
XD003.S=N\u00E3o foi poss\u00EDvel restaurar a depend\u00EAncia do disco. DependableFinder \= ''{0}''. Informa\u00E7\u00F5es adicionais\: ''{1}''.
25501=N\u00E3o \u00E9 poss\u00EDvel definir a propriedade apenas-de-leitura da conex\u00E3o em uma transa\u00E7\u00E3o ativa.
42X98=N\u00E3o s\u00E3o permitidos par\u00E2metros na defini\u00E7\u00E3o de vis\u00E3o.
42601.S.372=A instru\u00E7\u00E3o ALTER TABLE n\u00E3o pode adicionar uma coluna IDENTITY \u00E0 tabela.
XSCB1.S=Cont\u00EAiner {0} n\u00E3o encontrado.
43X88.U=Linhas \u00E0 direita vazias retornadas
38002=A rotina tentou modificar dados, mas a rotina n\u00E3o foi definida como MODIFIES SQL DATA.
42601=Na instru\u00E7\u00E3o ALTER TABLE a coluna ''{0}'' foi especificada como NOT NULL, e a cl\u00E1usula DEFAULT n\u00E3o foi especificada ou foi especificada como DEFAULT NULL.
40XC0=Instru\u00E7\u00E3o extinta. Pode ter sido causado pela captura de um erro com severidade de transa\u00E7\u00E3o dentro da instru\u00E7\u00E3o.
22027=A fun\u00E7\u00E3o nativa TRIM() suporta um \u00FAnico caractere de remo\u00E7\u00E3o.  As fun\u00E7\u00F5es nativas LTRIM() e RTRIM() suportam m\u00FAltiplos caracteres de remo\u00E7\u00E3o.
XSDB0.D=Exce\u00E7\u00E3o inesperada na p\u00E1gina de mem\u00F3ria {0}
43X79.U=Linhas vistas da esquerda
42Y97=Caractere de escape inv\u00E1lido na linha ''{0}'', coluna ''{1}''.
