#Thu May 16 17:55:33 BRT 2013
23503={2} \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 ''{1}'' \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u043D\u0430\u0440\u0443\u0448\u0435\u043D\u0438\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 ''{0}'' \u0434\u043B\u044F \u043A\u043B\u044E\u0447\u0430 {3}.  \u041F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D \u043E\u0442\u043A\u0430\u0442 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430.
XBM0J.D=\u041A\u0430\u0442\u0430\u043B\u043E\u0433 {0} \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
XSDA1.S=\u041F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u0441\u043B\u043E\u0442\u0443 \u0432\u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0433\u043E \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D\u0430 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435
42610=\u041D\u0435\u043B\u044C\u0437\u044F, \u0447\u0442\u043E\u0431\u044B \u0432\u0441\u0435 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u044B \u0444\u0443\u043D\u043A\u0446\u0438\u0438 COALESCE/VALUE \u044F\u0432\u043B\u044F\u043B\u0438\u0441\u044C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430\u043C\u0438. \u042D\u0442\u043E\u0439 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u0445\u043E\u0442\u044F \u0431\u044B \u043E\u0434\u0438\u043D \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C.
42X89=\u0422\u0438\u043F\u044B ''{0}'' \u0438 ''{1}'' \u043D\u0435\u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C\u044B \u043F\u043E \u0442\u0438\u043F\u0443. \u041D\u0438 \u043E\u0434\u0438\u043D \u0438\u0437 \u0442\u0438\u043F\u043E\u0432 \u043D\u0435\u043B\u044C\u0437\u044F \u043F\u0440\u0438\u0441\u0432\u043E\u0438\u0442\u044C \u0434\u0440\u0443\u0433\u043E\u043C\u0443 \u0442\u0438\u043F\u0443.  
42502=\u0423 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F ''{0}'' \u043D\u0435\u0442 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F {1} \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{2}'' \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{3}''.''{4}''.
42Z87.U=\u0440\u0430\u0437\u0434\u0435\u043B\u044F\u0435\u043C\u0430\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u0430
43X97.U=\u0432\u0440\u0435\u043C\u044F \u043F\u0440\u043E\u0435\u043A\u0446\u0438\u0438 (\u043C\u0441\u0435\u043A.)
XIE0K.S=\u0412 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0441\u0438\u043C\u0432\u043E\u043B\u044C\u043D\u043E\u0433\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0438\u0442\u0435\u043B\u044F \u0441\u0442\u0440\u043E\u043A\u0438 \u0443\u043A\u0430\u0437\u0430\u043D\u0430 \u0442\u043E\u0447\u043A\u0430.
54004=\u0423 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 SELECT \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043C\u043D\u043E\u0433\u043E \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u043E\u0432 \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 GROUP BY, ORDER BY \u0438\u043B\u0438 SELECT.
XSRSC.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0435 \u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 {0}; \u044D\u0442\u043E \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445.
22018=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442 \u0441\u0438\u043C\u0432\u043E\u043B\u044C\u043D\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0438 \u0434\u043B\u044F \u0442\u0438\u043F\u0430 {0}.
XD003.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u044B\u0439 \u043E\u0431\u044A\u0435\u043A\u0442 \u0441 \u0434\u0438\u0441\u043A\u0430. DependableFinder \= ''{0}''. \u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F\: ''{1}''.
25501=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0442\u043E\u043B\u044C\u043A\u043E-\u0434\u043B\u044F-\u0447\u0442\u0435\u043D\u0438\u044F \u0432 \u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0439 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438.
42X98=\u0412 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0438 VIEW \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
42601.S.372=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 ALTER TABLE \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 (IDENTITY).
XSCB1.S=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 {0} \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D.
43X88.U=\u0412\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043D\u044B\u0435 \u043F\u0440\u0430\u0432\u044B\u0435 \u043F\u0443\u0441\u0442\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438
38002=\u041F\u043E\u0434\u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0430 \u043F\u043E\u043F\u044B\u0442\u0430\u043B\u0430\u0441\u044C \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435, \u043D\u043E \u043F\u043E\u0434\u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0430 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u0430 \u043A\u0430\u043A MODIFIES SQL DATA.
42601=\u0412 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 ALTER TABLE \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u0437\u0430\u0434\u0430\u043D \u043A\u0430\u043A \u043D\u0435\u043D\u0443\u043B\u0435\u0432\u043E\u0439 (NOT NULL), \u0430 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F DEFAULT \u043B\u0438\u0431\u043E \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u0430, \u043B\u0438\u0431\u043E \u0437\u0430\u0434\u0430\u043D\u0430 \u043A\u0430\u043A DEFAULT NULL.
40XC0=\u041D\u0435\u0436\u0438\u0437\u043D\u0435\u0441\u043F\u043E\u0441\u043E\u0431\u043D\u044B\u0439 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440. \u042D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0432\u044B\u0437\u0432\u0430\u043D\u043E \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0438\u0435\u043C \u0441\u0435\u0440\u044C\u0435\u0437\u043D\u043E\u0439 \u043E\u0448\u0438\u0431\u043A\u0438 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438 \u0432\u043D\u0443\u0442\u0440\u0438 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430.
22027=\u0412\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u044F TRIM() \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u0438\u043D \u0441\u0438\u043C\u0432\u043E\u043B \u0443\u0441\u0435\u0447\u0435\u043D\u0438\u044F.  \u0412\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u044B\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 LTRIM() \u0438 RTRIM() \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u043E\u0442\u0441\u0435\u0447\u0435\u043D\u0438\u044F.
XSDB0.D=\u041D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E\u0435 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u0432 \u043F\u0430\u043C\u044F\u0442\u0438 {0}
43X79.U=\u0412\u0438\u0434\u0438\u043C\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438 \u0441\u043B\u0435\u0432\u0430
42Y97=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0439 \u0441\u0438\u043C\u0432\u043E\u043B \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 ''{0}'', \u0441\u0442\u043E\u043B\u0431\u0446\u0435 ''{1}''.
