#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' wurde nicht als Funktion oder Prozedur erkannt.
42Y30=Die SELECT-Liste einer gruppierten Abfrage enth\u00E4lt mindestens einen ung\u00FCltigen Ausdruck. Eine SELECT-Liste mit GROUP BY darf nur g\u00FCltige Gruppierungsausdr\u00FCcke und g\u00FCltige Aggregatausdr\u00FCcke enthalten. 
XSRS6.S=Das Sicherungsverzeichnis {0} kann nicht erstellt werden.
42Y03.S.2=''{0}'' wurde nicht als Funktion erkannt.
42Y03.S.1=''{0}'' wurde nicht als Prozedur erkannt.
42Y03.S.0=''{0}'' wurde nicht als Funktion oder Prozedur erkannt.
43X12.U={0} ist derzeit nicht f\u00FCr {1} implementiert.
43Y11.U=Tats\u00E4chlich verwendete Sperrung\: Sperrung auf Tabellenebene.
XSLAN.D=Das Format der Datenbank in {0} ist nicht mit der aktuellen Version der Software kompatibel. Die Datenbank wurde mit der Version {1} erstellt oder erweitert.
42Z20=Die Eintragspflicht f\u00FCr die Spalte ''{0}'' kann nicht aufgehoben werden. Sie geh\u00F6rt zu einem Prim\u00E4rschl\u00FCssel oder einer eindeutigen Integrit\u00E4tsbedingung, der bzw. die keine Spalten ohne Eintragspflicht enthalten darf.
XRE41=Replikationsvorg\u00E4nge ''failover'' oder ''stopSlave'' auf Slave-Datenbank zur\u00FCckgewiesen, da Verbindung mit Master funktioniert. F\u00FChren Sie die Replikationsvorg\u00E4nge ''failover'' oder ''stopSlave'' stattdessen auf der Master-Datenbank aus. 
XBCXQ.S=Eine schreibgesch\u00FCtzte Datenbank kann nicht f\u00FCr Verschl\u00FCsselung konfiguriert werden.
42Y12=Die ON-Klausel f\u00FCr ein JOIN ist ein Ausdruck vom Typ ''{0}''. Es muss ein Boolescher Ausdruck sein.
XCL49.S=F\u00FCr ''{0}'' ist TRUNCATE TABLE nicht zul\u00E4ssig, weil ein aktivierter DELETE-Ausl\u00F6ser vorliegt ({1}).
43X30.U=Die spezifischen Spalten haben die Nummern
42X04=Die Spalte ''{0}'' ist in keiner Tabelle der FROM-Liste enthalten, erscheint in einer Verkn\u00FCpfungsspezifikation und befindet sich au\u00DFerhalb des Geltungsbereichs derselben oder erscheint in einer HAVING-Klausel und ist nicht in der ''GROUP BY''-Liste enthalten. Wenn es sich um eine Anweisung CREATE oder ALTER TABLE handelt, ist ''{0}'' keine Spalte in der Zieltabelle.
XXXXX.C.6=Normale Beendigung der Datenbanksitzung.
42X31=Die Spalte ''{0}'' ist nicht in der ''FOR UPDATE''-Liste des Cursors ''{1}'' enthalten.
42Z20.S.1=Die Eintragspflicht f\u00FCr die Spalte ''{0}'' kann nicht aufgehoben werden. Sie geh\u00F6rt zu einem Prim\u00E4rschl\u00FCssel, der keine Spalten ohne Eintragspflicht enthalten darf.
42Z02=Mehrere DISTINCT-Aggregate werden zur Zeit nicht unterst\u00FCtzt.
XRE23=Replication Master kann nicht gestartet werden, da unprotokollierte Vorg\u00E4nge ausgef\u00FChrt werden, lassen Sie die unprotokollierten Vorg\u00E4nge beenden und starten Sie die Replikation neu
43X03.U=Anzahl der \u00D6ffnungsvorg\u00E4nge
43Y02.U=Skalares Aggregat
42Z11.U=Datenstrom
42X13=Der Spaltenname ''{0}'' erscheint in der Spaltenliste einer INSERT-Anweisung mehr als einmal. 
43X21.U=Eingegebene Zeilen
XCY00.S=Ung\u00FCltiger Wert f\u00FCr das Merkmal ''{0}''\=''{1}''.
X0X0D.S=Ung\u00FCltige L\u00E4nge f\u00FCr Spalten-Array ''{0}''. Um erstellte Schl\u00FCssel zur\u00FCckzugeben, muss  das Spalten-Array die L\u00E4nge 1 haben und darf nur die Identit\u00E4tsspalte enthalten.
XRE05=Die Protokolldateien von Master und Slave sind nicht synchron f\u00FCr die replizierte Datenbank ''{0}''. Die Protokollzeit des Master ist {1}\:{2}, die des Slave dagegen {3}\:{4}. Dies f\u00FChrt zu einem schweren Fehler bei der Replikation, die Replikation wird angehalten.
43Y20.U=VTI
42X40=Ein Operand einer NOT-Anweisung ist kein Boolescher Operand. Das Ergebnis der Auswertung f\u00FCr den Operanden von NOT muss TRUE, FALSE oder UNKNOWN sein.
