#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' \u043D\u0435 \u0440\u0430\u0441\u043F\u043E\u0437\u043D\u0430\u043D\u043E \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u044B.
42Y30=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 SELECT \u0434\u043B\u044F \u0433\u0440\u0443\u043F\u043F\u043E\u0432\u043E\u0433\u043E \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u043D\u043E \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435. \u0415\u0441\u043B\u0438 \u0434\u043B\u044F \u0441\u043F\u0438\u0441\u043A\u0430 SELECT \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F GROUP BY, \u0432 \u044D\u0442\u043E\u043C \u0441\u043F\u0438\u0441\u043A\u0435 \u043C\u043E\u0433\u0443\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0432 \u0433\u0440\u0443\u043F\u043F\u044B \u0438 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0446\u0438\u0438.  
XSRS6.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0439 \u043A\u043E\u043F\u0438\u0438 {0}.
43X12.U={0} \u0432 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043E \u0434\u043B\u044F {1}
43Y11.U=\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u0430\u044F \u0440\u0435\u0430\u043B\u044C\u043D\u0430\u044F \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0430\: \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0430 \u043D\u0430 \u0443\u0440\u043E\u0432\u043D\u0435 \u0442\u0430\u0431\u043B\u0438\u0446.
XSLAN.D=\u0424\u043E\u0440\u043C\u0430\u0442 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 {0} \u043D\u0435\u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C \u0441 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0432\u0435\u0440\u0441\u0438\u0435\u0439 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u044B.  \u0411\u0435\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u043E\u0437\u0434\u0430\u043D\u0430 \u0438\u043B\u0438 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0430 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u043E\u0439 \u0432\u0435\u0440\u0441\u0438\u0438 {1}.
42Z20=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u043C. \u041E\u043D \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u0433\u043B\u0430\u0432\u043D\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0438\u043B\u0438 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F, \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
XBCXQ.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u0443\u044E \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F, \u0434\u043B\u044F \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F.
42Y12=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F ON \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F (JOIN) \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 ''{0}''.  \u041E\u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u0430 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u0435 (BOOLEAN) \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435.
XCL49.S=TRUNCATE TABLE \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F ''{0}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u043D\u044B\u0439 \u0442\u0440\u0438\u0433\u0433\u0435\u0440 DELETE ({1}).
43X30.U=\u041E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u044B - \u044D\u0442\u043E \u043D\u043E\u043C\u0435\u0440\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432
42X04=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u043B\u0438\u0431\u043E \u043D\u0435 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u043D\u0438 \u0432 \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u0442\u0430\u0431\u043B\u0438\u0446 \u0438\u0437 \u0441\u043F\u0438\u0441\u043A\u0430 FROM, \u043B\u0438\u0431\u043E \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0438 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432\u043D\u0435 \u043E\u0431\u043B\u0430\u0441\u0442\u0438 \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F, \u043B\u0438\u0431\u043E \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 HAVING \u0438 \u043D\u0435 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 GROUP BY. \u0415\u0441\u043B\u0438 \u044D\u0442\u043E \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 CREATE \u0438\u043B\u0438 ALTER TABLE, \u0442\u043E ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u043C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F.
42X31=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u043D\u0435 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 FOR UPDATE \u0434\u043B\u044F \u043A\u0443\u0440\u0441\u043E\u0440\u0430 ''{1}''.
XXXXX.C.6=\u041E\u0431\u044B\u0447\u043D\u043E\u0435 \u0437\u0430\u043A\u0440\u044B\u0442\u0438\u0435 \u0441\u0435\u0430\u043D\u0441\u0430 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445.
42Z02=\u0412 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0430\u0433\u0440\u0435\u0433\u0430\u0442\u043E\u0432 DISTINCT \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442\u0441\u044F.
43X03.U=\u0427\u0438\u0441\u043B\u043E \u043E\u0442\u043A\u0440\u044B\u0442\u0438\u0439
43Y02.U=\u0421\u043A\u0430\u043B\u044F\u0440\u043D\u044B\u0439 \u0430\u0433\u0440\u0435\u0433\u0430\u0442
42Z11.U=\u043F\u043E\u0442\u043E\u043A
42X13=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 INSERT \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430. 
43X21.U=\u0412\u0432\u0435\u0441\u0442\u0438 \u0441\u0442\u0440\u043E\u043A\u0438
XCY00.S=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 ''{0}''\=''{1}''.
43Y20.U=VTI
42X40=\u0423 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 NOT \u0435\u0441\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u043D\u0434, \u043D\u0435 \u044F\u0432\u043B\u044F\u044E\u0449\u0438\u0439\u0441\u044F \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u0438\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C. \u041E\u043F\u0435\u0440\u0430\u043D\u0434 NOT \u0434\u043E\u043B\u0436\u0435\u043D \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0442\u044C\u0441\u044F \u0432 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F TRUE, FALSE \u0438\u043B\u0438 UNKNOWN. 
