#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' nen\u00ED rozpozn\u00E1no jako funkce nebo procedura.
42Y30=Seznam SELECT seskupen\u00E9ho dotazu obsahuje alespo\u0148 jeden neplatn\u00FD v\u00FDraz. Pokud seznam SELECT m\u00E1 klauzuli GROUP BY, m\u016F\u017Ee obsahovat pouze platn\u00E9 v\u00FDrazy seskupen\u00ED a platn\u00E9 seskupen\u00E9 v\u00FDrazy. 
XSRS6.S=Nelze vytvo\u0159it adres\u00E1\u0159 z\u00E1lohy {0}.
43X12.U={0} moment\u00E1ln\u011B nen\u00ED implementov\u00E1no pro {1}
43Y11.U=Aktu\u00E1ln\u00ED pou\u017E\u00EDvan\u00E9 uzam\u010Den\u00ED\: uzam\u010Den\u00ED na \u00FArovni tabulky.
XSLAN.D=Datab\u00E1ze v {0} m\u00E1 form\u00E1t, kter\u00FD je nekompatibiln\u00ED s aktu\u00E1ln\u00ED verz\u00ED softwaru. Datab\u00E1ze byla vytvo\u0159ena nebo pov\u00FD\u0161ena verz\u00ED {1}.
42Z20=Sloupec ''{0}'' nem\u016F\u017Ee nab\u00FDvat hodnoty ''null''. Je sou\u010D\u00E1st\u00ED prim\u00E1rn\u00EDho kl\u00ED\u010De nebo jedine\u010Dn\u00E9ho omezen\u00ED, kter\u00E9 nem\u016F\u017Ee m\u00EDt \u017E\u00E1dn\u00E9 sloupce, kter\u00E9 mohou obsahovat hodnoty ''null''.
XBCXQ.S=Nelze konfigurovat datab\u00E1zi, kter\u00E1 slou\u017E\u00ED pouze pro \u010Dten\u00ED, pro \u0161ifrov\u00E1n\u00ED.
42Y12=Klauzule ON oper\u00E1toru JOIN je v\u00FDraz ''{0}''. Mus\u00ED b\u00FDt v\u00FDrazem typu BOOLEAN.
XCL49.S=TRUNCATE TABLE nen\u00ED povoleno v ''{0}'', proto\u017Ee m\u00E1 aktivovan\u00FD trigger DELETE ({1}).
43X30.U=Odli\u0161en\u00EDmi sloupc\u016F jsou \u010D\u00EDsla sloupc\u016F
42X04=Sloupec ''{0}'' bu\u010F nen\u00ED v \u017E\u00E1dn\u00E9 tabulce v seznamu FROM, nebo se objevuje ve slou\u010Den\u00E9 specifikaci a je mimo rozsah slou\u010Den\u00E9 specifikace, nebo se objevuje v klauzuli HAVING a nen\u00ED v seznamu GROUP BY. Pokud se jedn\u00E1 o p\u0159\u00EDkaz CREATE nebo ALTER TABLE, ''{0}'' nen\u00ED sloupcem v c\u00EDlov\u00E9 tabulce.
42X31=Sloupec ''{0}'' nen\u00ED v seznamu FOR UPDATE kurzoru ''{1}''.
XXXXX.C.6=Norm\u00E1ln\u00ED zav\u0159en\u00ED relace datab\u00E1ze.
42Z02=Moment\u00E1ln\u011B nejsou podporov\u00E1ny v\u00EDcen\u00E1sobn\u00E9 seskupen\u00E9 v\u00FDrazy DISTINCT.
43X03.U=Po\u010Det otev\u0159en\u00ED
43Y02.U=Skal\u00E1rn\u00ED seskupen\u00FD v\u00FDraz
42Z11.U=tok dat
42X13=Jm\u00E9no sloupce ''{0}'' se objevuje v\u00EDce ne\u017E jednou v seznamu sloupc\u016F p\u0159\u00EDkazu INSERT. 
43X21.U=Vlo\u017Een\u00E9 \u0159\u00E1dky
XCY00.S=Neplatn\u00E1 hodnota pro vlastnost ''{0}''\=''{1}''.
43Y20.U=VTI
42X40=P\u0159\u00EDkaz NOT m\u00E1 operand, kter\u00FD nen\u00ED logickou hodnotou. Operand p\u0159\u00EDkazu NOT se mus\u00ED vyhodnotit na hodnotu TRUE, FALSE nebo UNKNOWN. 
