#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' n''est pas reconnu comme fonction ou proc\u00E9dure.
42Y30=La liste SELECT d''une requ\u00EAte group\u00E9e contient au moins une expression non valide. Si une liste SELECT comporte un \u00E9l\u00E9ment GROUP BY, la liste ne peut contenir que des expressions de regroupement et des expressions d''agr\u00E9gat valides.  
XSRS6.S=Impossible de cr\u00E9er le r\u00E9pertoire de sauvegarde {0}.
42Y03.S.2=''{0}'' n''est pas reconnu comme fonction.
42Y03.S.1=''{0}'' n''est pas reconnu comme proc\u00E9dure.
42Y03.S.0=''{0}'' n''est pas reconnu comme fonction ou proc\u00E9dure.
43X12.U={0} non impl\u00E9ment\u00E9 actuellement pour {1}
43Y11.U=Verrouillage effectif utilis\u00E9 \: verrouillage au niveau de la table
XSLAN.D=La base de donn\u00E9es situ\u00E9e dans {0} utilise un format incompatible avec la version actuelle du logiciel.  La base de donn\u00E9es a \u00E9t\u00E9 cr\u00E9\u00E9e ou mise \u00E0 niveau par la version {1}.
42Z20=La colonne ''{0}'' ne peut pas accepter de valeur NULL. Elle fait partie d''une cl\u00E9 primaire ou d''une contrainte d''unicit\u00E9 qui ne peuvent pas contenir de colonnes ayant une valeur nulle.
XRE41=Op\u00E9ration de r\u00E9plication ''failover'' ou ''stopSlave'' refus\u00E9e sur la base de donn\u00E9es esclave car la connexion avec le ma\u00EEtre est active. Emettez plut\u00F4t l''op\u00E9ration ''failover'' ou '''stopMaster'' sur la base de donn\u00E9es ma\u00EEtre.
XBCXQ.S=Impossible de configurer une base de donn\u00E9es en lecture seule pour le chiffrement.
42Y12=La clause ON d''un \u00E9l\u00E9ment JOIN est une expression ''{0}''.  Il faut que ce soit une expression BOOLEENNE.
XCL49.S=L''instruction TRUNCATE TABLE n''est pas autoris\u00E9e sur ''{0}'' parce qu''elle contient un d\u00E9clencheur DELETE activ\u00E9 ({1}).
43X30.U=Les colonnes distinctes sont les num\u00E9ros de colonne
42X04=La colonne ''{0}'' ne se trouve dans aucune table de la liste FROM ou figure dans une sp\u00E9cification de jointure et se trouve en dehors de la port\u00E9e de cette sp\u00E9cification ou figure dans une clause HAVING mais ne se trouve pas dans la liste GROUP BY. S''il s''agit d''une instruction CREATE ou ALTER TABLE, alors ''{0}'' n''est pas une colonne de la table cible.
XXXXX.C.6=La session de base de donn\u00E9es normale est ferm\u00E9e.
42X31=La colonne ''{0}'' ne se trouve pas dans la liste FOR UPDATE du curseur ''{1}''.
42Z20.S.1=La colonne ''{0}'' ne peut pas accepter de valeur NULL. Elle fait partie d''une cl\u00E9 primaire qui ne peut pas contenir de colonnes ayant une valeur nulle.
42Z02=Plusieurs agr\u00E9gats DISTINCT ne sont pas pris en charge \u00E0 ce stade.
XRE23=Impossible de d\u00E9marrer le ma\u00EEtre de r\u00E9plication car des op\u00E9rations non enregistr\u00E9es sont en cours d''ex\u00E9cution. D\u00E9bloquez pour permettre aux op\u00E9rations non enregistr\u00E9es de s''ex\u00E9cuter jusqu''au bout et red\u00E9marrez la r\u00E9plication.
43X03.U=Nombre d''ouvertures
43Y02.U=Agr\u00E9gat scalaire
42Z11.U=flux
42X13=Le nom de colonne ''{0}'' figure plusieurs fois dans la liste des colonnes d''une instruction INSERT. 
43X21.U=Lignes entr\u00E9es
XCY00.S=Valeur non valide pour la propri\u00E9t\u00E9 ''{0}''\=''{1}''.
X0X0D.S=Longueur du tableau de colonnes ''{0}'' invalide. Pour renvoyer les cl\u00E9s g\u00E9n\u00E9r\u00E9es, le tableau de colonnes doit avoir une longueur de 1 et ne doit contenir que la colonne d''identit\u00E9.
XRE05=Les fichiers journaux sur le ma\u00EEtre et l''esclave ne sont pas synchronis\u00E9s pour la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}''. L''instant journal du ma\u00EEtre est {1}\:{2}, tandis que l''instant journal de l''esclave est {3}\:{4}. FATAL pour la r\u00E9plication - la r\u00E9plication sera arr\u00EAt\u00E9e.
43Y20.U=VTI
42X40=Une instruction NOT comporte un op\u00E9rande qui n''est pas bool\u00E9en. L''op\u00E9rande de NOT doit avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN. 
