#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' n\u00E3o \u00E9 reconhecido como uma fun\u00E7\u00E3o ou procedimento.
42Y30=A lista SELECT de uma consulta agrupada cont\u00E9m pelo menos uma express\u00E3o inv\u00E1lida. Se uma lista SELECT cont\u00E9m GROUP BY, a lista pode conter apenas colunas de agrupamento e express\u00F5es de agrega\u00E7\u00E3o v\u00E1lidas.
XSRS6.S=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio de backup {0}.
43X12.U={0} n\u00E3o est\u00E1 atualmente implementado para {1}
43Y11.U=Bloqueio real utilizado\: bloqueio de n\u00EDvel de tabela.
XSLAN.D=O banco de dados em {0} possui um formato incompat\u00EDvel com a vers\u00E3o corrente do software.  O banco de dados foi criado ou atualizado pela vers\u00E3o {1}.
42Z20=A coluna ''{0}'' n\u00E3o pode ser alterada para aceitar valores nulos, porque faz parte de uma chave prim\u00E1ria que n\u00E3o pode ter nenhuma coluna que aceita o valor nulo.
XBCXQ.S=N\u00E3o \u00E9 poss\u00EDvel configurar um banco de dados de leitura para criptografia.
42Y12=A cl\u00E1usula ON do JOIN \u00E9 uma express\u00E3o ''{0}''.  Deve ser uma express\u00E3o booleana.
XCL49.S=N\u00E3o \u00E9 permitido TRUNCATE TABLE em ''{0}'', porque esta possui um gatilho DELETE habilitado ({1}).
43X30.U=As colunas distintas s\u00E3o os n\u00FAmeros de colunas
42X04=A coluna ''{0}'' n\u00E3o est\u00E1 presente em nenhuma tabela da lista FROM, ou aparece dentro de uma especifica\u00E7\u00E3o de jun\u00E7\u00E3o e est\u00E1 fora do escopo da especifica\u00E7\u00E3o de jun\u00E7\u00E3o, ou aparece em uma cl\u00E1usula HAVING e n\u00E3o est\u00E1 na lista GROUP BY. Se esta for uma instru\u00E7\u00E3o CREATE ou ALTER TABLE, ent\u00E3o, ''{0}'' n\u00E3o \u00E9 uma coluna da tabela de destino.
42X31=A coluna ''{0}'' n\u00E3o faz parte da lista FOR UPDATE do cursor ''{1}''.
XXXXX.C.6=Encerramento normal da sess\u00E3o do banco de dados.
42Z02=Atualmente n\u00E3o \u00E9 suportado mais de uma agrega\u00E7\u00E3o com DISTINCT.
43X03.U=N\u00FAmero de aberturas
43Y02.U=Agrega\u00E7\u00E3o escalar
42Z11.U=fluxo
42X13=O nome de coluna ''{0}'' aparece mais de uma vez na lista de colunas da instru\u00E7\u00E3o INSERT.
43X21.U=Entrada de linhas
XCY00.S=Valor inv\u00E1lido para a propriedade ''{0}''\=''{1}''.
43Y20.U=VTI
42X40=Uma instru\u00E7\u00E3o NOT possui um operando que n\u00E3o \u00E9 booleano. O operando de NOT deve ser avaliado como TRUE, FALSE ou UNKNOWN.
