#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' no se reconoce como una funci\u00F3n o procedimiento.
42Y30=La lista SELECT de una consulta agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Si una lista SELECT tiene un GROUP BY, la lista s\u00F3lo puede contener expresiones de agrupaci\u00F3n v\u00E1lidas y expresiones de agregaci\u00F3n v\u00E1lidas.  
XSRS6.S=No se puede crear el directorio de copia de seguridad {0}.
42Y03.S.2=''{0}'' no se reconoce como una funci\u00F3n.
42Y03.S.1=''{0}'' no se reconoce como un procedimiento.
42Y03.S.0=''{0}'' no se reconoce como una funci\u00F3n o procedimiento.
43X12.U={0} no se ha implementado actualmente para {1}
43Y11.U=Bloqueo real utilizado\: nivel de bloqueo de tabla.
XSLAN.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software.  La base de datos se ha creado o actualizado con la versi\u00F3n {1}.
42Z20=La columna ''{0}'' no puede aceptar nulos. Forma parte de una clave primaria o restricci\u00F3n \u00FAnica, que no puede tener columnas con valores nulos.
XRE41=Se ha rechazado la operaci\u00F3n de repetici\u00F3n ''failover'' o ''stopSlave'' en la base de datos secundaria porque est\u00E1 en funcionamiento la conexi\u00F3n con la principal. En lugar de ello, emita la operaci\u00F3n ''failover'' o ''stopMaster'' en la base de datos principal.
XBCXQ.S=No se puede configurar una base de datos de s\u00F3lo lectura para cifrado.
42Y12=La cl\u00E1usula ON de JOIN es una expresi\u00F3n ''{0}''.  Debe ser una expresi\u00F3n BOOLEAN.
XCL49.S=No se permite TRUNCATE TABLE en ''{0}'' porque tiene habilitado un desencadenante DELETE ({1}).
43X30.U=Columnas distinct son los n\u00FAmeros de columna
42X04=La columna ''{0}'' no est\u00E1 en ninguna tabla de la lista FROM o aparece en una especificaci\u00F3n de uni\u00F3n y est\u00E1 fuera del \u00E1mbito de la especificaci\u00F3n de uni\u00F3n o bien aparece en una cl\u00E1usula HAVING y no est\u00E1 en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE entonces ''{0}'' no es una columna de la tabla destino.
XXXXX.C.6=Cierre de sesi\u00F3n de base de datos normal.
42X31=La columna ''{0}'' no est\u00E1 en la lista FOR UPDATE del cursor ''{1}''.
42Z20.S.1=La columna ''{0}'' no puede aceptar nulos. Forma parte de una clave primaria, que no puede tener columnas con valores nulos.
42Z02=En este momento no se soportan agregados DISTINCT m\u00FAltiples.
XRE23=No se ha podido iniciar la repetici\u00F3n principal porque hay en curso operaciones sin registrar. Desbloquee para permitir que las operaciones no registradas se completen y reinicie la repetici\u00F3n.
43X03.U=N\u00FAmero de aperturas
43Y02.U=Agregado escalar
42Z11.U=corriente
42X13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la lista de columnas de una sentencia INSERT. 
43X21.U=Filas introducidas
XCY00.S=Valor no v\u00E1lido para la propiedad ''{0}''\=''{1}''.
X0X0D.S=Longitud de matriz de columna no v\u00E1lida ''{0}''. Para devolver claves generadas, la matriz de columna debe ser de longitud 1 y contener la columna de identidad.
XRE05=Los archivos de registro de principal y secundario no est\u00E1n sincronizados para la base de datos repetida ''{0}''. La instant\u00E1nea del registro principal es {1}\:{2}, mientras que la instant\u00E1nea del registro secundario es {3}\:{4}. Es GRAVE para la repetici\u00F3n\: se detendr\u00E1 la repetici\u00F3n.
43Y20.U=VTI
42X40=Una sentencia NOT tiene un operando que no es booleano. El operando de NOT debe dar como resultado TRUE, FALSE o UNKNOWN. 
