#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' nie zosta\u0142a rozpoznana jako funkcja lub procedura.
42Y30=Lista SELECT grupowanego zapytania zawiera przynajmniej jedno niepoprawne wyra\u017Cenie. Je\u015Bli lista SELECT zawiera instrukcj\u0119 GROUP BY, lista mo\u017Ce zawiera\u0107 tylko poprawne wyra\u017Cenia grupuj\u0105ce oraz poprawne wyra\u017Cenia agreguj\u0105ce. 
XSRS6.S=Nie mo\u017Cna utworzy\u0107 katalogu sk\u0142adowania {0}.
43X12.U=Obiekt {0} nie jest obecnie zaimplementowany dla {1}
43Y11.U=Wykorzystywane bie\u017C\u0105ce blokowanie\: blokowanie na poziomie tabeli.
XSLAN.D=Baza danych w {0} ma format niekompatybilny z bie\u017C\u0105c\u0105 wersj\u0105 oprogramowania. Baza danych zosta\u0142a utworzona lub aktualizowana w wersji {1}.
42Z20=Kolumna ''{0}'' nie mo\u017Ce mie\u0107 warto\u015Bci null. Jest cz\u0119\u015Bci\u0105 klucza podstawowego lub ograniczenia przez unikalno\u015B\u0107, kt\u00F3re nie mog\u0105 mie\u0107 kolumn z dopuszczaln\u0105 warto\u015Bci\u0105 null.
XBCXQ.S=Nie mo\u017Cna skonfigurowa\u0107 bazy danych tylko do odczytu w celu zaszyfrowania.
42Y12=Klauzula ON instrukcji JOIN jest wyra\u017Ceniem typu ''{0}''. Musi by\u0107 wyra\u017Ceniem typu BOOLEAN.
XCL49.S=Instrukcja TRUNCATE TABLE nie jest dozwolona dla ''{0}'', poniewa\u017C w\u0142\u0105czy\u0142a wyzwalacz DELETE ({1}).
43X30.U=Kolumny odr\u0119bne s\u0105 numerami kolumn
42X04=Kolumna ''{0}'' nie znajduje si\u0119 w \u017Cadnej tabeli z listy FROM lub pojawia si\u0119 w specyfikacji \u0142\u0105czenia i jest poza zasi\u0119giem tej specyfikacji, albo pojawia si\u0119 w klauzuli HAVING i nie ma jej na li\u015Bcie GROUP BY. Je\u015Bli jest to instrukcja CREATE lub ALTER TABLE, wtedy ''{0}'' nie jest kolumn\u0105 w tabeli docelowej.
42X31=Kolumny ''{0}'' nie ma na li\u015Bcie FOR UPDATE kursora ''{1}''.
XXXXX.C.6=Zamkni\u0119cie zwyk\u0142ej sesji bazy danych.
42Z02=Obecnie wiele agregat\u00F3w DISTINCT nie jest obs\u0142ugiwanych.
43X03.U=Liczba otwartych
43Y02.U=Agregat skalarny
42Z11.U=strumie\u0144
42X13=Nazwa kolumny ''{0}'' pojawia si\u0119 na li\u015Bcie kolumn instrukcji INSERT wi\u0119cej ni\u017C jeden raz. 
43X21.U=Wej\u015Bcie wierszy
XCY00.S=Niepoprawna warto\u015B\u0107 w\u0142a\u015Bciwo\u015Bci ''{0}''\=''{1}''.
43Y20.U=Interfejs VTI
42X40=Instrukcja NOT zawiera operand, kt\u00F3ry nie jest warto\u015Bci\u0105 boolowsk\u0105. Operand instrukcji NOT musi mie\u0107 warto\u015B\u0107 TRUE, FALSE lub UNKNOWN. 
