#Thu May 16 17:55:33 BRT 2013
42Y03=''{0}'' \u306F\u95A2\u6570\u307E\u305F\u306F\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u3068\u3057\u3066\u8A8D\u8B58\u3055\u308C\u307E\u305B\u3093\u3002
42Y30=\u30B0\u30EB\u30FC\u30D7\u5316\u3055\u308C\u305F\u7167\u4F1A\u306E SELECT \u30EA\u30B9\u30C8\u306B\u3001\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u7121\u52B9\u306A\u5F0F\u304C\u3042\u308A\u307E\u3059\u3002 SELECT \u30EA\u30B9\u30C8\u306B GROUP BY \u304C\u3042\u308B\u5834\u5408\u3001\u30EA\u30B9\u30C8\u306B\u306F\u6709\u52B9\u306A\u30B0\u30EB\u30FC\u30D7\u5316\u5F0F\u3068\u6709\u52B9\u306A\u96C6\u5408\u4F53\u5F0F\u3057\u304B\u542B\u3080\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
XSRS6.S=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC {0} \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
42Y03.S.2=''{0}'' \u306F\u95A2\u6570\u3068\u3057\u3066\u8A8D\u8B58\u3055\u308C\u307E\u305B\u3093\u3002
42Y03.S.1=''{0}'' \u306F\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u3068\u3057\u3066\u8A8D\u8B58\u3055\u308C\u307E\u305B\u3093\u3002
42Y03.S.0=''{0}'' \u306F\u95A2\u6570\u307E\u305F\u306F\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u3068\u3057\u3066\u8A8D\u8B58\u3055\u308C\u307E\u305B\u3093\u3002
43X12.U={0} \u306F\u3001{1} \u306B\u5BFE\u3057\u3066\u73FE\u5728\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
43Y11.U=\u5B9F\u969B\u306B\u4F7F\u7528\u3055\u308C\u305F\u30ED\u30C3\u30AD\u30F3\u30B0\: \u8868\u30EC\u30D9\u30EB\u30ED\u30C3\u30AD\u30F3\u30B0
XSLAN.D={0} \u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u306F\u3001\u3053\u306E\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u73FE\u884C\u30D0\u30FC\u30B8\u30E7\u30F3\u3068\u975E\u4E92\u63DB\u3067\u3059\u3002  \u3053\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F\u3001\u30D0\u30FC\u30B8\u30E7\u30F3 {1} \u306B\u3088\u3063\u3066\u4F5C\u6210\u307E\u305F\u306F\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3055\u308C\u307E\u3057\u305F\u3002
42Z20=\u5217 ''{0}'' \u3092 NULL \u53EF\u80FD\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u308C\u306F\u4E3B\u30AD\u30FC\u307E\u305F\u306F\u30E6\u30CB\u30FC\u30AF\u5236\u7D04\u306E\u4E00\u90E8\u3067\u3042\u308A\u3001NULL \u53EF\u80FD\u5217\u3092\u6301\u3064\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XRE41=\u30DE\u30B9\u30BF\u30FC\u3068\u306E\u63A5\u7D9A\u304C\u6A5F\u80FD\u3057\u3066\u3044\u308B\u305F\u3081\u3001\u30B9\u30EC\u30FC\u30D6\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u8907\u88FD\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''failover'' \u307E\u305F\u306F ''stopSlave'' \u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002\u4EE3\u308F\u308A\u306B\u3001\u30DE\u30B9\u30BF\u30FC\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u5BFE\u3057\u3066 ''failover'' \u307E\u305F\u306F ''stopMaster'' \u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u767A\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XBCXQ.S=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u6697\u53F7\u5316\u7528\u306B\u69CB\u6210\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42Y12=JOIN \u306E ON \u6587\u7BC0\u304C ''{0}'' \u5F0F\u3067\u3059\u3002  \u3053\u308C\u306F\u30D6\u30FC\u30EB\u5F0F\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
XCL49.S=''{0}'' \u306F\u4F7F\u7528\u53EF\u80FD\u306A DELETE \u30C8\u30EA\u30AC\u30FC ({1}) \u3092\u6301\u3063\u3066\u3044\u308B\u305F\u3081\u3001\u3053\u308C\u306B\u5BFE\u3059\u308B TRUNCATE TABLE \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
43X30.U=\u7279\u6B8A\u5217\u306F\u5217\u756A\u53F7
42X04=\u5217 ''{0}'' \u306F\u3001FROM \u30EA\u30B9\u30C8\u5185\u306E\u3069\u306E\u8868\u306B\u3082\u306A\u3044\u304B\u3001\u7D50\u5408\u4ED5\u69D8\u5185\u306B\u3042\u308B\u4E00\u65B9\u3067\u305D\u306E\u7D50\u5408\u4ED5\u69D8\u306E\u7BC4\u56F2\u5916\u3067\u3042\u308B\u304B\u3001\u307E\u305F\u306F HAVING \u6587\u7BC0\u5185\u306B\u3042\u308B\u4E00\u65B9\u3067 GROUP BY \u30EA\u30B9\u30C8\u306B\u5165\u3063\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002 \u3053\u308C\u304C CREATE \u307E\u305F\u306F ALTER TABLE \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u5834\u5408\u3001''{0}'' \u306F\u30BF\u30FC\u30B2\u30C3\u30C8\u8868\u5185\u306E\u5217\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XXXXX.C.6=\u901A\u5E38\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30AF\u30ED\u30FC\u30BA\u3002
42X31=\u5217 ''{0}'' \u306F\u30AB\u30FC\u30BD\u30EB ''{1}'' \u306E FOR UPDATE \u30EA\u30B9\u30C8\u306B\u3042\u308A\u307E\u305B\u3093\u3002
42Z20.S.1=\u5217 ''{0}'' \u3092 NULL \u53EF\u80FD\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002 \u3053\u308C\u306F\u4E3B\u30AD\u30FC\u306E\u4E00\u90E8\u3067\u3042\u308A\u3001NULL \u53EF\u80FD\u5217\u3092\u6301\u3064\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42Z02=\u3053\u3053\u3067\u306F\u3001\u8907\u6570\u306E DISTINCT \u96C6\u5408\u4F53\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XRE23=\u30ED\u30B0\u8A18\u9332\u3055\u308C\u306A\u3044\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u308B\u305F\u3081\u3001\u8907\u88FD\u30DE\u30B9\u30BF\u30FC\u3092\u958B\u59CB\u3067\u304D\u307E\u305B\u3093\u3002\u30D5\u30EA\u30FC\u30BA\u3092\u89E3\u9664\u3057\u3066\u30ED\u30B0\u8A18\u9332\u3055\u308C\u306A\u3044\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B8C\u4E86\u3055\u305B\u305F\u3042\u3068\u3001\u8907\u88FD\u3092\u518D\u958B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
43X03.U=\u30AA\u30FC\u30D7\u30F3\u306E\u6570
43Y02.U=\u30B9\u30AB\u30E9\u30FC\u96C6\u5408\u4F53
42Z11.U=\u30B9\u30C8\u30EA\u30FC\u30E0
42X13=\u5217\u540D ''{0}'' \u306F\u3001INSERT \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u5217\u30EA\u30B9\u30C8\u3067\u8907\u6570\u56DE\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002 
43X21.U=\u5165\u529B\u3055\u308C\u305F\u884C
XCY00.S=\u7121\u52B9\u306A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u5024 ''{0}''\=''{1}''\u3002
X0X0D.S=\u5217\u306E\u914D\u5217\u9577 ''{0}'' \u304C\u7121\u52B9\u3067\u3059\u3002\u751F\u6210\u3055\u308C\u305F\u30AD\u30FC\u3092\u8FD4\u3059\u306B\u306F\u3001\u5217\u306E\u914D\u5217\u306E\u9577\u3055\u304C 1 \u3067\u3042\u308A\u3001ID \u5217\u306E\u307F\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
XRE05=\u8907\u88FD\u3055\u308C\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u30DE\u30B9\u30BF\u30FC\u3068\u30B9\u30EC\u30FC\u30D6\u4E0A\u306E\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u540C\u671F\u304C\u3068\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u30DE\u30B9\u30BF\u30FC\u306E\u30ED\u30B0\u30A4\u30F3\u30B9\u30BF\u30F3\u30C8\u304C {1}\:{2} \u3067\u3042\u308B\u306E\u306B\u5BFE\u3057\u3066\u3001\u30B9\u30EC\u30FC\u30D6\u306E\u30ED\u30B0\u30A4\u30F3\u30B9\u30BF\u30F3\u30C8\u306F {3}\:{4} \u3067\u3059\u3002\u8907\u88FD\u306B\u306F\u81F4\u547D\u7684\u306A\u30A8\u30E9\u30FC\u3067\u3059 - \u8907\u88FD\u304C\u505C\u6B62\u3055\u308C\u307E\u3059\u3002
43Y20.U=VTI
42X40=NOT \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C\u30D6\u30FC\u30EB\u3067\u306A\u3044\u30AA\u30DA\u30E9\u30F3\u30C9\u3092\u6301\u3063\u3066\u3044\u307E\u3059\u3002 NOT \u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u306F\u3001TRUE\u3001FALSE\u3001\u307E\u305F\u306F UNKNOWN \u3068\u3057\u3066\u8A55\u4FA1\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 
