#Thu May 16 17:55:33 BRT 2013
42Y03=A(z) ''{0}'' nem felismert f\u00FCggv\u00E9nyk\u00E9nt vagy elj\u00E1r\u00E1sk\u00E9nt.
42Y30=A csoportos\u00EDtott lek\u00E9rdez\u00E9s SELECT list\u00E1ja legal\u00E1bb egy \u00E9rv\u00E9nytelen kifejez\u00E9st tartalmaz. Ha a SELECT lista rendelkezik GROUP BY r\u00E9szkifejez\u00E9ssel, akkor a lista csak \u00E9rv\u00E9nyes csoportos\u00EDt\u00E1si kifejez\u00E9seket \u00E9s \u00E9rv\u00E9nyes \u00F6sszes\u00EDt\u0151 kifejez\u00E9seket tartalmazhat. 
XSRS6.S=Nem hozhat\u00F3 l\u00E9tre a k\u00F6vetkez\u0151 ment\u00E9si k\u00F6nyvt\u00E1r\: {0}.
43X12.U=A(z) {0} jelenleg a(z) {1} elemhez nincs megval\u00F3s\u00EDtva
43Y11.U=Jelenleg haszn\u00E1lt z\u00E1rol\u00E1s\: t\u00E1bla szint\u0171 z\u00E1rol\u00E1s.
XSLAN.D=A(z) {0} alatt tal\u00E1lhat\u00F3 adatb\u00E1zis form\u00E1tuma nem kompatibilis a szoftver jelenlegi v\u00E1ltozat\u00E1val.  Az adatb\u00E1zist a(z) {1} v\u00E1ltozat hozta l\u00E9tre vagy friss\u00EDtette.
42Z20=A(z) ''{0}'' oszlop nem tehet\u0151 nullk\u00E9pess\u00E9. Ez egy els\u0151dleges kulcs vagy egyedi megszor\u00EDt\u00E1s r\u00E9sze, amely nem rendelkezhet nullk\u00E9pes oszlopokkal.
XBCXQ.S=Nem \u00E1ll\u00EDthat\u00F3 be \u00EDr\u00E1sv\u00E9dett adatb\u00E1zis titkos\u00EDt\u00E1sra.
42Y12=A JOIN ON r\u00E9szkifejez\u00E9se egy ''{0}'' kifejez\u00E9s.  BOOLEAN kifejez\u00E9snek kell lennie.
XCL49.S=A TRUNCATE TABLE ''{0}'' elemen nem megengedett, mivel enged\u00E9lyezett DELETE triggerrel ({1}) rendelkezik.
43X30.U=Az elk\u00FCl\u00F6n\u00EDtett oszlopok oszlopsz\u00E1mok
42X04=A(z) ''{0}'' oszlop nincs a FROM lista egy oszlop\u00E1ban sem, vagy egy join specifik\u00E1ci\u00F3ban jelenik meg \u00E9s k\u00EDv\u00FCl van annak hat\u00F3k\u00F6r\u00E9n, vagy egy HAVING r\u00E9szkifejez\u00E9sben l\u00E1that\u00F3 \u00E9s nincs benne a GROUP BY list\u00E1ban. Ha ez CREATE vagy ALTER TABLE utas\u00EDt\u00E1s, akkor a(z) ''{0}'' nem a c\u00E9lt\u00E1bla oszlopa.
42X31=A(z) ''{0}'' nincs a(z) ''{1}'' kurzor FOR UPDATE list\u00E1j\u00E1ban.
XXXXX.C.6=Norm\u00E1l adatb\u00E1zis-munkamenet lez\u00E1r\u00E1s.
42Z02=T\u00F6bb DISTINCT \u00F6sszes\u00EDt\u00E9se ekkor nem t\u00E1mogatott.
43X03.U=Megnyit\u00E1sok sz\u00E1ma
43Y02.U=Skal\u00E1r \u00F6sszes\u00EDt\u00E9s
42Z11.U=folyam
42X13=A(z) ''{0}'' oszlopn\u00E9v t\u00F6bbsz\u00F6r jelenik meg az INSERT utas\u00EDt\u00E1s oszloplist\u00E1j\u00E1ban. 
43X21.U=Sorok bevitele
XCY00.S=\u00C9rv\u00E9nytelen \u00E9rt\u00E9k a tulajdons\u00E1ghoz\: ''{0}''\=''{1}''.
43Y20.U=VTI
42X40=A NOT utas\u00EDt\u00E1s nem logikai operandussal rendelkezik. A NOT operandus\u00E1nak \u00E9rt\u00E9ke ki\u00E9rt\u00E9kel\u00E9s ut\u00E1n TRUE, FALSE vagy UNKNOWN lehet. 
