#Thu May 16 17:55:33 BRT 2013
43Y30.U=Carimbo do tempo do in\u00EDcio da compila\u00E7\u00E3o
42X23=O cursor {0} n\u00E3o \u00E9 atualiz\u00E1vel.
43X04.U=Linhas exibidas
42X50=N\u00E3o foi encontrado nenhum m\u00E9todo correspondendo \u00E0 chamada de m\u00E9todo {0}.{1}({2}), mesmo ap\u00F3s tentar todas as combina\u00E7\u00F5es de tipos primitivos e de objetos e todas as convers\u00F5es de tipos poss\u00EDveis para qualquer par\u00E2metro que a chamada de m\u00E9todo pudesse ter. O m\u00E9todo pode existir, por\u00E9m n\u00E3o \u00E9 p\u00FAblico e/ou est\u00E1tico ou os tipos de par\u00E2metros n\u00E3o s\u00E3o chamadas de m\u00E9todos que podem ser convertidas.
43Y03.U=Rolamento de ResultSet n\u00E3o sens\u00EDvel
42Z21=Incremento inv\u00E1lido especificado para a identidade para a coluna ''{0}''. O incremento n\u00E3o pode ser zero.
42Y13=O nome de coluna ''{0}'' aparece mais de uma vez na instru\u00E7\u00E3o CREATE VIEW.
43X22.U=Agrega\u00E7\u00E3o escalar distinta
X0X0E.S=A posi\u00E7\u00E3o da coluna ''{0}'' listada na matriz de sele\u00E7\u00E3o de coluna autogerada n\u00E3o foi encontrada na tabela de inser\u00E7\u00E3o.
42X05=A tabela/vis\u00E3o ''{0}'' n\u00E3o existe.
42Y40=''{0}'' aparece diversas vezes na lista de colunas de UPDATE OF para o gatilho ''{1}''.
43Y21.U=Subconsultas materializadas
XCZ00.S=Permiss\u00E3o desconhecida ''{0}''.
42X32=O n\u00FAmero de colunas na lista de colunas derivadas deve corresponder ao n\u00FAmero de colunas na tabela ''{0}''.
42Z30.U=tempo gasto neste ResultSet \=
43X40.U=Informa\u00E7\u00F5es de classifica\u00E7\u00E3o
XSRS7.S=O backup capturou uma exce\u00E7\u00E3o inesperada.
42Y22=A agrega\u00E7\u00E3o {0} n\u00E3o pode operar no tipo {1}.
43X13.U=Excluir ResultSet utilizando
42X14=''{0}'' n\u00E3o \u00E9 uma coluna na tabela ou VTI ''{1}''.
43Y12.U=Tamanho da busca
XSLAO.D=Falha na recupera\u00E7\u00E3o devido a problema n\u00E3o esperado {0}.
42X41=Na cl\u00E1usula Propriedades da lista FROM, a propriedade ''{0}'' n\u00E3o \u00E9 v\u00E1lida (a propriedade estava sendo definida como ''{1}'').
XBCXR.S=N\u00E3o \u00E9 poss\u00EDvel criptografar novamente um banco de dados de leitura com uma nova senha de inicializa\u00E7\u00E3o ou uma chave de criptografia externa.
43X31.U=Tamanho da tabela de ''hash''
42Y04=N\u00E3o \u00E9 poss\u00EDvel criar um procedimento ou fun\u00E7\u00E3o com EXTERNAL NAME ''{0}'', porque n\u00E3o \u00E9 uma lista separada por pontos. O formato esperado \u00E9 <caminho java completo>.<nome do m\u00E9todo>.
