#Thu May 16 17:55:33 BRT 2013
43Y30.U=Indicaci\u00F3n de la hora de inicio de compilaci\u00F3n
42X23=El cursor {0} no es actualizable.
43X04.U=Filas vistas
42X50=No se ha encontrado ning\u00FAn m\u00E9todo que coincidiese con la llamada de m\u00E9todo {0}.{1}({2}), despu\u00E9s de probar todas las combinaciones de los tipos de objeto y primitivo y todas las conversiones de tipos posibles de todos los par\u00E1metros que pudiera tener la llamada de m\u00E9todo. El m\u00E9todo puede existir, pero no es p\u00FAblico y/o est\u00E1tico, o los tipos de par\u00E1metro no son convertibles por la invocaci\u00F3n del m\u00E9todo.
43Y03.U=ResultSet insensible a desplazamiento
10000=Se ha encontrado un error al evaluar una expresi\u00F3n de consulta XML para el operador {0}\: {1}
42Z21=Se ha especificado un incremento no v\u00E1lido para la identidad de la columna ''{0}''. El incremento no puede ser cero.  
XRE42=Se apaga la base de datos repetida ''{0}''.
42Z12.U=Error interno\: intento no v\u00E1lido de acceder a un {0} como una corriente
42Y13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE VIEW.
43X22.U=Agregado escalar distinct
X0X0E.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente en la posici\u00F3n de columna ''{0}''.
42X05=La tabla/vista ''{0}'' no existe.
42Y40=''{0}'' aparece varias veces en la lista de columnas UPDATE OF para el desencadenante ''{1}''.
43Y21.U=Subconsultas materializadas
XCZ00.S=Permiso ''{0}'' desconocido.
42X32=El n\u00FAmero de columnas en la lista de columnas derivadas debe coincidir con el n\u00FAmero de columnas de la tabla ''{0}''.
42Z30.U=tiempo transcurrido en este ResultSet \=
43X40.U=Informaci\u00F3n de ordenaci\u00F3n
XSRS7.S=Se ha producido una excepci\u00F3n inesperada durante la copia de seguridad.
42Y22=La agregaci\u00F3n {0} no puede operar sobre el tipo {1}.
43X13.U=Suprimir ResultSet mediante
42X14=''{0}'' no es una columna en la tabla o VTI ''{1}''.
43Y12.U=Tama\u00F1o de extracci\u00F3n
XRE06=Los intentos de conexi\u00F3n con la repetici\u00F3n secundaria de la base de datos {0} han excedido el tiempo de espera configurado.
XSLAO.D=Error de recuperaci\u00F3n, problema inesperado {0}.
42X41=En la cl\u00E1usula Properties de una lista FROM , la propiedad ''{0}'' no es v\u00E1lida (la propiedad se hab\u00EDa establecido como ''{1}''). 
XBCXR.S=No se puede volver a cifrar una base de datos de s\u00F3lo lectura con una nueva contrase\u00F1a de arranque o una clave de de cifrado externa.
43X31.U=Tama\u00F1o de tabla hash
42Y04=No se puede crear un procedimiento o funci\u00F3n con EXTERNAL NAME ''{0}'' porque no es una lista separada por puntos. El formato esperado es <v\u00EDa de acceso java completa>.<nombre de m\u00E9todo>.
