#Thu May 16 17:55:33 BRT 2013
43Y30.U=Za\u010D\u00EDt \u010Dasov\u00E9 raz\u00EDtko kompilace
42X23=Kurzor {0} nelze aktualizovat.
43X04.U=Po\u010Det prohl\u00E9dnut\u00FDch \u0159\u00E1dk\u016F
42X50=Nebyla nalezena \u017E\u00E1dn\u00E1 metoda, kter\u00E1 by odpov\u00EDdala vol\u00E1n\u00ED metody {0}.{1}({2}). Byly vyzkou\u0161eny v\u0161echny kombinace typ\u016F objekt\u016F a primitivn\u00EDch typ\u016F a v\u0161echny mo\u017En\u00E9 konverze typ\u016F pro ve\u0161ker\u00E9 parametry, kter\u00E9 vol\u00E1n\u00ED metody m\u016F\u017Ee m\u00EDt. Metoda m\u016F\u017Ee existovat, ale nen\u00ED ve\u0159ejn\u00E1 a/nebo statick\u00E1, nebo typy parametr\u016F nejsou p\u0159izp\u016Fsobiteln\u00E9 vol\u00E1n\u00ED metody.
43Y03.U=Rozhran\u00ED ResultSet necitliv\u00E9 na posun
10000=Byla zji\u0161t\u011Bna chyba p\u0159i vyhodnocov\u00E1n\u00ED v\u00FDrazu dotazu XML pro oper\u00E1tor {0}\: {1}
42Z21=Byl uveden neplatn\u00FD p\u0159\u00EDr\u016Fstek pro toto\u017Enost pro sloupec ''{0}''. P\u0159\u00EDr\u016Fstek nem\u016F\u017Ee b\u00FDt nulov\u00FD. 
42Y13=Jm\u00E9no sloupce ''{0}'' se objevuje v\u00EDce ne\u017E jednou v p\u0159\u00EDkazu CREATE VIEW.
43X22.U=Odli\u0161n\u00FD skal\u00E1rn\u00ED seskupen\u00FD v\u00FDraz
X0X0E.S=Pozice sloupce ''{0}'' vypsan\u00E9ho v automaticky generovan\u00E9m poli pro v\u00FDb\u011Br sloupce nebyla nalezena v tabulce vlo\u017Een\u00ED. 
42X05=Tabulka/pohled ''{0}'' neexistuje.
42Y40=''{0}'' se v seznamu sloupc\u016F UPDATE OF pro trigger ''{1}'' objevuje v\u00EDcekr\u00E1t.
43Y21.U=Uskute\u010Dn\u011Bn\u00E9 poddotazy
XCZ00.S=Nezn\u00E1m\u00E9 povolen\u00ED ''{0}''.
42X32=Po\u010Det sloupc\u016F v odvozen\u00E9m seznamu sloupc\u016F mus\u00ED odpov\u00EDdat po\u010Dtu sloupc\u016F v tabulce ''{0}''.
42Z30.U=\u010Das str\u00E1ven\u00FD v t\u00E9to mno\u017Ein\u011B v\u00FDsledk\u016F \=
43X40.U=Set\u0159\u00EDdit informace
XSRS7.S=Z\u00E1lohov\u00E1n\u00ED zachytilo neo\u010Dek\u00E1vanou v\u00FDjimku.
42Y22=Seskupen\u00FD v\u00FDraz {0} nem\u016F\u017Ee operovat s typem {1}.
43X13.U=Vymazat rozhran\u00ED ResultSet pomoc\u00ED
42X14=''{0}'' nen\u00ED sloupcem v tabulce nebo VTI ''{1}''.
43Y12.U=Na\u010D\u00EDst velikost
XSLAO.D=N\u00E1prava selhala kv\u016Fli neo\u010Dek\u00E1van\u00E9mu probl\u00E9mu {0}.
42X41=V klauzuli Vlastnosti seznamu FROM nen\u00ED platn\u00E1 vlastnost ''{0}'' (vlastnost byla nastavov\u00E1na na ''{1}''). 
XBCXR.S=Nelze znovu za\u0161ifrovat datab\u00E1zi, kter\u00E1 slou\u017E\u00ED pouze pro \u010Dten\u00ED, nov\u00FDm zav\u00E1d\u011Bc\u00EDm heslem nebo vn\u011Bj\u0161\u00EDm \u0161ifrovac\u00EDm kl\u00ED\u010Dem.
43X31.U=Velikost transforma\u010Dn\u00ED tabulky
42Y04=Nelze vytvo\u0159it proceduru nebo funkci s EXTERN\u00CDM JM\u00C9NEM ''{0}'', proto\u017Ee se nejedn\u00E1 o seznam odd\u011Blovan\u00FD te\u010Dkami. O\u010Dek\u00E1van\u00FD form\u00E1t je <\u00FApln\u00E1 cesta k Jav\u011B>.<jm\u00E9no metody>.
