#Thu May 16 17:55:33 BRT 2013
43Y30.U=Datownik rozpocz\u0119cia kompilacji
42X23=Kursor {0} nie mo\u017Ce by\u0107 aktualizowany.
43X04.U=Widoczne wiersze
42X50=Nie znaleziono metody, kt\u00F3ra jest zgodna z wywo\u0142aniem metody {0}.{1}({2}). Pr\u00F3bowano wszystkich kombinacji obiektu i typ\u00F3w podstawowych oraz wszystkich mo\u017Cliwych konwersji typ\u00F3w dla wszystkich parametr\u00F3w, kt\u00F3re mog\u0105 wyst\u0105pi\u0107 w wywo\u0142aniu metody. Metoda mo\u017Ce istnieje, ale nie jest publiczna i/lub statyczna lub typy parametr\u00F3w nie s\u0105 mo\u017Cliwe do konwersji w wywo\u0142aniu metody.
43Y03.U=Interfejs ResultSet dla niewra\u017Cliwego przewijania
10000=Wyst\u0105pi\u0142 b\u0142\u0105d podczas oceny wyra\u017Cenia zapytania XML dla operatora {0}\: {1}
42Z21=Okre\u015Blono niepoprawny przyrost dla to\u017Csamo\u015Bci kolumny ''{0}''. Przyrost nie mo\u017Ce by\u0107 r\u00F3wny zero. 
42Y13=Nazwa kolumny ''{0}'' pojawia si\u0119 w instrukcji CREATE VIEW wi\u0119cej ni\u017C jeden raz.
43X22.U=Odr\u0119bny agregat skalarny
X0X0E.S=W tabeli wstawiania nie znaleziono pozycji kolumny ''{0}'' wymienionej w automatycznie generowanej tablicy wyboru kolumn. 
42X05=Tabela/widok ''{0}'' nie istnieje.
42Y40=''{0}'' pojawia si\u0119 wiele razy na li\u015Bcie kolumny UPDATE OF dla wyzwalacza ''{1}''.
43Y21.U=Podzapytania zmaterializowane
XCZ00.S=Nieznane uprawnienie ''{0}''.
42X32=Liczba kolumn na li\u015Bcie kolumn pochodnych musi zgadza\u0107 si\u0119 z liczb\u0105 kolumn tabeli ''{0}''.
42Z30.U=up\u0142yw czasu w tym obiekcie ResultSet \=
43X40.U=Informacje o sortowaniu
XSRS7.S=Proces sk\u0142adowania przechwyci\u0142 nieoczekiwany wyj\u0105tek.
42Y22=Agregacja typu {0} nie mo\u017Ce dzia\u0142a\u0107 na typie {1}.
43X13.U=Usu\u0144 interfejs ResultSet za pomoc\u0105
42X14=''{0}'' nie jest kolumn\u0105 tabeli lub VTI ''{1}''.
43Y12.U=Rozmiar pobierania
XSLAO.D=Odtwarzanie nie powiod\u0142o si\u0119 z powodu nieoczekiwanego problemu\: {0}.
42X41=W klauzuli w\u0142a\u015Bciwo\u015Bci listy FROM w\u0142a\u015Bciwo\u015B\u0107 ''{0}'' nie jest poprawna (w\u0142a\u015Bciwo\u015B\u0107 zosta\u0142a ustawiona na ''{1}''). 
XBCXR.S=Nie mo\u017Cna ponownie zaszyfrowa\u0107 bazy danych tylko do odczytu za pomoc\u0105 nowego has\u0142a startowego lub zewn\u0119trznego klucza szyfrowania.
43X31.U=Rozmiar tabeli mieszaj\u0105cej
42Y04=Nie mo\u017Cna utworzy\u0107 procedury lub funkcji z list\u0105 EXTERNAL NAME ''{0}'', poniewa\u017C nie jest to lista oddzielana kropkami. Oczekiwany format to <pe\u0142na \u015Bcie\u017Cka klasy java>.<nazwa metody>.
