#Thu May 16 17:55:33 BRT 2013
43Y30.U=\u0412\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043C\u0435\u0442\u043A\u0430 \u043D\u0430\u0447\u0430\u043B\u0430 \u043A\u043E\u043C\u043F\u0438\u043B\u044F\u0446\u0438\u0438
42X23=\u041A\u0443\u0440\u0441\u043E\u0440 {0} \u043D\u0435 \u043F\u043E\u0434\u043B\u0435\u0436\u0438\u0442 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E.
43X04.U=\u0427\u0438\u0441\u043B\u043E \u0432\u0438\u0434\u0438\u043C\u044B\u0445 \u0441\u0442\u0440\u043E\u043A
42X50=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438\u043A\u0430\u043A\u043E\u0433\u043E \u043C\u0435\u0442\u043E\u0434\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u044B \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u043B \u0432\u044B\u0437\u043E\u0432\u0443 \u043C\u0435\u0442\u043E\u0434\u0430 {0}.{1}({2}); \u0438\u0441\u043F\u0440\u043E\u0431\u043E\u0432\u0430\u043D\u044B \u0432\u0441\u0435 \u043A\u043E\u043C\u0431\u0438\u043D\u0430\u0446\u0438\u0438 \u0442\u0438\u043F\u043E\u0432 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0438 \u043F\u0440\u0438\u043C\u0438\u0442\u0438\u0432\u043D\u044B\u0445 \u0442\u0438\u043F\u043E\u0432 \u0438 \u0432\u0441\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u044B\u0435 \u0442\u0438\u043F\u044B \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u0442\u0438\u043F\u043E\u0432 \u0434\u043B\u044F \u0432\u0441\u0435\u0445 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0443 \u0432\u044B\u0437\u043E\u0432\u0430 \u043C\u0435\u0442\u043E\u0434\u0430. \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u044D\u0442\u043E\u0442 \u043C\u0435\u0442\u043E\u0434 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u043D\u043E \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C \u0438/\u0438\u043B\u0438 \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u043C, \u043B\u0438\u0431\u043E \u0442\u0438\u043F\u044B \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432 \u043D\u0435 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u044E\u0442 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435 \u0432 \u0432\u044B\u0437\u043E\u0432 \u043C\u0435\u0442\u043E\u0434\u0430.
43Y03.U=ResultSet - \u041D\u0435\u0447\u0443\u0432\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0439 \u043A \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u0435
10000=\u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u043E\u0446\u0435\u043D\u043A\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F XML-\u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0434\u043B\u044F \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 {0}\: {1}
42Z21=\u0417\u0430\u0434\u0430\u043D\u043E \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u043F\u0440\u0438\u0440\u0430\u0449\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}''. \u041F\u0440\u0438\u0440\u0430\u0449\u0435\u043D\u0438\u0435 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0440\u0430\u0432\u043D\u044F\u0442\u044C\u0441\u044F \u043D\u0443\u043B\u044E.  
42Y13=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 CREATE VIEW \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430.
43X22.U=\u041E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0439 \u0441\u043A\u0430\u043B\u044F\u0440\u043D\u044B\u0439 \u0430\u0433\u0440\u0435\u0433\u0430\u0442
X0X0E.S=\u041F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'', \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0435 \u0432 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u043C \u043C\u0430\u0441\u0441\u0438\u0432\u0435 \u0434\u043B\u044F \u0432\u044B\u0431\u043E\u0440\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432, \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 insert. 
42X05=\u0422\u0430\u0431\u043B\u0438\u0446\u0430/\u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440 ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
42Y40=''{0}'' \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 UPDATE OF \u0434\u043B\u044F \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430 ''{1}''.
43Y21.U=\u041C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u043F\u043E\u0434\u0437\u0430\u043F\u0440\u043E\u0441\u044B
XCZ00.S=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0435 ''{0}''.
42X32=\u0427\u0438\u0441\u043B\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0432 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u043D\u043E\u043C \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C \u0441 \u0447\u0438\u0441\u043B\u043E\u043C \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 ''{0}''.
42Z30.U=\u0432\u0440\u0435\u043C\u044F, \u0437\u0430\u0442\u0440\u0430\u0447\u0435\u043D\u043D\u043E\u0435 \u0432 \u0434\u0430\u043D\u043D\u043E\u043C ResultSet \=
43X40.U=\u0418\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u043E \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0435
XSRS7.S=\u041F\u0440\u0438 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u043C \u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0438 \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u043E \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E\u0435 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435.
42Y22=\u0410\u0433\u0440\u0435\u0433\u0430\u0442 {0} \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 \u0442\u0438\u043F\u043E\u043C {1}.
43X13.U=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C
42X14=''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u043C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0438\u043B\u0438 VTI ''{1}''.
43Y12.U=\u0420\u0430\u0437\u043C\u0435\u0440 \u0432\u044B\u0431\u043E\u0440\u043A\u0438
XSLAO.D=\u0412\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0435 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u043E\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E \u0438\u0437-\u0437\u0430 \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E\u0439 \u043E\u0448\u0438\u0431\u043A\u0438 {0}.
42X41=\u0412 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 Properties \u0434\u043B\u044F \u0441\u043F\u0438\u0441\u043A\u0430 FROM \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C (\u0434\u043B\u044F \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u0437\u0430\u0434\u0430\u043D\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{1}''). 
XBCXR.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u043D\u043E\u0432\u043E \u0437\u0430\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u0443\u044E \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F, \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u043E\u0432\u043E\u0433\u043E \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0438\u043B\u0438 \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F.
43X31.U=\u0420\u0430\u0437\u043C\u0435\u0440 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42Y04=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u0443 \u0438\u043B\u0438 \u0444\u0443\u043D\u043A\u0446\u0438\u044E \u0441\u043E \u0432\u043D\u0435\u0448\u043D\u0438\u043C \u0438\u043C\u0435\u043D\u0435\u043C (EXTERNAL NAME) ''{0}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E \u0438\u043C\u044F \u043D\u0435  \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u0441\u043F\u0438\u0441\u043E\u043A, \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0439 \u0442\u043E\u0447\u043A\u0430\u043C\u0438. \u041E\u0436\u0438\u0434\u0430\u0435\u043C\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442\: <\u043F\u043E\u043B\u043D\u044B\u0439 \u043F\u0443\u0442\u044C java>.<\u0438\u043C\u044F \u043C\u0435\u0442\u043E\u0434\u0430>.
