#Thu May 16 17:55:33 BRT 2013
XCZ01.S=\uC54C \uC218 \uC5C6\uB294 \uC0AC\uC6A9\uC790 ''{0}''.
42Y32={2} \uC720\uD615\uC758 ''{1}'' \uC9D1\uD569\uC5D0 \uB300\uD55C ''{0}'' \uC9D1\uD569 \uD074\uB798\uC2A4\uAC00 org.apache.derby.iapi.sql.execute.ExecAggregator\uB97C \uAD6C\uD604\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. 
42Z31.U=\uC774 ResultSet\uC5D0\uC11C \uC0AC\uC6A9\uD55C \uC2DC\uAC04 \uC774\uD558 \=
43X41.U=\uADF8\uB8F9\uD654\uB41C \uC9D1\uD569 ResultSet
42X24=\uC5F4 ''{0}''\uC774(\uAC00) HAVING \uC808\uC5D0\uC11C \uCC38\uC870\uB418\uC9C0\uB9CC GROUP BY \uBAA9\uB85D\uC5D0 \uC5C6\uC2B5\uB2C8\uB2E4.
XSRS8.S=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uC791\uC131 \uC2DC\uC5D0\uB9CC \uB85C\uADF8 \uC7A5\uCE58\uB97C \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uAE09\uD558\uAC8C \uBCC0\uACBD\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42X51=''{0}'' \uD074\uB798\uC2A4\uAC00 \uC5C6\uAC70\uB098 \uC561\uC138\uC2A4\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uD074\uB798\uC2A4\uAC00 \uACF5\uC6A9\uC774 \uC544\uB2CC \uACBD\uC6B0\uC5D0 \uC774\uB7EC\uD55C \uC0C1\uD0DC\uAC00 \uBC1C\uC0DD\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
42Z22=ID \uC5F4 ''{0}''\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uC720\uD615\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4. ID \uC5F4\uC5D0 \uC720\uD6A8\uD55C \uC720\uD615\uC740 BIGINT, INT \uBC0F SMALLINT\uBFD0\uC785\uB2C8\uB2E4.
XRE43=\uBCF5\uC81C \uC2AC\uB808\uC774\uBE0C \uBAA8\uB4DC\uB97C \uC911\uC9C0\uD558\uB294 \uC911\uC5D0 \uC608\uAE30\uCE58 \uBABB\uD55C \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBCF5\uC81C \uC2AC\uB808\uC774\uBE0C \uBAA8\uB4DC\uB97C \uC911\uC9C0\uD558\uB824\uBA74 ''stopSlave'' \uB610\uB294 ''failover'' \uC791\uC5C5\uC744 \uC0AC\uC6A9\uD558\uC2ED\uC2DC\uC624.
43X14.U=\uD14C\uC774\uBE14 \uC7A0\uAE08
43Y13.U=\uADDC\uC815\uC790
42X06=''{0}'' \uD14C\uC774\uBE14\uC5D0 \uB300\uD574 \uB108\uBB34 \uB9CE\uC740 \uACB0\uACFC \uC5F4\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
42Y41=''{0}''\uC774(\uAC00) \uD2B8\uB9AC\uAC70\uC758 \uC77C\uBD80\uC774\uBBC0\uB85C EXECUTE STATEMENT\uB97C \uD1B5\uD574 \uC9C1\uC811 \uD638\uCD9C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSLAP.D={0}\uC758 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 {1} \uBC84\uC804\uC785\uB2C8\uB2E4. \uBCA0\uD0C0 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uC5C5\uADF8\uB808\uC774\uB4DC\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XBCXS.S=\uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uB85C\uADF8 \uC544\uCE74\uC774\uBE0C \uBAA8\uB4DC\uC5D0 \uC788\uB294 \uACBD\uC6B0 \uC554\uD638\uD654\uD560 \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uAD6C\uC131\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42X33=\uD30C\uC0DD\uB41C \uC5F4 \uBAA9\uB85D\uC5D0 \uC911\uBCF5\uB41C ''{0}'' \uC5F4 \uC774\uB984\uC774 \uB4E4\uC5B4 \uC788\uC2B5\uB2C8\uB2E4.
43X32.U=\uD544\uD130\uB41C \uD589
42X60=''{1}'' \uD14C\uC774\uBE14\uC5D0 \uB300\uD574 insertMode\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uAC12 ''{0}''\uC774(\uAC00) \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
43Y31.U=\uCEF4\uD30C\uC77C \uC885\uB8CC \uC2DC\uAC04 \uC18C\uC778
42Z40.U=\uCC98\uC74C {1}\uC5F4\uC758 {0}.
42Y23={0}\uC5F4\uC5D0 \uB300\uD574 \uC798\uBABB\uB41C JDBC \uC720\uD615 \uC815\uBCF4\uAC00 \uB9AC\uD134\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
43X50.U=\uD574\uC2DC \uC67C\uCABD \uC678\uBD80 \uACB0\uD569 ResultSet
43X05.U=\uC18C\uC2A4 \uACB0\uACFC \uC138\uD2B8
01001=\uC774\uBBF8 \uC0AD\uC81C\uB41C \uD589\uC744 \uAC31\uC2E0 \uB610\uB294 \uC0AD\uC81C\uD558\uB824\uACE0 \uD588\uC2B5\uB2C8\uB2E4. \uC5B4\uB5A0\uD55C \uD589\uB3C4 \uAC31\uC2E0 \uB610\uB294 \uC0AD\uC81C\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.
42X15=''{0}'' \uC5F4 \uC774\uB984\uC774 FROM \uBAA9\uB85D \uC5C6\uC774 \uBA85\uB839\uBB38\uC5D0 \uB098\uD0C0\uB0A9\uB2C8\uB2E4.
42Y50=''{0}'' \uD14C\uC774\uBE14\uC5D0 \uB300\uD55C \uB4F1\uB85D \uC815\uBCF4 \uBAA9\uB85D\uC5D0 \uC0C9\uC778 \uB610\uB294 \uC81C\uD55C\uC870\uAC74(\uADF8\uB7EC\uB098 \uB458 \uBAA8\uB450\uB294 \uC544\uB2D8)\uC758 \uAC12\uC774 \uD3EC\uD568\uB420 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
43Y04.U=\uD574\uC2DC \uD14C\uC774\uBE14\uC5D0\uC11C \uC77D\uC740 \uD69F\uC218
XRE07=\uB370\uC774\uD130\uBCA0\uC774\uC2A4\uAC00 \uBCF5\uC81C \uB9C8\uC2A4\uD130 \uBAA8\uB4DC\uC5D0 \uC788\uC9C0 \uC54A\uC73C\uBBC0\uB85C \uC791\uC5C5\uC744 \uC218\uD589\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42X42=\uC0C1\uAD00 \uC774\uB984\uC774 FOR UPDATE \uBAA9\uB85D\uC758 \uC77C\uBD80\uC774\uBBC0\uB85C ''{0}''\uC5F4\uC5D0 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
02000=FETCH, UPDATE \uB610\uB294 DELETE\uC5D0 \uB300\uD55C \uD589\uC744 \uBC1C\uACAC\uD558\uC9C0 \uBABB\uD588\uC2B5\uB2C8\uB2E4. \uC870\uD68C \uACB0\uACFC\uAC00 \uBE48 \uD14C\uC774\uBE14\uC785\uB2C8\uB2E4.
43X23.U={1} {2}\uC744(\uB97C) \uC0AC\uC6A9\uD55C {0}\uC5D0 \uB300\uD55C \uAD6C\uBCC4 \uC2A4\uCE94 ResultSet
XCY02.S=\uC694\uCCAD\uB41C \uB4F1\uB85D \uC815\uBCF4 \uBCC0\uACBD\uC740 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. ''{0}''\=''{1}''.
X0X0F.S=\uD14C\uC774\uBE14 ''{1}''\uC5D0 ''{0}''(\uC774)\uB77C\uB294 \uC790\uB3D9 \uC0DD\uC131 \uC5F4\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
42Y05=''{0}'' \uC678\uBD80 \uD0A4\uAC00 \uC5C6\uC2B5\uB2C8\uB2E4.
43Y22.U=\uBA85\uB839\uBB38 \uC774\uB984
