#Thu May 16 17:55:33 BRT 2013
XCZ01.S=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0439 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C ''{0}''.
42Y32=\u041A\u043B\u0430\u0441\u0441 \u0430\u0433\u0440\u0435\u0433\u0430\u0442\u043E\u0440\u0430 ''{0}'' \u0434\u043B\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0442\u0430 ''{1}'' \u0434\u043B\u044F \u0442\u0438\u043F\u0430 {2} \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 com.ibm.db2j.aggregates.Aggregator. 
42Z31.U=\u0432\u0440\u0435\u043C\u044F, \u0437\u0430\u0442\u0440\u0430\u0447\u0435\u043D\u043D\u043E\u0435 \u0432 \u0434\u0430\u043D\u043D\u043E\u043C ResultSet \u0438 \u043D\u0438\u0436\u0435 \=
43X41.U=ResultSet - \u0421\u0433\u0440\u0443\u043F\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0430\u0433\u0440\u0435\u0433\u0430\u0442
XSRS8.S=\u0423\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445; \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0435\u0433\u043E \u0432 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0440\u0430\u0431\u043E\u0442\u044B \u043D\u0435\u043B\u044C\u0437\u044F.
42X51=\u041A\u043B\u0430\u0441\u0441 ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0438\u043B\u0438 \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u0435\u043D. \u042D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442\u044C, \u0435\u0441\u043B\u0438 \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C.
42Z22=\u0417\u0430\u0434\u0430\u043D \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0442\u0438\u043F \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 ''{0}''. \u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C\u0438 \u0442\u0438\u043F\u0430\u043C\u0438 \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u0432 \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F BIGINT, INT \u0438 SMALLINT.
43X14.U=\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0430 \u0442\u0430\u0431\u043B\u0438\u0446
43Y13.U=\u043A\u0432\u0430\u043B\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B
42X06=\u0414\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u0437\u0430\u0434\u0430\u043D\u043E \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043C\u043D\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432.
42Y41=''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u043D\u0435\u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0447\u0435\u0440\u0435\u0437 EXECUTE STATEMENT, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430.
XSLAP.D=\u0411\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 {0} \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0432\u0435\u0440\u0441\u0438\u0438 {1}. \u0411\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0431\u0435\u0442\u0430-\u0432\u0435\u0440\u0441\u0438\u0439 \u043D\u0435 \u043F\u043E\u0434\u043B\u0435\u0436\u0430\u0442 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E,
XBCXS.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043B\u044F \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u043A\u043E\u0433\u0434\u0430 \u0431\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0430\u0440\u0445\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0436\u0443\u0440\u043D\u0430\u043B\u0430.
42X33=\u0412 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u043D\u043E\u043C \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442 \u0438\u043C\u0435\u043D\u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u0430\: ''{0}''.
43X32.U=\u041E\u0442\u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438
42X60=\u0414\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}'' \u0437\u0430\u0434\u0430\u043D\u043E \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{0}'' \u0434\u043B\u044F \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 insertMode.
43Y31.U=\u0412\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043C\u0435\u0442\u043A\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u044F \u043A\u043E\u043C\u043F\u0438\u043B\u044F\u0446\u0438\u0438
42Z40.U={0} \u0434\u043B\u044F \u043F\u0435\u0440\u0432\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u0430/\u043F\u0435\u0440\u0432\u044B\u0445 {1} \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432.
42Y23=\u0414\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 {0} \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u0430 \u043D\u0435\u0432\u0435\u0440\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u043E \u0442\u0438\u043F\u0435 JDBC.
43X50.U=ResultSet - \u041B\u0435\u0432\u043E\u0435 \u0432\u043D\u0435\u0448\u043D\u0435\u0435 \u0445\u044D\u0448-\u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435
43X05.U=\u0418\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432
01001=\u0411\u044B\u043B\u0430 \u0441\u0434\u0435\u043B\u0430\u043D\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0438\u043B\u0438 \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u0443\u0436\u0435 \u0443\u0434\u0430\u043B\u0435\u043D\u043D\u0443\u044E \u0441\u0442\u0440\u043E\u043A\u0443\: \u0441\u0442\u0440\u043E\u043A\u0430 \u043D\u0435 \u0431\u044B\u043B\u0430 \u043D\u0438 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0430, \u043D\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u0430.
42X15=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 \u0431\u0435\u0437 \u0441\u043F\u0438\u0441\u043A\u0430 FROM.
42Y50=\u0421\u043F\u0438\u0441\u043E\u043A \u0441\u0432\u043E\u0439\u0441\u0442\u0432 \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0434\u043B\u044F \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u0438\u043B\u0438 \u0434\u043B\u044F \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F, \u043D\u043E \u043D\u0435 \u0434\u043B\u044F \u043D\u0438\u0445 \u043E\u0431\u043E\u0438\u0445 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E.
43Y04.U=\u0427\u0438\u0441\u043B\u043E \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0439 \u0447\u0442\u0435\u043D\u0438\u044F \u0438\u0437 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42X42=\u0418\u043C\u044F \u043A\u043E\u0440\u0440\u0435\u043B\u044F\u0446\u0438\u0438 \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043E\u043D \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u0441\u043F\u0438\u0441\u043A\u0430 FOR UPDATE.
02000=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u0430 \u0441\u0442\u0440\u043E\u043A\u0430 \u0434\u043B\u044F FETCH, UPDATE \u0438\u043B\u0438 DELETE, \u043B\u0438\u0431\u043E \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u043F\u0443\u0441\u0442\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443.
43X23.U=ResultSet - \u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u043E \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u0434\u043B\u044F {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C {1} {2}
XCY02.S=\u0417\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u043E\u0435 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F\: ''{0}''\=''{1}''.
X0X0F.S=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'', \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0435 \u0432 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u043C \u043C\u0430\u0441\u0441\u0438\u0432\u0435 \u0434\u043B\u044F \u0432\u044B\u0431\u043E\u0440\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432, \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 insert.
42Y05=\u041D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C ''{0}''.
43Y22.U=\u0418\u043C\u044F \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430
