#Thu May 16 17:55:33 BRT 2013
XCZ01.S=\u4E0D\u660E\u306A\u30E6\u30FC\u30B6\u30FC ''{0}''\u3002
42Y32=\u578B {2} \u306B\u5BFE\u3059\u308B\u96C6\u5408\u4F53 ''{1}'' \u306E Aggregator \u30AF\u30E9\u30B9 ''{0}'' \u306F\u3001org.apache.derby.iapi.sql.execute.ExecAggregator \u3092\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002 
42Z31.U=\u3053\u306E ResultSet \u306B\u8CBB\u3084\u3055\u308C\u305F\u6642\u9593\u4EE5\u4E0B \=
43X41.U=\u30B0\u30EB\u30FC\u30D7\u5316\u3055\u308C\u305F\u96C6\u5408\u4F53 ResultSet
42X24=\u5217 {0} \u304C HAVING \u5206\u7BC0\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u304C\u3001GROUP BY \u30EA\u30B9\u30C8\u306B\u3042\u308A\u307E\u305B\u3093\u3002
XSRS8.S=\u30ED\u30AE\u30F3\u30B0\u7528\u88C5\u7F6E\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u4F5C\u6210\u6642\u306B\u3057\u304B\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u3053\u3067\u3059\u3050\u306B\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42X51=\u30AF\u30E9\u30B9 ''{0}'' \u306F\u5B58\u5728\u3057\u306A\u3044\u304B\u3001\u30A2\u30AF\u30BB\u30B9\u4E0D\u80FD\u3067\u3059\u3002 \u3053\u308C\u306F\u3001\u3053\u306E\u30AF\u30E9\u30B9\u304C public \u3067\u306A\u3044\u5834\u5408\u306B\u767A\u751F\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
42Z22=ID \u5217 ''{0}'' \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u578B\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 ID \u5217\u306B\u6709\u52B9\u306A\u578B\u306F\u3001BIGINT\u3001INT \u304A\u3088\u3073 SMALLINT \u306E\u307F\u3067\u3059\u3002
XRE43=\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30E2\u30FC\u30C9\u3092\u505C\u6B62\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308B\u3068\u304D\u306B\u3001\u4E88\u671F\u3057\u306A\u3044\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30E2\u30FC\u30C9\u3092\u505C\u6B62\u3059\u308B\u306B\u306F\u3001\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3 ''stopSlave'' \u307E\u305F\u306F ''failover'' \u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
43X14.U=\u8868\u30ED\u30C3\u30AF
43Y13.U=\u4FEE\u98FE\u5B50
42X06=\u8868 ''{0}'' \u306B\u5BFE\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u7D50\u679C\u5217\u306E\u6570\u304C\u591A\u904E\u304E\u307E\u3059\u3002
42Y41=''{0}'' \u306F\u30C8\u30EA\u30AC\u30FC\u306E\u4E00\u90E8\u306A\u306E\u3067\u3001EXECUTE STATEMENT \u3092\u4F7F\u3063\u3066\u76F4\u63A5\u547C\u3073\u51FA\u3059\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XSLAP.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ({0}) \u306F\u30D0\u30FC\u30B8\u30E7\u30F3 {1} \u3067\u3059\u3002 \u30D9\u30FC\u30BF\u30FB\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
XBCXS.S=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u30ED\u30B0\u30FB\u30A2\u30FC\u30AB\u30A4\u30D6\u30FB\u30E2\u30FC\u30C9\u3067\u3042\u308B\u5834\u5408\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u6697\u53F7\u5316\u7528\u306B\u69CB\u6210\u3067\u304D\u307E\u305B\u3093\u3002
42X33=\u6D3E\u751F\u5217\u30EA\u30B9\u30C8\u306B\u3001\u91CD\u8907\u3059\u308B\u5217\u540D ''{0}'' \u304C\u3042\u308A\u307E\u3059\u3002
43X32.U=\u30D5\u30A3\u30EB\u30BF\u30FC\u3055\u308C\u305F\u884C
42X60=\u8868 ''{1}'' \u306E insertMode \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306B\u7121\u52B9\u5024 ''{0}'' \u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002
43Y31.U=\u30B3\u30F3\u30D1\u30A4\u30EB\u7D42\u4E86\u30BF\u30A4\u30E0\u30FB\u30B9\u30BF\u30F3\u30D7
42Z40.U=\u6700\u521D\u306E {1} \u5217\u3067 {0}\u3002
42Y23=\u5217 {0} \u306B\u5BFE\u3057\u3066\u8AA4\u3063\u305F JDBC \u578B\u60C5\u5831\u304C\u623B\u3055\u308C\u307E\u3057\u305F\u3002
43X50.U=\u30CF\u30C3\u30B7\u30E5\u5DE6\u5916\u90E8\u7D50\u5408 ResultSet
43X05.U=\u30BD\u30FC\u30B9\u7D50\u679C\u30BB\u30C3\u30C8
01001=\u65E2\u306B\u524A\u9664\u6E08\u307F\u306E\u884C\u3092\u66F4\u65B0\u307E\u305F\u306F\u524A\u9664\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u3002\u66F4\u65B0\u307E\u305F\u306F\u524A\u9664\u3055\u308C\u305F\u884C\u306F\u3042\u308A\u307E\u305B\u3093\u3002
42X15=\u5217\u540D ''{0}'' \u306F\u3001FROM \u30EA\u30B9\u30C8\u306A\u3057\u3067\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
42Y50=\u8868 ''{0}'' \u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30EA\u30B9\u30C8\u306B\u306F\u3001\u7D22\u5F15\u306E\u5024\u307E\u305F\u306F\u5236\u7D04\u306E\u5024\u3092\u5165\u308C\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u304C\u3001\u305D\u306E\u4E21\u65B9\u3092\u5165\u308C\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
43Y04.U=\u30CF\u30C3\u30B7\u30E5\u8868\u304B\u3089\u306E\u8AAD\u307F\u53D6\u308A\u6570
XRE07=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304C\u8907\u88FD\u30DE\u30B9\u30BF\u30FC\u30E2\u30FC\u30C9\u306B\u306A\u3044\u305F\u3081\u3001\u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42X42=\u5217 ''{0}'' \u306F FOR UPDATE \u30EA\u30B9\u30C8\u306E\u4E00\u90E8\u3067\u3042\u308B\u305F\u3081\u3001\u305D\u306E\u5217\u306B\u5BFE\u3059\u308B\u76F8\u95A2\u540D\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
02000=FETCH\u3001UPDATE \u307E\u305F\u306F DELETE; \u306E\u884C\u304C\u691C\u51FA\u3055\u308C\u306A\u304B\u3063\u305F\u304B\u3001\u307E\u305F\u306F\u3001\u7167\u4F1A\u7D50\u679C\u304C\u7A7A\u306E\u8868\u3067\u3059\u3002
43X23.U={1} {2} \u3092\u4F7F\u3063\u305F {0} \u306E\u7279\u6B8A\u30B9\u30AD\u30E3\u30F3 ResultSet
XCY02.S=\u8981\u6C42\u3055\u308C\u305F\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5909\u66F4\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002''{0}''\=''{1}''\u3002
X0X0F.S=\u8868 ''{1}'' \u306B ''{0}'' \u3068\u3044\u3046\u540D\u524D\u306E\u81EA\u52D5\u751F\u6210\u5217\u304C\u3042\u308A\u307E\u305B\u3093\u3002
42Y05=''{0}'' \u3068\u3044\u3046\u540D\u524D\u306E\u5916\u90E8\u30AD\u30FC\u306F\u3042\u308A\u307E\u305B\u3093\u3002
43Y22.U=\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u540D
