#Thu May 16 17:55:33 BRT 2013
XCZ01.S=Usuario ''{0}'' desconocido.
42Y32=La clase de agregador ''{0}'' para la agregaci\u00F3n ''{1}'' en el tipo {2} no implementa org.apache.derby.iapi.sql.execute.ExecAggregator. 
42Z31.U=tiempo transcurrido en este ResultSet y posteriormente \=
43X41.U=ResultSet de agregado agrupado
42X24=Se hace referencia a la columna {0} en la cl\u00E1usa HAVING pero no en la lista GROUP BY.
XSRS8.S=El dispositivo de anotaci\u00F3n cronol\u00F3gica s\u00F3lo puede establecerse en el momento de creaci\u00F3n de la base de datos y no puede cambiarse sobre la marcha.
42X51=La clase ''{0}'' no existe o es inaccesible. Esto puede ocurrir si la clase no es p\u00FAblica.
42Z22=Se ha especificado un tipo no v\u00E1lido para la columna de identidad ''{0}''. Los \u00FAnicos tipos v\u00E1lidos para columnas de identidad son BIGINT, INT y SMALLINT.
XRE43=Error inesperado al intentar detener el modo de repetici\u00F3n secundaria. Para detener el modo de repetici\u00F3n secundaria, utilice la operaci\u00F3n ''stopSlave'' o ''failover''.
43X14.U=bloqueo de tabla
43Y13.U=calificadores
42X06=Se han especificado demasiadas columnas de resultados para la tabla ''{0}''.
42Y41=''{0}'' no puede invocarse directamente mediante EXECUTE STATEMENT porque es parte de un desencadenante.
XSLAP.D=La base de datos {0} est\u00E1 en la versi\u00F3n {1}. No es posible actualizar bases de datos Beta,
XBCXS.S=No se puede configurar una base de datos para cifrado cuando la base de datos est\u00E1 en modalidad de registro de archivado.
42X33=La lista de columnas derivadas contiene un nombre de columna duplicado ''{0}''.
43X32.U=Filas filtradas
42X60=Se ha especificado un valor no v\u00E1lido ''{0}'' para la propiedad insertMode de la tabla ''{1}''.
43Y31.U=Indicaci\u00F3n de la hora de fin de compilaci\u00F3n
42Z40.U={0} en primera(s) {1} columna(s).
42Y23=Se ha devuelto una informaci\u00F3n de tipo JDBC incorrecta para la columna {0}.
43X50.U=ResultSet de uni\u00F3n externa izquierda hash
43X05.U=Juego de resultados origen
01001=Se ha intentado actualizar o suprimir una fila ya suprimida\: no se ha actualizado o suprimido ninguna fila.
42X15=El nombre de columna ''{0}'' aparece en una sentencia sin una lista FROM.
42Y50=La lista Properties de la tabla ''{0}'' puede contener valores de \u00EDndice o de restricci\u00F3n pero no ambos.
43Y04.U=N\u00FAmero de lecturas de la tabla hash
XRE07=La operaci\u00F3n no ha podido efectuarse porque la base de datos no est\u00E1 en modo de repetici\u00F3n principal.
42X42=Nombre de correlaci\u00F3n no permitido para columna ''{0}'' porque es parte de la lista FOR UPDATE.
02000=No se ha encontrado ninguna fila para FETCH, UPDATE o DELETE; o el resultado de una consulta es una tabla vac\u00EDa.
43X23.U=ResultSet de exploraci\u00F3n distinct para {0} mediante {1} {2}
XCY02.S=El cambio de propiedad solicitado no est\u00E1 soportado ''{0}''\=''{1}''.
X0X0F.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente que se llame ''{0}''.
42Y05=No existe una clave for\u00E1nea llamada ''{0}''.
43Y22.U=Nombre de sentencia
