#Thu May 16 17:55:33 BRT 2013
XCZ01.S=Unbekannter Benutzer ''{0}''.
42Y32=Die Aggregatorklasse ''{0}'' f\u00FCr das Aggregat ''{1}'' des Typs {2} implementiert nicht org.apache.derby.iapi.sql.execute.ExecAggregator. 
42Z31.U=Zeit f\u00FCr dieses ResultSet und folgende \=
43X41.U=ResultSet f\u00FCr gruppiertes Aggregat
42X24=Die Spalte {0} wird in der HAVING-Klausel referenziert, befindet sich aber nicht in der GROUP BY-Liste.
XSRS8.S=Die Protokolleinheit kann nur beim Erstellen der Datenbank definiert und w\u00E4hrend der Verarbeitung nicht ge\u00E4ndert werden.
42X51=Die Klasse ''{0}'' ist nicht vorhanden oder es kann nicht auf die Klasse zugegriffen werden. Diese Situation kann eintreten, wenn die Klasse nicht \u00F6ffentlich ist.
42Z22=F\u00FCr die Identit\u00E4tsspalte ''{0}'' wurde ein ung\u00FCltiger Typ angegeben. F\u00FCr Identit\u00E4tsspalten sind nur die Typen BIGINT, INT und SMALLINT g\u00FCltig.
XRE43=Unerwarteter Fehler bei dem Versuch, den Replication Slave-Modus anzuhalten. Zum Anhalten der Replikation verwenden Sie die Vorg\u00E4nge ''failover'' oder ''stopSlave''.
43X14.U=Tabelle wird gesperrt
43Y13.U=Qualifikationsmerkmale
42X06=F\u00FCr die Tabelle ''{0}'' wurden zu viele Ergebnisspalten angegeben.
42Y41=''{0}'' kann nicht direkt mit EXECUTE STATEMENT aufgerufen werden, da dieses Objekt Teil eines Ausl\u00F6sers ist.
XSLAP.D=Die Datenbank in {0} hat die Version {1}. F\u00FCr Betadatenbanken ist kein Upgrade m\u00F6glich.
XBCXS.S=Eine Datenbank im Protokollarchivmodus kann nicht f\u00FCr Verschl\u00FCsselung konfiguriert werden.
42X33=Die abgeleitete Spaltenliste enth\u00E4lt zweimal den Spaltennamen ''{0}''.
43X32.U=Gefilterte Zeilen
42X60=F\u00FCr die Tabelle ''{1}'' wurde f\u00FCr das Merkmal insertMode der ung\u00FCltige Wert ''{0}'' angegeben.
43Y31.U=Endzeitmarke der Kompilierung
42Z40.U={0} f\u00FCr die ersten {1} Spalten.
42Y23=F\u00FCr Spalte {0} wurde eine falsche JDBC-Typangabe zur\u00FCckgegeben.
43X50.U=ResultSet f\u00FCr nach links erweiterte Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X05.U=Quellenergebnisliste
01001=Es wurde versucht, eine bereits gel\u00F6schte Zeile zu aktualisieren oder zu l\u00F6schen. Keine Zeile wurde aktualisiert oder gel\u00F6scht.
42X15=Der Spaltenname ''{0}'' erscheint in einer Anweisung ohne eine FROM-Liste.
42Y50=Die Merkmalliste f\u00FCr die Tabelle ''{0}'' darf Indexwerte oder Werte f\u00FCr Integrit\u00E4tsbedingungen enthalten, jedoch nicht beide zusammen.
43Y04.U=Anzahl der Lesevorg\u00E4nge in der Hash-Tabelle
XRE07=Vorgang konnte nicht ausgef\u00FChrt werden, da sich die Datenbank nicht im Replication Master-Modus befindet.
42X42=F\u00FCr die Spalte ''{0}'' ist kein Korrelationsname zul\u00E4ssig, weil die Spalte in der ''FOR UPDATE''-Liste enthalten ist.
02000=F\u00FCr FETCH, UPDATE oder DELETE wurde keine Zeile gefunden oder das Ergebnis einer Abfrage ist eine leere Tabelle.
43X23.U=ResultSet der spezifischen Suche f\u00FCr {0} unter Verwendung von {1} {2}
XCY02.S=Die angeforderte Merkmal\u00E4nderung wird nicht unterst\u00FCtzt; ''{0}''\=''{1}''.
X0X0F.S=Tabelle ''{1}'' verf\u00FCgt nicht \u00FCber eine automatisch generierte Spalte mit der Bezeichnung ''{0}''.
42Y05=Es gibt keinen Fremdschl\u00FCssel mit dem Namen ''{0}''.
43Y22.U=Name der Anweisung
