#Thu May 16 17:55:33 BRT 2013
XCZ01.S=Usu\u00E1rio desconhecido ''{0}''.
42Y32=A classe agregadora ''{0}'' para agregar ''{1}'' no tipo {2} n\u00E3o implementa com.ibm.db2j.aggregates.Aggregator.
42Z31.U=tempo gasto neste ResultSet e abaixo \=
43X41.U=ResultSet de agrega\u00E7\u00E3o agrupada
XSRS8.S=O dispositivo de Log s\u00F3 pode ser definido na cria\u00E7\u00E3o do banco de dados, n\u00E3o podendo ser alterado em tempo de execu\u00E7\u00E3o.
42X51=A classe ''{0}'' n\u00E3o existe ou n\u00E3o est\u00E1 acess\u00EDvel. Isto pode ocorrer se a classe n\u00E3o for p\u00FAblica.
42Z22=Tipo inv\u00E1lido especificado para a coluna de identidade ''{0}''. Os \u00FAnicos tipos v\u00E1lidos para as colunas de identidade s\u00E3o BIGINT, INT e SMALLINT.
43X14.U=bloqueio de tabela
43Y13.U=qualificadores
42X06=Colunas de resultado em excesso especificadas para a tabela ''{0}''.
42Y41=''{0}'' n\u00E3o pode ser chamado diretamente por meio da EXECUTE STATEMENT, porque faz parte de um gatilho.
XSLAP.D=O banco de dados em {0} est\u00E1 na vers\u00E3o {1}. Bancos de dados beta n\u00E3o podem ser atualizados.
XBCXS.S=N\u00E3o \u00E9 poss\u00EDvel configurar um banco de dados para criptografia quando o banco de dados est\u00E1 no modo de archive de log.
42X33=A lista de colunas derivadas cont\u00E9m um nome de coluna duplicado ''{0}''.
43X32.U=Linhas filtradas
42X60=Especificado o valor inv\u00E1lido ''{0}'' para a propriedade insertMode na tabela ''{1}''.
43Y31.U=Carimbo do tempo do final da compila\u00E7\u00E3o
42Z40.U={0} na(s) primeira(s) {1} coluna(s).
42Y23=Informa\u00E7\u00E3o incorreta sobre tipo JDBC retornado para a coluna {0}.
43X50.U=ResultSet de jun\u00E7\u00E3o externa esquerda por ''hash''
43X05.U=Conjunto de resultados de origem
01001=Tentativa de atualizar ou excluir uma linha j\u00E1 exclu\u00EDda\: Nenhuma linha atualizada ou exclu\u00EDda.
42X15=O nome de coluna ''{0}'' aparece em uma instru\u00E7\u00E3o sem uma lista FROM.
42Y50=A lista de propriedades da tabela ''{0}'' pode conter valores para \u00EDndice ou para restri\u00E7\u00E3o, mas n\u00E3o ambos.
43Y04.U=N\u00FAmero de leituras na tabela de ''hash''
42X42=N\u00E3o \u00E9 permitido nome de correla\u00E7\u00E3o para a coluna ''{0}'', porque a mesma faz parte da lista FOR UPDATE.
02000=Nenhuma linha foi encontrada para FETCH, UPDATE ou DELETE; ou o resultado da consulta \u00E9 uma tabela vazia.
43X23.U=ResultSet de varredura distinta para {0} utilizando {1} {2}
XCY02.S=A altera\u00E7\u00E3o da propriedade solicitada n\u00E3o \u00E9 suportada ''{0}''\=''{1}''.
X0X0F.S=O nome de coluna ''{0}'' listado na matriz de sele\u00E7\u00E3o de coluna autogerada n\u00E3o localizada na tabela de inser\u00E7\u00E3o.
42Y05=N\u00E3o existe uma chave estrangeira chamada ''{0}''.
43Y22.U=Nome da instru\u00E7\u00E3o
