#Thu May 16 17:55:33 BRT 2013
XCZ01.S=Ismeretlen felhaszn\u00E1l\u00F3\: ''{0}''.
42Y32=A(z) ''{0}'' \u00F6sszes\u00EDt\u0151 oszt\u00E1ly a(z) ''{1}'' \u00F6sszes\u00EDt\u0151h\u00F6z a(z) {2} t\u00EDpuson nem val\u00F3s\u00EDtja meg a com.ibm.db2j.aggregates.Aggregator \u00F6sszes\u00EDt\u0151t. 
42Z31.U=az adott ResultSet fel\u00FCleten \u00E9s alatta elt\u00F6lt\u00F6tt id\u0151 \=
43X41.U=Csoportos\u00EDtott \u00F6sszes\u00EDt\u00E9si ResultSet
XSRS8.S=A napl\u00F3z\u00F3eszk\u00F6z csak az adatb\u00E1zis l\u00E9trehoz\u00E1sakor \u00E1ll\u00EDthat\u00F3 be, menet k\u00F6zben nem m\u00F3dos\u00EDthat\u00F3.
42X51=A(z) ''{0}'' oszt\u00E1ly nem l\u00E9tezik vagy nem el\u00E9rhet\u0151. Ez akkor t\u00F6rt\u00E9nhet, ha nem nyilv\u00E1nos.
42Z22=A(z) ''{0}'' azonoss\u00E1goszlophoz \u00E9rv\u00E9nytelen t\u00EDpus lett megadva. Az azonoss\u00E1goszlopok \u00E9rv\u00E9nyes t\u00EDpusai\: BIGINT, INT \u00E9s SMALLINT.
43X14.U=t\u00E1bla z\u00E1rol\u00E1sa
43Y13.U=min\u0151s\u00EDt\u0151k
42X06=A(z) ''{0}'' t\u00E1bl\u00E1hoz t\u00FAl sok eredm\u00E9nyoszlop van megadva.
42Y41=A(z) ''{0}'' EXECUTE STATEMENT utas\u00EDt\u00E1son kereszt\u00FCl k\u00F6zvetlen\u00FCl nem h\u00EDvhat\u00F3 meg, mivel a trigger r\u00E9sze.
XSLAP.D=A(z) {0} alatt tal\u00E1lhat\u00F3 adatb\u00E1zis verzi\u00F3sz\u00E1ma\: {1}. A b\u00E9ta adatb\u00E1zisok nem friss\u00EDthet\u0151k.
XBCXS.S=Nem \u00E1ll\u00EDthat\u00F3 be adatb\u00E1zis titkos\u00EDt\u00E1sra, am\u00EDg az adatb\u00E1zis napl\u00F3archiv\u00E1l\u00E1si m\u00F3dban van.
42X33=A sz\u00E1rmaztatott oszloplista t\u00F6bbsz\u00F6r\u00F6s ''{0}'' oszlopnevet tartalmaz.
43X32.U=Sz\u0171rt sorok
42X60=A(z) ''{1}'' t\u00E1bla insertMode tulajdons\u00E1g\u00E1hoz ''{0}'' \u00E9rv\u00E9nytelen \u00E9rt\u00E9k lett megadva.
43Y31.U=Ford\u00EDt\u00E1s befejez\u00E9si id\u0151pecs\u00E9tje
42Z40.U={0} az els\u0151 {1} oszlopon.
42Y23=A(z) {0} oszlophoz helytelen JDBC t\u00EDpus inform\u00E1ci\u00F3k ker\u00FCltek visszaad\u00E1sra.
43X50.U=Kivonat bal k\u00FCls\u0151 join ResultSet
43X05.U=Forr\u00E1s eredm\u00E9nyhalmaz
01001=K\u00EDs\u00E9rlet t\u00F6rt\u00E9nt egy m\u00E1r t\u00F6r\u00F6lt sor friss\u00EDt\u00E9s\u00E9re vagy t\u00F6rl\u00E9s\u00E9re\: egyetlen sor sem ker\u00FClt friss\u00EDt\u00E9sre vagy t\u00F6rl\u00E9sre.
42X15=A(z) ''{0}'' oszlopn\u00E9v az utas\u00EDt\u00E1sban FROM lista n\u00E9lk\u00FCl jelenik meg.
42Y50=A(z) ''{0}'' tulajdons\u00E1gok list\u00E1ja az indexhez vagy a megszor\u00EDt\u00E1shoz tartalmazhat \u00E9rt\u00E9keket, de mindkett\u0151h\u00F6z nem.
43Y04.U=Kivonatt\u00E1bla olvas\u00E1si sz\u00E1ma
42X42=A(z) ''{0}'' oszlophoz korrel\u00E1ci\u00F3n\u00E9v nem megengedett, mivel az a FOR UPDATE lista r\u00E9sze.
02000=Nem tal\u00E1lhat\u00F3 sor a FETCH, UPDATE vagy DELETE utas\u00EDt\u00E1shoz vagy a lek\u00E9rdez\u00E9s eredm\u00E9nye \u00FCres t\u00E1bla.
43X23.U=A(z) {0} elemhez tartoz\u00F3 elk\u00FCl\u00F6n\u00EDtett keres\u00E9s ResultSet {1} alkalmaz\u00E1s\u00E1val\: {2}
XCY02.S=A k\u00E9rt tulajdons\u00E1gm\u00F3dos\u00EDt\u00E1s nem t\u00E1mogatott\: ''{0}''\=''{1}''.
X0X0F.S=Az automatikusan el\u0151\u00E1ll\u00EDtott oszlopkijel\u00F6l\u00E9si t\u00F6mbben megjelen\u00EDtett ''{0}'' oszlopn\u00E9v a besz\u00FAr\u00E1s t\u00E1bl\u00E1ban nem tal\u00E1lhat\u00F3.
42Y05=Nem tal\u00E1lhat\u00F3 ''{0}'' nev\u0171 idegen kulcs.
43Y22.U=Utas\u00EDt\u00E1s neve
