#Thu May 16 17:55:33 BRT 2013
XCZ01.S=Nieznany u\u017Cytkownik ''{0}''.
42Y32=Klasa agregatora ''{0}'' dla agregacji ''{1}'' na typie {2} nie implementuje interfejsu com.ibm.db2j.aggregates.Aggregator. 
42Z31.U=up\u0142yw czasu w tym obiekcie ResultSet i kolejnych \=
43X41.U=Interfejs ResultSet dla agregatu zgrupowanego
XSRS8.S=Urz\u0105dzenie rejestruj\u0105ce mo\u017Ce by\u0107 ustawione tylko w momencie tworzenia bazy danych, nie mo\u017Ce by\u0107 zmieniane podczas pracy.
42X51=Klasa ''{0}'' nie istnieje lub jest niedost\u0119pna. Mo\u017Ce si\u0119 to zdarzy\u0107 w przypadku, gdy klasa nie jest publiczna.
42Z22=Okre\u015Blono niepoprawny typ dla kolumny to\u017Csamo\u015Bci ''{0}''. Jedynymi poprawnymi typami dla kolumny to\u017Csamo\u015Bci s\u0105 BIGINT, INT i SMALLINT.
43X14.U=blokowanie tabeli
43Y13.U=kwalifikatory
42X06=Dla tabeli ''{0}'' okre\u015Blono zbyt wiele kolumn wynikowych.
42Y41=Polecenie ''{0}'' nie mo\u017Ce by\u0107 wywo\u0142ane bezpo\u015Brednio przez wyra\u017Cenie EXECUTE STATEMENT, poniewa\u017C jest to cz\u0119\u015B\u0107 wyzwalacza.
XSLAP.D=Baza danych w {0} ma wersj\u0119 {1}. Wersje beta baz danych nie mog\u0105 by\u0107 aktualizowane.
XBCXS.S=Nie mo\u017Cna skonfigurowa\u0107 bazy danych w celu zaszyfrowania, gdy znajduje si\u0119 ona trybie archiwizowania dziennika.
42X33=Lista kolumn pochodnych zawiera zduplikowan\u0105 nazw\u0119 kolumny ''{0}''.
43X32.U=Wiersze filtrowane
42X60=Dla tabeli ''{1}'' okre\u015Blona zosta\u0142a niepoprawna warto\u015B\u0107 ''{0}'' dla w\u0142a\u015Bciwo\u015Bci insertMode.
43Y31.U=Datownik zako\u0144czenia kompilacji
42Z40.U={0} w pocz\u0105tkowych {1} kolumnach.
42Y23=Niepoprawne informacje o typie JDBC zwr\u00F3cone dla kolumny {0}.
43X50.U=Interfejs ResultSet dla lewostronnego \u0142\u0105czenia mieszaj\u0105cego zewn\u0119trznego
43X05.U=\u0179r\u00F3d\u0142owa tabela wynikowa
01001=Wyst\u0105pi\u0142a pr\u00F3ba zaktualizowania lub usuni\u0119cia ju\u017C usuni\u0119tego wiersza. \u017Baden wiersz nie zosta\u0142 zaktualizowany lub usuni\u0119ty.
42X15=Nazwa kolumny ''{0}'' pojawia si\u0119 w instrukcji poza list\u0105 FROM.
42Y50=Lista w\u0142a\u015Bciwo\u015Bci dla tabeli ''{0}'' mo\u017Ce zawiera\u0107 warto\u015Bci dla indeksu lub dla regu\u0142y ograniczaj\u0105cej, ale nie dla obu na raz.
43Y04.U=Liczba odczyt\u00F3w z tabeli mieszaj\u0105cej
42X42=Nazwa korelacji nie jest dozwolona dla kolumny ''{0}'', poniewa\u017C jest ona cz\u0119\u015Bci\u0105 listy FOR UPDATE.
02000=Dla polecenia FETCH, UPDATE lub DELETE nie znaleziono wierszy lub wynik zapytania jest pust\u0105 tabel\u0105.
43X23.U=Interfejs ResultSet skanowania odr\u0119bnego dla {0} za pomoc\u0105 {1} {2}
XCY02.S=\u017B\u0105dana zmiana w\u0142a\u015Bciwo\u015Bci nie jest obs\u0142ugiwana; ''{0}''\=''{1}''.
X0X0F.S=W tabeli wstawiania nie znaleziono nazwy kolumny ''{0}'' wymienionej w automatycznie generowanej tablicy wyboru kolumn.
42Y05=Klucz obcy o nazwie ''{0}'' nie istnieje.
43Y22.U=Nazwa instrukcji
