#Thu May 16 17:55:33 BRT 2013
21000=A subconsulta escalar \u00E9 permitida apenas para retornar uma \u00FAnica linha.
XBCXT.S=N\u00E3o \u00E9 poss\u00EDvel criptografar novamente um banco de dados com uma nova senha de inicializa\u00E7\u00E3o ou uma chave de criptografia externa quando o banco de dados est\u00E1 no modo de archive de log.
42Y33=A agrega\u00E7\u00E3o {0} cont\u00E9m uma ou mais agrega\u00E7\u00F5es.
43X33.U=pr\u00F3ximo tempo em milissegundos/linhas
42X25=A fun\u00E7\u00E3o ''{0}'' n\u00E3o \u00E9 permitida no tipo ''{1}''.
42Y60=Valor inv\u00E1lido, ''{0}'', especificado para a substitui\u00E7\u00E3o de hashLoadFactor. O valor deve ser maior que 0,0 e menor que ou igual a 1,0.
43Y32.U=Carimbo do tempo do in\u00EDcio da execu\u00E7\u00E3o
42X52=N\u00E3o \u00E9 permitida a chamada do m\u00E9todo (''{0}'') utilizando um receptor do tipo primitivo Java ''{1}''.
42Z41.U=Sem\u00E2nticas nulas ordenadas nas seguintes colunas\:
42Z23=Tentativa de modificar a coluna de identidade ''{0}''.
43X51.U=ResultSet de varredura por ''hash'' para {0} utilizando {1} {2}
43X06.U=N\u00FAmero da subconsulta final
42Z50=ERRO INTERNO\: N\u00E3o foi poss\u00EDvel gerar um c\u00F3digo para {0}.
43Y50.U=Excluir VTI
43Y05.U=N\u00FAmero de escritas na tabela de ''hash''
42X07=O valor nulo na cl\u00E1usula VALUES \u00E9 permitido apenas quando a cl\u00E1usula VALUES aparece dentro de uma instru\u00E7\u00E3o INSERT.
42Y42=A escala ''{1}'' n\u00E3o \u00E9 uma escala v\u00E1lida para {0}.
42X34=H\u00E1 um par\u00E2metro ? na lista de sele\u00E7\u00E3o.  Isto n\u00E3o \u00E9 permitido.
43X24.U=restri\u00E7\u00E3o
XCY03.S=A propriedade solicitada ''{0}'' n\u00E3o foi configurada.
43Y23.U=Texto da instru\u00E7\u00E3o
42X61=Os tipos ''{0}'' e ''{1}'' n\u00E3o s\u00E3o {2} compat\u00EDveis.
XCZ02.S=Par\u00E2metro inv\u00E1lido ''{0}''\=''{1}''.
42Z32.U=divis\u00E3o do tempo total\:
42Y24=A vis\u00E3o ''{0}'' n\u00E3o permite atualiza\u00E7\u00E3o (Atualmente, as vis\u00F5es n\u00E3o permitem atualiza\u00E7\u00E3o).
43X42.U=Possui agrega\u00E7\u00E3o distinta
42X16=O nome de coluna ''{0}'' aparece v\u00E1rias vezes na cl\u00E1usula SET de uma instru\u00E7\u00E3o UPDATE.
XSRS9.S=O registro {0} n\u00E3o existe mais.
42X43=O ResultSetMetaData retornado para a classe/objeto ''{0}'' era nulo. Para utilizar essa classe como uma tabela virtual externa, o ResultSetMetaData n\u00E3o pode ser nulo.
44X05.U=pr\u00F3ximo erro
43X60.U=ResultSet de \u00EDndice da linha para linha base para {0}
43X15.U=bloqueio de linha
43Y14.U=ResultSet de uni\u00E3o
XSLAQ.D=N\u00E3o foi poss\u00EDvel criar o arquivo de log no diret\u00F3rio {0}.
