#Thu May 16 17:55:33 BRT 2013
43X42.U=Tiene agregado distinct
42Z23=Se ha intentado modificar una columna de identidad ''{0}''. 
43X60.U=Fila \u00EDndice para ResultSet de fila base para {0}
42Z50=ERROR INTERNO\: imposible generar c\u00F3digo para {0}.
42Z41.U=Sem\u00E1ntica de nulos ordenados en las siguientes columnas\: 
42Y24=La vista ''{0}'' no es actualizable. (Actualmente las vistas no son actualizables). 
XSRS9.S=El registro {0} ya no existe
XCZ02.S=Par\u00E1metro ''{0}''\=''{1}'' no v\u00E1lido.
42X25=La funci\u00F3n ''{0}'' no est\u00E1 permitida en el tipo ''{1}''.
43Y14.U=ResultSet de uni\u00F3n
42X52=No est\u00E1 permitido que el m\u00E9todo de llamada (''{0}'') que utilice un receptor del tipo primitivo de Java ''{1}''.
XRE08=El modo de repetici\u00F3n secundaria se ha iniciado correctamente para la base de datos ''{0}''. Se ha rechazado la conexi\u00F3n porque la base de datos est\u00E1 en modo de repetici\u00F3n secundaria. 
43Y32.U=Indicaci\u00F3n de la hora de inicio de ejecuci\u00F3n
XCY03.S=La propiedad necesaria ''{0}'' no se ha establecido.
43Y50.U=Suprimir VTI
43X15.U=bloqueo de fila
XBCXT.S=No se puede volver a cifrar una base de datos con una nueva contrase\u00F1a de arranque o una clave de cifrado externa cuando la base de datos est\u00E1 en modalidad de registro de archivado.
42Y42=La escala ''{1}'' no es una escala v\u00E1lida para un ''{0}''.
43X33.U=tiempo de siguiente en milisegundos/fila
44X05.U=error siguiente
42X16=El nombre de columna ''{0}'' aparece varias veces en la cl\u00E1usula SET de una sentencia UPDATE.
42Z32.U=tiempo total de ruptura\: 
43X51.U=ResultSet de exploraci\u00F3n hash para {0} mediante {1} {2}
42X43=El ResultSetMetaData devuelto para la clase/objeto ''{0}'' era nulo. Para poder utilizar esta clase como tabla virtual externa, el valor de ResultSetMetaData no debe ser nulo. 
42X70=El n\u00FAmero de columnas indicado en la lista de columnas de la tabla no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta asociada a la definici\u00F3n de tabla de ''{0}''.
21000=La subconsulta escalar tiene permitido devolver una sola fila.
43Y05.U=N\u00FAmero de grabaciones en la tabla hash
43Y23.U=Texto de sentencia
42Y33=El agregado {0} contiene uno o m\u00E1s agregados.
XSLAQ.D=No se puede crear una archivo de anotaciones cronol\u00F3gicas en el directorio {0}.
42X07=NULL s\u00F3lo est\u00E1 permitido en una cl\u00E1usula VALUES dentro de una sentencia INSERT.
42Y60=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashLoadFactor. El valor debe ser mayor que 0.0 y menor o igual a 1.0.
42X34=Hay un par\u00E1metro ? en la lista de selecci\u00F3n.  No est\u00E1 permitido.
43X06.U=Fin de subconsulta n\u00FAmero
42X61=Los tipos ''{0}'' y ''{1}'' no son compatibles con {2}.
43X24.U=restricci\u00F3n
