#Thu May 16 17:55:33 BRT 2013
42Z24=Vyskytlo se p\u0159ete\u010Den\u00ED v hodnot\u011B toto\u017Enosti pro sloupec ''{1}'' v tabulce ''{0}''.
42Y25=''{0}'' je syst\u00E9movou tabulkou. U\u017Eivatel\u00E9 nemohou modifikovat obsah t\u00E9to tabulky.
43Y15.U=Sjednocen\u00ED
XIE0B.S=Sloupec ''{0}'' v tabulce je typu {1}, nen\u00ED podporov\u00E1n funkc\u00ED importu/exportu.  
01003=Z argumentu funkce sloupce byly eliminov\u00E1ny hodnoty ''null''.
43Y33.U=Ukon\u010Dit \u010Dasov\u00E9 raz\u00EDtko proveden\u00ED
42X26=T\u0159\u00EDda ''{0}'' pro sloupec ''{1}'' neexistuje nebo je nep\u0159\u00EDstupn\u00E1. K tomu m\u016F\u017Ee doj\u00EDt, jestli\u017Ee t\u0159\u00EDda nen\u00ED ve\u0159ejn\u00E1.
XCY04.S=Neplatn\u00E1 syntaxe pro p\u0159episy nastaven\u00ED optimaliz\u00E1toru. Syntaxe by m\u011Bla b\u00FDt -- DERBY-PROPERTIES jm\u00E9noVlastnosti \= hodnota [, jm\u00E9noVlastnosti \= hodnota]*
43Y51.U=Vymazat rozhran\u00ED ResultSet kask\u00E1dy
42X53=Predik\u00E1t LIKE m\u016F\u017Ee m\u00EDt pouze operandy ''CHAR'' nebo ''VARCHAR''. Typ ''{0}'' nen\u00ED povolen.
42Z15=Byl uveden neplatn\u00FD typ pro sloupec ''{0}''. Typ sloupce nem\u016F\u017Ee b\u00FDt zm\u011Bn\u011Bn. 
43X16.U=odlo\u017Een\u00FD
42X80=Klauzule VALUES mus\u00ED obsahovat alespo\u0148 jeden prvek. Pr\u00E1zdn\u00E9 prvky nejsou povoleny. 
XBCXU.S=Selhalo \u0161ifrov\u00E1n\u00ED ne\u0161ifrovan\u00E9 datab\u00E1ze\: {0}
43X34.U=pozice spu\u0161t\u011Bn\u00ED
42Y16=Nebyla nalezena \u017E\u00E1dn\u00E1 ve\u0159ejn\u00E1 statick\u00E1 metoda ''{0}'' ve t\u0159\u00EDd\u011B ''{1}''. Metoda m\u016F\u017Ee existovat, ale nen\u00ED ve\u0159ejn\u00E1 nebo nen\u00ED statick\u00E1. 
43X52.U=Rozhran\u00ED ResultSet transforma\u010Dn\u00EDho skenov\u00E1n\u00ED pro {0}
42Z33.U=\u010Das konstruktoru (milisekundy) \=
42Y43=M\u011B\u0159\u00EDtko ''{0}'' nen\u00ED platn\u00FDm m\u011B\u0159\u00EDtkem s p\u0159esnost\u00ED ''{1}''.
43X70.U=Slou\u010Dit
42X17=V seznamu Vlastnosti klauzule FROM nen\u00ED hodnota ''{0}'' platn\u00E1 jako specifikace joinOrder. Platn\u00E9 jsou pouze hodnoty FIXED a UNFIXED. 
42Y70=U\u017Eivatel uvedl neplatn\u00E9 po\u0159ad\u00ED slou\u010Den\u00ED. To m\u016F\u017Ee b\u00FDt zp\u016Fsobeno t\u00EDm, \u017Ee sloupec slou\u010Den\u00ED z vnit\u0159n\u00ED tabulky je p\u0159ed\u00E1v\u00E1n jako parametr vn\u011Bj\u0161\u00ED virtu\u00E1ln\u00ED tabulce.
42X44=Neplatn\u00E1 d\u00E9lka ''{0}'' ve specifikaci sloupce.
43Y06.U=Set\u0159\u00EDdit rozhran\u00ED ResultSet
43Y24.U=\u010Cas anal\u00FDzy
XSLAR.D=Nelze kop\u00EDrovat soubor protokolu ''{0}'' do ''{1}'' b\u011Bhem obnovy. Ujist\u011Bte se, \u017Ee v m\u00EDst\u011B ur\u010Den\u00ED je dostatek prostoru a \u017Ee m\u00E1te spr\u00E1vn\u00E1 povolen\u00ED. 
42Y07=Sch\u00E9ma ''{0}'' neexistuje
42Z60={0} nen\u00ED povoleno, dokud vlastnost datab\u00E1ze {1} nebude m\u00EDt hodnotu ''{2}''.
42Y34=Jm\u00E9no sloupce ''{0}'' odpov\u00EDd\u00E1 v\u00EDce ne\u017E jednomu sloupci v\u00FDsledk\u016F v tabulce ''{1}''.
43X07.U=po\u010Det \u0159\u00E1dk\u016F odhadnut\u00FD optimaliz\u00E1torem\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y60.U=Rozhran\u00ED ResultSet vylou\u010Den\u00ED
42X08=Konstruktor pro t\u0159\u00EDdu ''{0}'' nelze pou\u017E\u00EDt jako vn\u011Bj\u0161\u00ED virtu\u00E1ln\u00ED tabulku, proto\u017Ee t\u0159\u00EDda neimplementuje ''{1}''. 
42Y61=Byla uvedena neplatn\u00E1 hodnota ''{0}'' pro p\u0159epis nastaven\u00ED hashMaxCapacity. Hodnota mus\u00ED b\u00FDt v\u011Bt\u0161\u00ED ne\u017E 0.
43X25.U=index
43X43.U=V set\u0159\u00EDd\u011Bn\u00E9m po\u0159ad\u00ED
42X35=Nen\u00ED povoleno, aby oba operandy ''{0}'' byly parametry ?.
42Z42.U=ID sloupce
42X62=''{0}'' nen\u00ED povoleno ve sch\u00E9matu ''{1}''.
43X61.U=Sloupce, k nim\u017E bylo p\u0159istoupeno ze z\u00E1sobn\u00EDkov\u00E9 pam\u011Bti
