#Thu May 16 17:55:33 BRT 2013
42Z24=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0432 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0438 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{1}'' \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 ''{0}''.
42Y25=''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435\u0439.  \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F\u043C \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0435 \u044D\u0442\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B.
43Y15.U=\u0421\u043B\u0438\u044F\u043D\u0438\u0435
XIE0B.S=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0442\u0438\u043F\u0443 {1}; \u043E\u043D \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0435\u0439 \u0438\u043C\u043F\u043E\u0440\u0442\u0430/\u044D\u043A\u0441\u043F\u043E\u0440\u0442\u0430.   
01003=\u041D\u0443\u043B\u0435\u0432\u044B\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0443\u0434\u0430\u043B\u0435\u043D\u044B \u0438\u0437 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u0430.
43Y33.U=\u0412\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043C\u0435\u0442\u043A\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F
42X26=\u041A\u043B\u0430\u0441\u0441 ''{0}'' \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{1}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0438\u043B\u0438 \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u0435\u043D. \u042D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442\u044C, \u0435\u0441\u043B\u0438 \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C.
XCY04.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0441\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0441 \u0434\u043B\u044F \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430. \u0414\u043E\u043B\u0436\u0435\u043D \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u0441\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0441\: DERBY-PROPERTIES \u0438\u043C\u044F_\u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \= \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 [, \u0438\u043C\u044F_\u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \= \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435]*
43Y51.U=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u043A\u0430\u0441\u043A\u0430\u0434\u043D\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet)
42X53=\u0423 \u043F\u0440\u0435\u0434\u0438\u043A\u0430\u0442\u0430 LIKE \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u043F\u0435\u0440\u0430\u043D\u0434\u044B ''CHAR'' \u0438\u043B\u0438 ''VARCHAR''. \u0422\u0438\u043F ''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F.
42Z15=\u0417\u0430\u0434\u0430\u043D \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0442\u0438\u043F \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}''. \u0422\u0438\u043F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043D\u0435\u043B\u044C\u0437\u044F.  
43X16.U=\u043E\u0442\u043B\u043E\u0436\u0435\u043D\u043E
42X80=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F VALUES \u0434\u043E\u043B\u0436\u043D\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u0438\u043D \u044D\u043B\u0435\u043C\u0435\u043D\u0442. \u041F\u0443\u0441\u0442\u044B\u0435 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F. 
XBCXU.S=\u0428\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043D\u0435\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u043E\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E\: {0}
43X34.U=\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430\u0447\u0430\u043B\u0430
42Y16=\u0412 \u043A\u043B\u0430\u0441\u0441\u0435 ''{1}'' \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E\u0433\u043E \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043C\u0435\u0442\u043E\u0434\u0430 ''{0}''. \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u044D\u0442\u043E\u0442 \u043C\u0435\u0442\u043E\u0434 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u043D\u043E \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C \u0438\u043B\u0438 \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u043C. 
43X52.U=ResultSet - \u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0441 \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0434\u043B\u044F {0}
42Z33.U=\u0432\u0440\u0435\u043C\u044F \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u043E\u0440\u0430 (\u043C\u0441\u0435\u043A) \=
42Y43=\u041E\u0431\u043B\u0430\u0441\u0442\u044C ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u043E\u0431\u043B\u0430\u0441\u0442\u044C\u044E \u0441 \u0442\u043E\u0447\u043D\u043E\u0441\u0442\u044C\u044E ''{1}''.
43X70.U=\u041E\u0431\u044A\u0435\u0434\u0438\u043D\u0438\u0442\u044C
42X17=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 Properties \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 FROM \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 joinOrder. \u0414\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F FIXED \u0438 UNFIXED.  
42Y70=\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u0443\u043A\u0430\u0437\u0430\u043B \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F. \u042D\u0442\u043E \u043C\u043E\u0433\u043B\u043E \u0431\u044B\u0442\u044C \u0432\u044B\u0437\u0432\u0430\u043D\u043E \u0442\u0435\u043C, \u0447\u0442\u043E \u0441\u0442\u043E\u043B\u0431\u0435\u0446 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0438\u0437 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0431\u044B\u043B \u043F\u0435\u0440\u0435\u0434\u0430\u043D \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 \u0432\u043D\u0435\u0448\u043D\u0435\u0439 \u0432\u0438\u0440\u0442\u0443\u0430\u043B\u044C\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435.
42X44=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0434\u043B\u0438\u043D\u0430 (''{0}'') \u0432 \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u0430.
43Y06.U=\u041D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438
43Y24.U=\u0412\u0440\u0435\u043C\u044F \u0430\u043D\u0430\u043B\u0438\u0437\u0430
XSLAR.D=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u043A\u043E\u043F\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0444\u0430\u0439\u043B \u0436\u0443\u0440\u043D\u0430\u043B\u0430 ''{0}'' \u0432 ''{1}'' \u043F\u0440\u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u0443 \u0432\u0430\u0441 \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E \u043C\u0435\u0441\u0442\u0430 \u0438 \u0447\u0442\u043E \u0438\u043C\u0435\u044E\u0442\u0441\u044F \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F. 
42Y07=\u0421\u0445\u0435\u043C\u0430 ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
42Z60={0} \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F, \u0435\u0441\u043B\u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0443 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 {1} \u043D\u0435 \u043F\u0440\u0438\u0441\u0432\u043E\u0435\u043D\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{2}''.
42Y34=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0431\u043E\u043B\u0435\u0435 \u0447\u0435\u043C \u043E\u0434\u043D\u043E\u043C\u0443 \u0441\u0442\u043E\u043B\u0431\u0446\u0443 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 ''{1}''.
43X07.U=\u0447\u0438\u0441\u043B\u043E \u0441\u0442\u0440\u043E\u043A \u043F\u043E \u043E\u0446\u0435\u043D\u043A\u0435 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y60.U=ResultSet - Except
42X08=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u043E\u0440 \u0434\u043B\u044F \u043A\u043B\u0430\u0441\u0441\u0430 ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0432\u043D\u0435\u0448\u043D\u0435\u0439 \u0432\u0438\u0440\u0442\u0443\u0430\u043B\u044C\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E\u0442 \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 ''{1}''. 
42Y61=\u0414\u043B\u044F \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F hashMaxCapacity \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\: {0}. \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435 0.
43X25.U=\u0438\u043D\u0434\u0435\u043A\u0441
43X43.U=\u0412 \u043F\u043E\u0440\u044F\u0434\u043A\u0435 \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438
42X35=\u041D\u0435\u043B\u044C\u0437\u044F, \u0447\u0442\u043E\u0431\u044B \u043E\u0431\u0430 \u043E\u043F\u0435\u0440\u0430\u043D\u0434\u0430 ''{0}'' \u044F\u0432\u043B\u044F\u043B\u0438\u0441\u044C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430\u043C\u0438 ?.
42Z42.U=ID \u0441\u0442\u043E\u043B\u0431\u0446\u0430
42X62=''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0432 \u0441\u0445\u0435\u043C\u0435 ''{1}''.
43X61.U=\u0421\u0442\u043E\u043B\u0431\u0446\u044B, \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u043B\u0441\u044F \u0438\u0437 \u043A\u0443\u0447\u0438
