#Thu May 16 17:55:33 BRT 2013
42Z24=Wyst\u0105pi\u0142o przepe\u0142nienie w warto\u015Bci to\u017Csamo\u015Bci dla kolumny ''{1}'' w tabeli ''{0}''.
42Y25=Tabela ''{0}'' jest tabel\u0105 systemow\u0105. U\u017Cytkownicy nie mog\u0105 modyfikowa\u0107 zawarto\u015Bci tej tabeli.
43Y15.U=Unia
XIE0B.S=Kolumna ''{0}'' tabeli, kt\u00F3ra ma typ {1}, nie jest obs\u0142ugiwana przez opcj\u0119 importu/eksportu. 
01003=Z argumentu funkcji kolumnowej zosta\u0142y usuni\u0119te wszystkie warto\u015Bci null.
43Y33.U=Datownik zako\u0144czenia wykonywania
42X26=Klasa ''{0}'' dla kolumny ''{1}'' nie istnieje lub jest niedost\u0119pna. Mo\u017Ce si\u0119 to zdarzy\u0107 w przypadku, gdy klasa nie jest publiczna.
XCY04.S=Niepoprawna sk\u0142adnia nadpisa\u0144 optymalizatora. Poprawna sk\u0142adnia -- DERBY-PROPERTIES nazwaW\u0142a\u015Bciwo\u015Bci \= warto\u015B\u0107 [, nazwaW\u0142a\u015Bciwo\u015Bci \= warto\u015B\u0107]*
43Y51.U=Usu\u0144 kaskadowy interfejs ResultSet
42X53=Predykat LIKE mo\u017Ce mie\u0107 tylko operandy ''CHAR'' lub ''VARCHAR''. Typ ''{0}'' nie jest dozwolony.
42Z15=Okre\u015Blono niepoprawny typ kolumny ''{0}''. Typ kolumny nie mo\u017Ce by\u0107 zmieniony. 
43X16.U=odroczone
42X80=Klauzula VALUES musi zawiera\u0107 przynajmniej jeden element. Puste elementy nie s\u0105 dozwolone. 
XBCXU.S=Szyfrowanie niezaszyfrowanej bazy danych nie powiod\u0142o si\u0119\: {0}
43X34.U=pozycja pocz\u0105tkowa
42Y16=W klasie ''{1}'' nie znaleziono publicznej metody statycznej ''{0}''. Metoda mo\u017Ce istnie\u0107, ale nie jest publiczna lub statyczna. 
43X52.U=Interfejs ResultSet dla skanowania mieszaj\u0105cego dla {0}
42Z33.U=czas operacji constructor (milisekundy) \=
42Y43=Skala ''{0}'' nie jest poprawn\u0105 skal\u0105 o dok\u0142adno\u015Bci ''{1}''.
43X70.U=\u0141\u0105czenie
42X17=Na li\u015Bcie w\u0142a\u015Bciwo\u015Bci klauzuli FROM warto\u015B\u0107 ''{0}'' jest niepoprawna wed\u0142ug specyfikacji joinOrder. Poprawne s\u0105 tylko warto\u015Bci FIXED i UNFIXED. 
42Y70=U\u017Cytkownik poda\u0142 niedozwolon\u0105 kolejno\u015B\u0107 \u0142\u0105czenia. Mog\u0142o to by\u0107 spowodowane przez kolumn\u0119 \u0142\u0105czenia z tabeli wewn\u0119trznej przekazywanej jako parametr do zewn\u0119trznej tabeli wirtualnej.
42X44=Niepoprawna d\u0142ugo\u015B\u0107 ''{0}'' w specyfikacji kolumny.
43Y06.U=Interfejs ResultSet dla sortowania
43Y24.U=Czas analizowania
XSLAR.D=Nie mo\u017Cna skopiowa\u0107 pliku dziennika ''{0}'' do ''{1}'' podczas odtwarzania. Upewnij si\u0119, czy jest wystarczaj\u0105ca ilo\u015B\u0107 miejsca, a uprawnienia s\u0105 poprawne. 
42Y07=Schemat ''{0}'' nie istnieje
42Z60={0} nie jest dozwolone, dop\u00F3ki w\u0142a\u015Bciwo\u015B\u0107 {1} bazy danych ma warto\u015B\u0107 ''{2}''.
42Y34=Nazwa kolumny ''{0}'' jest zgodna z wi\u0119cej ni\u017C jedn\u0105 kolumn\u0105 wynikow\u0105 tabeli ''{1}''.
43X07.U=liczba wierszy oszacowana przez optymalizator\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y60.U=Interfejs ResultSet dla wy\u0142\u0105czenia
42X08=Konstruktor klasy ''{0}'' nie mo\u017Ce by\u0107 wykorzystywany jako zewn\u0119trzna tabela wirtualna, poniewa\u017C klasa nie implementuje ''{1}''. 
42Y61=Niepoprawna warto\u015B\u0107 ''{0}'' okre\u015Blona dla nadpisania hashMaxCapacity. Warto\u015B\u0107 musi by\u0107 wi\u0119ksza od 0.
43X25.U=indeks
43X43.U=W porz\u0105dku sortowania
42X35=Niedozwolone jest, aby oba operandy ''{0}'' by\u0142y parametrami ?.
42Z42.U=Identyfikator kolumny
42X62=Element ''{0}'' nie jest dozwolony w schemacie ''{1}''.
43X61.U=Kolumny, do kt\u00F3rych dost\u0119p uzyskano ze sterty
