#Thu May 16 17:55:33 BRT 2013
42Z24=\u8868 ''{0}'' \u306E\u5217 ''{1}'' \u306B\u5BFE\u3059\u308B ID \u5024 \u306B\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
42Y25=''{0}'' \u306F\u30B7\u30B9\u30C6\u30E0\u8868\u3067\u3059\u3002  \u30E6\u30FC\u30B6\u30FC\u304C\u3053\u306E\u8868\u306E\u5185\u5BB9\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
43Y15.U=\u5171\u7528\u4F53
XIE0B.S=\u8868\u306E\u5217 ''{0}'' \u306E\u578B\u306F {1} \u3067\u3059\u3002\u30A4\u30F3\u30DD\u30FC\u30C8/\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u306E\u30D5\u30A3\u30FC\u30C1\u30E3\u30FC\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002   
43Y33.U=\u5B9F\u884C\u7D42\u4E86\u30BF\u30A4\u30E0\u30FB\u30B9\u30BF\u30F3\u30D7
01003=\u5217\u95A2\u6570\u306E\u5F15\u6570\u304B\u3089 NULL \u5024\u304C\u9664\u53BB\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42X26=\u5217 ''{1}'' \u306B\u5BFE\u3059\u308B\u30AF\u30E9\u30B9 ''{0}'' \u306F\u5B58\u5728\u3057\u306A\u3044\u304B\u3001\u30A2\u30AF\u30BB\u30B9\u4E0D\u80FD\u3067\u3059\u3002 \u3053\u308C\u306F\u3001\u3053\u306E\u30AF\u30E9\u30B9\u304C public \u3067\u306A\u3044\u5834\u5408\u306B\u767A\u751F\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
XCY04.S=\u30AA\u30D7\u30C6\u30A3\u30DE\u30A4\u30B6\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u306E\u69CB\u6587\u304C\u7121\u52B9\u3067\u3059\u3002 \u6B21\u306E\u3088\u3046\u306A\u69CB\u6587\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 -- DERBY-PROPERTIES propertyName \= value [, propertyName \= value]*
43Y51.U=\u30AB\u30B9\u30B1\u30FC\u30C9\u7D50\u679C\u30BB\u30C3\u30C8\u306E\u524A\u9664
42X53=LIKE \u8FF0\u90E8\u306F\u3001''CHAR'' \u307E\u305F\u306F ''VARCHAR'' \u30AA\u30DA\u30E9\u30F3\u30C9\u3057\u304B\u6301\u3064\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002 \u578B ''{0}'' \u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Z15=\u5217 ''{0}'' \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u578B\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 \u5217\u306E\u578B\u306F\u5909\u66F4\u3067\u304D\u307E\u305B\u3093\u3002  
XRE09=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u306E\u8907\u88FD\u30B9\u30EC\u30FC\u30D6\u30E2\u30FC\u30C9\u3092\u958B\u59CB\u3067\u304D\u307E\u305B\u3093\u3002\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F\u3059\u3067\u306B\u30D6\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u3059\u3002 
43X16.U=\u636E\u3048\u7F6E\u304D
42X80=VALUES \u6587\u7BC0\u306B\u306F\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u30A8\u30EC\u30E1\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 \u7A7A\u306E\u30A8\u30EC\u30E1\u30F3\u30C8\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002 
XBCXU.S=\u6697\u53F7\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6697\u53F7\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: {0}
43X34.U=\u958B\u59CB\u4F4D\u7F6E
42Y16=public \u306E\u9759\u7684\u30E1\u30BD\u30C3\u30C9 ''{0}'' \u304C\u30AF\u30E9\u30B9 ''{1}'' \u306B\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002 \u3053\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u5B58\u5728\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u304C\u3001public \u3067\u306A\u3044\u304B\u3001\u9759\u7684\u3067\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002 
43X52.U={0} \u306E\u30CF\u30C3\u30B7\u30E5\u30FB\u30B9\u30AD\u30E3\u30F3 ResultSet
42Z33.U=\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u6642\u9593 (\u30DF\u30EA\u79D2) \=
42Y43=\u76EE\u76DB\u308A ''{0}'' \u306F\u3001''{1}'' \u306E\u7CBE\u5EA6\u306B\u6709\u52B9\u306A\u76EE\u76DB\u308A\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
43X70.U=\u7D50\u5408
42X17=FROM \u6587\u7BC0\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30EA\u30B9\u30C8\u306B\u304A\u3044\u3066\u3001\u5024 ''{0}'' \u306F joinOrder \u4ED5\u69D8\u3068\u3057\u3066\u6709\u52B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002 FIXED \u304A\u3088\u3073 UNFIXED \u306E\u5024\u306E\u307F\u304C\u6709\u52B9\u3067\u3059\u3002  
42Y70=\u30E6\u30FC\u30B6\u30FC\u304C\u6B63\u3057\u304F\u306A\u3044\u7D50\u5408\u9806\u5E8F\u3092\u6307\u5B9A\u3057\u307E\u3057\u305F\u3002 \u3053\u306E\u539F\u56E0\u3068\u3057\u3066\u3001\u5185\u90E8\u8868\u304B\u3089\u306E\u7D50\u5408\u5217\u304C\u3001\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3068\u3057\u3066\u5916\u90E8\u4EEE\u60F3\u8868\u306B\u6E21\u3055\u308C\u305F\u3053\u3068\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002
42X44=\u5217\u4ED5\u69D8\u306B\u7121\u52B9\u306A\u9577\u3055 ''{0}'' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002
43Y06.U=\u30BD\u30FC\u30C8 ResultSet
42X71=\u30C7\u30FC\u30BF\u578B ''{0}'' \u306F\u3001\u5217 ''{1}'' \u3067\u306F\u7121\u52B9\u3067\u3059\u3002
XBM0A.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC ''{0}'' \u304C\u5B58\u5728\u3057\u307E\u3059\u3002  \u305F\u3060\u3057\u3001\u4E88\u671F\u3055\u308C\u3066\u3044\u305F ''{1}'' \u30D5\u30A1\u30A4\u30EB\u306F\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u304A\u305D\u3089\u304F\u3001\u3053\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u4F5C\u6210\u3059\u308B\u9014\u4E2D\u3067 Derby \u304C\u505C\u6B62\u3057\u307E\u3057\u305F\u3002 \u3053\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u524A\u9664\u3057\u3001\u3082\u3046\u4E00\u5EA6\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
43Y24.U=\u89E3\u6790\u6642\u9593
XSLAR.D=\u30EA\u30B9\u30C8\u30A2\u306E\u9593\u3001\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB ''{0}'' \u3092 ''{1}'' \u306B\u30B3\u30D4\u30FC\u3067\u304D\u307E\u305B\u3093\u3002 \u5341\u5206\u306A\u30B9\u30DA\u30FC\u30B9\u304C\u3042\u308A\u3001\u8A31\u53EF\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
42Y07=\u30B9\u30AD\u30FC\u30DE ''{0}'' \u306F\u5B58\u5728\u3057\u307E\u305B\u3093
42Z60={0} \u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC {1} \u306E\u5024\u304C ''{2}'' \u3067\u306A\u3044\u5834\u5408\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Y34=\u5217\u540D ''{0}'' \u306F\u3001\u8868 ''{1}'' \u5185\u306E\u8907\u6570\u306E\u7D50\u679C\u5217\u306B\u4E00\u81F4\u3057\u307E\u3059\u3002
43X07.U=\u30AA\u30D7\u30C6\u30A3\u30DE\u30A4\u30B6\u30FC\u898B\u7A4D\u884C\u6570\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y60.U=Except ResultSet
42Y61=hashMaxCapacity \u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u5024 ''{0}'' \u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 \u5024\u306F 0 \u3088\u308A\u5927\u304D\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
42X08=\u30AF\u30E9\u30B9 ''{0}'' \u306F ''{1}'' \u3092\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3057\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u3053\u306E\u30AF\u30E9\u30B9\u306E\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u3092\u5916\u90E8\u4EEE\u60F3\u8868\u3068\u3057\u3066\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002 
43X25.U=\u7D22\u5F15
43X43.U=\u30BD\u30FC\u30C8\u9806
42X35=''{0}'' \u306E\u4E21\u65B9\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u3092 ? \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42Z42.U=\u5217 ID
42X62=''{0}'' \u306F ''{1}'' \u30B9\u30AD\u30FC\u30DE\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
43X61.U=\u30D2\u30FC\u30D7\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3055\u308C\u308B\u5217
