#Thu May 16 17:55:33 BRT 2013
42Z24=Se ha producido un desbordamiento en el valor de identidad de la columna ''{1}'' de la tabla ''{0}''.
42Y25=''{0}'' es una tabla del sistema.  Los usuarios no tienen permitido modificar el contenido de esta tabla.
43Y15.U=Uni\u00F3n
XIE0B.S=La columna {0} de la tabla de tipo {1}, no est\u00E1 soportada por la funci\u00F3n import/export.   
43Y33.U=Indicaci\u00F3n de la hora de fin de ejecuci\u00F3n
01003=Se han eliminado valores nulos del argumento de una funci\u00F3n de columna.
42X26=La clase ''{0}'' para la columna ''{1}'' no existe o no es accesible. Esto puede ocurrir si la clase no es p\u00FAblica.
XCY04.S=Sintaxis no v\u00E1lida para los modificadores de optimizador. La sintaxis debe ser -- DERBY-PROPERTIES propertyName \= valor [, propertyName \= valor]*
43Y51.U=Suprimir Cascade ResultSet
42X53=El predicado LIKE s\u00F3lo puede tener los operandos ''CHAR'' o ''VARCHAR''. El tipo ''{0}'' no est\u00E1 permitido.
42Z15=Se ha especificado un tipo no v\u00E1lido para la columna ''{0}''. No se puede cambiar el tipo de una columna.  
XRE09=No se ha podido iniciar la repetici\u00F3n secundaria para la base de datos ''{0}''. La base de datos ya se ha iniciado. 
43X16.U=diferido
42X80=La cl\u00E1usula VALUES debe contener al menos un elemento. Los elementos vac\u00EDos no est\u00E1n permitidos. 
XBCXU.S=El cifrado de una base de datos no cifrada ha sido err\u00F3neo\: {0}
43X34.U=posici\u00F3n de inicio
42Y16=No se ha encontrado ning\u00FAn m\u00E9todo est\u00E1tico p\u00FAblico ''{0}'' en la clase ''{1}''. Es posible que el m\u00E9todo exista, pero no es p\u00FAblico, o bien no es est\u00E1tico. 
43X52.U=ResultSet de exploraci\u00F3n hash para {0}
42Z33.U=tiempo del constructor (milisegundos) \=
42Y43=La escala ''{0}'' no es una escala v\u00E1lida con precisi\u00F3n de ''{1}''.
43X70.U=Unir
42X17=En la lista Properties de una cl\u00E1usula FROM, el valor ''{0}'' no es v\u00E1lido como especificaci\u00F3n joinOrder. S\u00F3lo son v\u00E1lidos los valores FIXED y UNFIXED.  
42Y70=El usuario ha especificado una orden de uni\u00F3n no v\u00E1lida. Esto podr\u00EDa estar causado porque se est\u00E1 pasando como par\u00E1metro una columna de uni\u00F3n desde una tabla interior a una tabla virtual externa.
42X44=Longitud ''{0}'' no v\u00E1lida en la especificaci\u00F3n de columna.
43Y06.U=Ordenar ResultSet
42X71=Tipo de dato no v\u00E1lido, ''{0}'', para la columna ''{1}''.
XBM0A.D=El directorio de base de datos ''{0}'' existe. Sin embargo, no contiene el archivo ''{1}''. Es posible que Derby haya ca\u00EDdo durante el proceso de creaci\u00F3n de esta base de datos. Quiz\u00E1 desee eliminar este directorio e intentar crear de nuevo la base de datos.
43Y24.U=Tiempo de an\u00E1lisis
XSLAR.D=No es posible copiar el archivo ''{0}'' como ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
42Y07=El esquema ''{0}'' no existe.
42Z60={0} no se permite a menos que la propiedad de base de datos {1} tenga el valor ''{2}''.
42Y34=El nombre de columna ''{0}'' coincide con m\u00E1s de una columna de resultado de la tabla ''{1}''.
43X07.U=n\u00FAmero de filas estimado por el optimizador\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y60.U=Except ResultSet
42Y61=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashMaxCapacity. El valor debe ser mayor que 0.
42X08=El constructor de la clase ''{0}'' no se puede utilizar como tabla virtual externa porque la clase no implementa ''{1}''. 
43X25.U=\u00EDndice
43X43.U=Clasificado
42X35=No est\u00E1 permitido que ambos operandos de ''{0}'' sean par\u00E1metros ?.
42Z42.U=ID de columna
42X62=''{0}'' no est\u00E1 permitido en el esquema ''{1}''.
43X61.U=Columnas accedidas desde heap
