#Thu May 16 17:55:33 BRT 2013
43Y16.U=ResultSet mit Sperrung f\u00FCr {0} aktualisieren
42Y26=Aggregate sind in der ''GROUP BY''-Liste nicht zul\u00E4ssig.
22001=Bei dem Versuch, {0} ''{1}'' auf die L\u00E4nge {2} zu k\u00FCrzen, ist ein Abschneidefehler aufgetreten.
43Y52.U=ResultSet f\u00FCr mehrstufiges L\u00F6schen mit
43X17.U=Gel\u00F6schte Zeilen
XBCXV.S=Die Verschl\u00FCsselung einer verschl\u00FCsselten Datenbank mit einem neuen Schl\u00FCssel oder einem neuen Kennwort ist gescheitert\: {0}
43X35.U=Endpunkt
42X54=Der Empf\u00E4nger der Java-Methode ''{0}'' ist ein ? Dies ist unzul\u00E4ssig.  Dies ist unzul\u00E4ssig.
42Z16=Die L\u00E4nge kann nur f\u00FCr Spalten des Typs VARCHAR, CLOB und BLOB ge\u00E4ndert werden. 
42Z34.U=Zeit f\u00FCr open (Millisekunden) \=
43X53.U=Der Hash-Schl\u00FCssel ist die Spaltennummer
42X81=Ein Abfrageausdruck muss mindestens eine Spalte zur\u00FCckgeben.
43X71.U=ResultSet der letzten Schl\u00FCsselindexsuche f\u00FCr {0} unter Verwendung von Index {1}
42Z70=Die direkte Bindung an einen XML-Wert ist nicht zul\u00E4ssig. Versuchen Sie, XMLPARSE zu verwenden.
42Y44=In der Merkmalliste einer FROM-Liste wurde der ung\u00FCltige Schl\u00FCssel ''{0}'' angegeben. Derzeit werden folgende Schl\u00FCssel unter Beachtung der Gro\u00DF-/Kleinschreibung unterst\u00FCtzt\: ''{1}'' 
43Y07.U=Duplikate eliminieren
42Y71=Die Systemfunktion oder Prozedur ''{0}'' kann nicht gel\u00F6scht werden.
42X45={0} ist ein ung\u00FCltiger Typ f\u00FCr das Argument {1} von {2}.
43Y25.U=Bindezeit
XSLAS.D=Bei der Wiederherstellung wurde das Protokollverzeichnis {0} nicht in der Sicherung gefunden. Vergewissern Sie sich, dass es sich um die richtige Sicherungskopie handelt und dass diese nicht besch\u00E4digt ist.
42X72=Es wurde kein statisches Feld ''{0}'', das zur Klasse ''{1}'' geh\u00F6rt, gefunden. M\u00F6glicherweise ist das Feld vorhanden, jedoch nicht \u00F6ffentlich und/oder statisch. Es kann auch sein, dass die Klasse nicht vorhanden oder nicht \u00F6ffentlich ist. 
42Z07=Aggregate sind in der ON-Klausel nicht erlaubt.
43X08.U=Vom Optimizer gesch\u00E4tzte Kosten\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Except
42Y08=F\u00FCr Systemtabellen sind Integrit\u00E4tsbedingungen f\u00FCr Fremdschl\u00FCssel unzul\u00E4ssig.
43X26.U=ResultSet der spezifischen Suche f\u00FCr {0}
40001=Eine Sperre konnte aufgrund eines Deadlock nicht angefordert werden. Zyklus der Sperren und beantragten Sperren\:\n{0}. Die ausgew\u00E4hlte Opfertransaktion ist XID \: {1}.
42Y35=Der Spaltenverweis ''{0}'' ist ung\u00FCltig. Wenn die SELECT-Liste mindestens ein Aggregat enth\u00E4lt, m\u00FCssen alle Eintr\u00E4ge g\u00FCltige Aggregatausdr\u00FCcke sein. 
43X44.U=Gruppiertes Aggregat
43X62.U=f\u00FCr {0}
42X09=Die Tabelle oder der Aliasname ''{0}'' wird in der FROM-Liste mehr als einmal verwendet.
42Z43.U=Operator
42Y62=''{0}'' ist f\u00FCr ''{1}'' nicht zul\u00E4ssig, weil es sich um eine Ansicht handelt.
42X36=F\u00FCr den Operator ''{0}'' darf kein ?- Parameter als Operand angegeben werden.
43X80.U=Gesehene Zeilen von rechts
42X63=Die USING-Klausel hat keine Ergebnisse geliefert. Es k\u00F6nnen keine Parameter gesetzt werden. 
42X90=F\u00FCr die Tabelle ''{0}'' wurde mehr als eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel angegeben.
42Z25=INTERNER FEHLER beim Identit\u00E4tsz\u00E4hler. UPDATE wurde ohne Argumente mit dem aktuellen Wert \= NULL aufgerufen.
