#Thu May 16 17:55:33 BRT 2013
43Y16.U=ResultSet de actualizaci\u00F3n mediante bloqueo {0}
42Y26=No se permiten agregados en la lista GROUP BY.
22001=Se ha producido un error de truncamiento al intentar recortar {0} ''{1}'' a una longitud {2}.
43Y52.U=Suprimir utilizaci\u00F3n de Cascade ResultSet
43X17.U=Filas suprimidas
XBCXV.S=El cifrado de una base de datos cifrada con una nueva clave o una nueva contrase\u00F1a ha sido err\u00F3neo\: {0}
43X35.U=posici\u00F3n de parada
42X54=m\u00E9todo Java ''{0}'' tiene un ? como receptor.  No est\u00E1 permitido.
42Z16=S\u00F3lo puede alterarse la longitud de las columnas VARCHAR, CLOB y BLOB. 
42Z34.U=tiempo de apertura (milisegundos) \=
43X53.U=Clave hash es el n\u00FAmero de columna
42X81=Una expresi\u00F3n de consulta debe devolver al menos una columna.
43X71.U=ResultSet de exploraci\u00F3n en \u00EDndice de \u00FAltima clave para {0} mediante \u00EDndice {1}
42Z70=La vinculaci\u00F3n directa a un valor XML no est\u00E1 permitida; intente utilizar XMLPARSE.
42Y44=Se ha especificado una clave ''{0}'' no v\u00E1lida en la lista Properties de una lista FROM. Las claves sensibles a may\u00FAsculas/min\u00FAsculas que se soportan actualmente son ''{1}''. 
43Y07.U=Eliminar duplicados
42Y71=La funci\u00F3n del sistema o el procedimiento ''{0}'' no se puede eliminar.
42X45={0} es un tipo no v\u00E1lido para el n\u00FAmero de argumento {1} de {2}.
43Y25.U=Tiempo de enlace
XSLAS.D=No se encontr\u00F3 el directorio de anotaciones cronol\u00F3gicas {0} al restaurar la copia de seguridad. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
42X72=No se ha encontrado ning\u00FAn campo est\u00E1tico ''{0}'' perteneciente a la clase ''{1}''.  El campo puede existir, pero no es p\u00FAblico y/o est\u00E1tico, o bien la clase no existe o \u00E9sta no es p\u00FAblica.  
42Z07=No se permiten agregados en la cl\u00E1usula ON.
43X08.U=coste estimado por el optimizador\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Except
42Y08=Las restricciones de clave for\u00E1nea no est\u00E1n permitidas en tablas del sistema.
43X26.U=ResultSet de exploraci\u00F3n distinct para {0}
40001=No se ha podido obtener un bloqueo debido a un punto muerto, el ciclo de bloqueos y esperas es\:\n{0}. La v\u00EDctima seleccionada es XID \: {1}.
42Y35=La referencia de columna ''{0}'' no es v\u00E1lida. Cuando la lista SELECT contiene al menos una agregaci\u00F3n entonces todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas.  
43X44.U=Agregado agrupado
43X62.U=para {0}
42X09=La tabla o nombre de alias ''{0}'' se utiliza m\u00E1s de una vez en la lista FROM.
42Z43.U=Operador
42Y62=''{0}'' no est\u00E1 permitido sobre ''{1}'' porque es una vista.
42X36=No est\u00E1 permitido que el operador ''{0}'' tome un par\u00E1metro ? como operando.
43X80.U=Filas vistas desde la derecha
42X63=La cl\u00E1usula USING no ha devuelto ning\u00FAn resultado. No se pueden establecer par\u00E1metros. 
42X90=Se ha especificado m\u00E1s de una restricci\u00F3n de clave primaria para la tabla ''{0}''.
42Z25=ERROR INTERNO de contador de identidad. Se ha llamado a la actualizaci\u00F3n sin argumentos con el valor actual \= NULL.
