#Thu May 16 17:55:33 BRT 2013
43Y16.U=Aktualizowanie interfejsu ResultSet za pomoc\u0105 blokowania typu {0}
42Y26=Dla listy GROUP BY agregaty nie s\u0105 dozwolone.
22001=Podczas pr\u00F3by zmniejszenia {0} ''{1}'' do d\u0142ugo\u015Bci {2} wyst\u0105pi\u0142 b\u0142\u0105d obcinania.
43Y52.U=Usu\u0144 kaskadowy interfejs ResultSet za pomoc\u0105
43X17.U=Usuni\u0119te wiersze
XBCXV.S=Szyfrowanie zaszyfrowanej bazy danych za pomoc\u0105 nowego klucza lub nowego has\u0142a nie powiod\u0142o si\u0119\: {0}
43X35.U=pozycja ko\u0144cowa
42X54=Metoda Java ''{0}'' ma ? jako odbiornik. To nie jest dozwolone.
42Z16=Zmiana d\u0142ugo\u015Bci mo\u017Cliwa jest tylko dla kolumn typu VARCHAR. 
42Z34.U=czas operacji open (milisekundy) \=
43X53.U=Klucz mieszaj\u0105cy jest numerem kolumny
43X71.U=Interfejs ResultSet dla ostatniego sekwencyjnego odczytu indeksu klucza dla {0} z u\u017Cyciem indeksu {1}
42Z70=Wi\u0105zanie bezpo\u015Brednio z warto\u015Bci\u0105 XML nie jest dozwolone. Spr\u00F3buj u\u017Cy\u0107 komendy XMLPARSE.
42Y44=Na li\u015Bcie w\u0142a\u015Bciwo\u015Bci listy FROM okre\u015Blono niepoprawny klucz ''{0}''. Aktualnie obs\u0142ugiwane klucze z rozr\u00F3\u017Cnianiem wielko\u015Bci liter to ''{1}''. 
43Y07.U=Eliminowanie duplikat\u00F3w
42Y71=Funkcja lub procedura systemowa ''{0}'' nie mo\u017Ce by\u0107 usuni\u0119ta.
42X45={0} ma niepoprawny typ dla argumentu numer {1} z {2}.
43Y25.U=Czas wi\u0105zania
XSLAS.D=Podczas odtwarzania w kopii zapasowej nie znaleziono katalogu dziennika {0}. Upewnij si\u0119, \u017Ce kopia zapasowa jest poprawna i nie jest uszkodzona.
42X72=Nie znaleziono pola statycznego ''{0}'' nale\u017C\u0105cego do klasy ''{1}''. Pole mo\u017Ce istnie\u0107, ale nie jest publiczne i/lub statyczne, albo klasa nie istnieje lub nie jest publiczna. 
42Z07=W klauzuli ON agregaty nie s\u0105 dozwolone.
43X08.U=koszt oszacowany przez optymalizator\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Wy\u0142\u0105czenie
42Y08=Regu\u0142y ograniczaj\u0105ce klucz obcy nie s\u0105 dozwolone dla tabel systemowych.
43X26.U=Interfejs ResultSet dla skanowania odr\u0119bnego dla {0}
40001=Nie mo\u017Cna uzyska\u0107 blokady z powodu zakleszczenia, cykl blokad i oczekiwa\u0144\:\n{0}. Wybrana ofiara to XID\: {1}.
42Y35=Odwo\u0142anie ''{0}'' do kolumny jest niepoprawne. Gdy lista SELECT zawiera przynajmniej jedn\u0105 agregacj\u0119, wszystkie pozycje musz\u0105 by\u0107 poprawnymi wyra\u017Ceniami agreguj\u0105cymi. 
43X44.U=Agregat zgrupowany
43X62.U=dla {0}
42X09=Tabela lub alias ''{0}'' jest wykorzystywany wi\u0119cej ni\u017C jeden raz na li\u015Bcie FROM.
42Z43.U=Operator
42Y62=Operacja ''{0}'' nie jest dozwolona na obiekcie ''{1}'', poniewa\u017C jest to widok.
42X36=Operator ''{0}'' nie mo\u017Ce pobiera\u0107 parametru ? jako operandu.
43X80.U=Wiersze widoczne z prawej
42X63=Klauzula USING nie zwr\u00F3ci\u0142a \u017Cadnych wynik\u00F3w. Nie mo\u017Cna ustawi\u0107 \u017Cadnych parametr\u00F3w. 
42X90=Dla tabeli ''{0}'' okre\u015Blona jest wi\u0119cej ni\u017C jedna regu\u0142a ograniczaj\u0105ca klucza podstawowego.
42Z25=B\u0141\u0104D WEWN\u0118TRZNY licznika to\u017Csamo\u015Bci. Aktualizacja zosta\u0142a wywo\u0142ana bez argument\u00F3w z warto\u015Bci\u0105 bie\u017C\u0105c\u0105 \= NULL.
