#Thu May 16 17:55:33 BRT 2013
43Y16.U=Aktualizovat rozhran\u00ED ResultSet pomoc\u00ED uzam\u010Den\u00ED {0}
42Y26=Seskupen\u00ED nejsou v seznamu GROUP BY povolena.
22001=Byla zji\u0161t\u011Bna chyba oseknut\u00ED p\u0159i pokusu o zmen\u0161en\u00ED {0} ''{1}'' na d\u00E9lku {2}.
43Y52.U=Vymazat rozhran\u00ED ResultSet kask\u00E1dy pomoc\u00ED
43X17.U=Vymazan\u00E9 \u0159\u00E1dky
XBCXV.S=Selhalo \u0161ifrov\u00E1n\u00ED \u0161ifrovan\u00E9 datab\u00E1ze s nov\u00FDm kl\u00ED\u010Dem nebo nov\u00FDm heslem\: {0}
43X35.U=pozice ukon\u010Den\u00ED
42X54=Metoda Javy ''{0}'' obsahuje ? jako p\u0159\u00EDjemce. Takov\u00FD p\u0159\u00EDpad nen\u00ED povolen.
42Z16=D\u00E9lku sloupc\u016F lze pozm\u011B\u0148ovat pouze u sloupc\u016F typu VARCHAR. 
42Z34.U=\u010Das otev\u0159en\u00ED (milisekundy) \=
43X53.U=Transforma\u010Dn\u00EDm kl\u00ED\u010Dem je \u010D\u00EDslo sloupce
43X71.U=Rozhran\u00ED ResultSet posledn\u00EDho skenov\u00E1n\u00ED indexu kl\u00ED\u010De pro tabulku {0} pomoc\u00ED indexu {1}
42Z70=Vazba p\u0159\u00EDmo k hodnot\u011B XML nen\u00ED povolena; zkuste pou\u017E\u00EDt XMLPARSE.
42Y44=Byl uveden neplatn\u00FD kl\u00ED\u010D ''{0}'' v seznamu Vlastnosti seznamu FROM. Kl\u00ED\u010De rozli\u0161uj\u00EDc\u00ED velikost p\u00EDsmen, kter\u00E9 jsou moment\u00E1ln\u011B podporov\u00E1ny, jsou ''{1}''. 
43Y07.U=Eliminovat duplik\u00E1ty
42Y71=Syst\u00E9movou funkci nebo proceduru ''{0}'' nelze uvolnit.
42X45={0} je neplatn\u00FD typ pro \u010D\u00EDslo argumentu {1} z {2}.
43Y25.U=\u010Cas vazby
XSLAS.D=Adres\u00E1\u0159 protokolu {0} nebyl nalezen v z\u00E1loze b\u011Bhem obnovy. Ujist\u011Bte se, \u017Ee se jedn\u00E1 o spr\u00E1vnou z\u00E1lo\u017En\u00ED kopii a \u017Ee nen\u00ED poru\u0161ena.
42X72=Nebylo nalezeno \u017E\u00E1dn\u00E9 statick\u00E9 pole ''{0}'' pat\u0159\u00EDc\u00ED t\u0159\u00EDd\u011B ''{1}''. Pole m\u016F\u017Ee existovat, ale nen\u00ED ve\u0159ejn\u00E9 a/nebo statick\u00E9, nebo t\u0159\u00EDda neexistuje nebo nen\u00ED ve\u0159ejn\u00E1. 
42Z07=Seskupen\u00E9 v\u00FDrazy nejsou povoleny v klauzuli ON.
43X08.U=n\u00E1klady odhadnut\u00E9 optimaliz\u00E1torem\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Vylou\u010Den\u00ED
42Y08=Omezen\u00ED ciz\u00EDho kl\u00ED\u010De nejsou povolena v syst\u00E9mov\u00FDch tabulk\u00E1ch.
43X26.U=Rozhran\u00ED ResultSet odli\u0161n\u00E9ho skenov\u00E1n\u00ED pro {0}
40001=Uzam\u010Den\u00ED nebylo z\u00EDsk\u00E1no kv\u016Fli uv\u00E1znut\u00ED; cyklus uzam\u010Den\u00ED a \u010Dekaj\u00EDc\u00EDch je\:\n{0}. Vybran\u00E1 ob\u011B\u0165 je XID\: {1}.
42Y35=Odkaz na sloupec ''{0}'' je neplatn\u00FD. Kdy\u017E seznam SELECT obsahuje alespo\u0148 jeden seskupen\u00FD v\u00FDraz, v\u0161echny z\u00E1znamy musej\u00ED b\u00FDt platn\u00FDmi seskupen\u00FDmi v\u00FDrazy. 
43X44.U=Seskupen\u00FD v\u00FDraz skupiny
43X62.U=pro tabulku {0}
42X09=Jm\u00E9no tabulky nebo aliasu ''{0}'' je pou\u017Eito v\u00EDce ne\u017E jednou v seznamu FROM.
42Z43.U=Oper\u00E1tor
42Y62=''{0}'' nen\u00ED povoleno v ''{1}'', proto\u017Ee se jedn\u00E1 o pohled.
42X36=Oper\u00E1tor ''{0}'' nesm\u00ED m\u00EDt parametr ? jako operand.
43X80.U=\u0158\u00E1dky vid\u011Bn\u00E9 zprava
42X63=Klauzule USING nevr\u00E1tila \u017E\u00E1dn\u00E9 v\u00FDsledky. Nelze nastavit \u017E\u00E1dn\u00E9 parametry. 
42X90=Bylo uvedeno v\u00EDce ne\u017E jedno omezen\u00ED prim\u00E1rn\u00EDho kl\u00ED\u010De pro tabulku ''{0}''.
42Z25=Po\u010Ditadlo toto\u017Enosti VNIT\u0158N\u00CD CHYBY. Byla vol\u00E1na aktualizace bez argument\u016F s aktu\u00E1ln\u00ED hodnotou \= NULL.
