#Thu May 16 17:55:33 BRT 2013
43Y16.U={0} \uC7A0\uAE08\uC744 \uC0AC\uC6A9\uD55C ResultSet \uAC31\uC2E0
42Y26=GROUP BY \uBAA9\uB85D\uC5D0 \uCD1D\uACC4\uAC00 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
22001={0} ''{1}''\uC744(\uB97C) {2} \uAE38\uC774\uB85C \uB2E8\uCD95\uD558\uB824\uB294 \uC911\uC5D0 \uC808\uB2E8 \uC624\uB958\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
43Y52.U=\uACC4\uB2E8\uC2DD ResultSet \uC0AD\uC81C \uC0AC\uC6A9
43X17.U=\uC0AD\uC81C\uB41C \uD589
XBCXV.S=\uC554\uD638\uD654\uB41C \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uC0C8 \uD0A4 \uB610\uB294 \uC0C8 \uC554\uD638\uB85C \uC554\uD638\uD654\uD558\uB294 \uB370 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4. {0}
43X35.U=\uC911\uC9C0 \uC704\uCE58
42X54=Java \uBA54\uC18C\uB4DC ''{0}''\uC5D0 ?\uAC00 \uC218\uC2E0\uC790\uB85C \uC788\uC2B5\uB2C8\uB2E4.  \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
42Z16=VARCHAR, CLOB \uBC0F BLOB \uC720\uD615\uC758 \uC5F4\uB9CC\uC774 \uAE38\uC774\uAC00 \uBCC0\uACBD\uB418\uC5C8\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4. 
42Z34.U=\uC5EC\uB294 \uC2DC\uAC04(\uBC00\uB9AC\uCD08) \=
43X53.U=\uD574\uC2DC \uD0A4\uB294 \uC5F4 \uBC88\uD638\uC785\uB2C8\uB2E4.
42X81=\uCFFC\uB9AC \uD45C\uD604\uC2DD\uC740 \uD558\uB098 \uC774\uC0C1\uC758 \uC5F4\uC744 \uBC18\uD658\uD574\uC57C \uD569\uB2C8\uB2E4.
43X71.U={1} \uC0C9\uC778\uC744 \uC0AC\uC6A9\uD55C {0}\uC5D0 \uB300\uD55C \uB9C8\uC9C0\uB9C9 \uD0A4 \uC0C9\uC778 \uC2A4\uCE94 ResultSet
42Z70=XML \uAC12\uC5D0 \uC9C1\uC811 \uBC14\uC778\uB529\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. XMLPARSE\uB97C \uC0AC\uC6A9\uD558\uB3C4\uB85D \uD558\uC2ED\uC2DC\uC624.
42Y44=FROM \uBAA9\uB85D\uC758 \uB4F1\uB85D \uC815\uBCF4 \uBAA9\uB85D\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 ''{0}'' \uD0A4\uAC00 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4. \uD604\uC7AC \uC9C0\uC6D0\uB418\uB294 \uB300\uC18C\uBB38\uC790 \uAD6C\uBD84 \uD0A4\uB294 ''{1}''\uC785\uB2C8\uB2E4. 
43Y07.U=\uC911\uBCF5 \uC81C\uAC70
42Y71=''{0}'' \uC2DC\uC2A4\uD15C \uD568\uC218 \uB610\uB294 \uD504\uB85C\uC2DC\uC800\uB97C \uC0AD\uC81C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
42X45={0}\uC740(\uB294) {2}\uC758 \uC778\uC218 \uBC88\uD638 {1}\uC5D0 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC740 \uC720\uD615\uC785\uB2C8\uB2E4.
43Y25.U=\uBC14\uC778\uB4DC \uC2DC\uAC04
XSLAS.D=\uBCF5\uC6D0 \uC911 \uBC31\uC5C5\uC5D0\uC11C {0} \uB85C\uADF8 \uB514\uB809\uD1A0\uB9AC\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uBC31\uC5C5 \uC0AC\uBCF8\uC774 \uC62C\uBC14\uB974\uBA70 \uC190\uC0C1\uB418\uC9C0 \uC54A\uC558\uB294\uC9C0\uB97C \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
42X72=''{1}'' \uD074\uB798\uC2A4\uC5D0 \uC18D\uD55C ''{0}'' \uC815\uC801 \uD544\uB4DC\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uD544\uB4DC\uAC00 \uC788\uC744 \uC218 \uC788\uC73C\uB098 \uACF5\uC6A9 \uBC0F/\uB610\uB294 \uC815\uC801\uC774 \uC544\uB2C8\uAC70\uB098 \uD074\uB798\uC2A4\uAC00 \uC5C6\uAC70\uB098 \uD074\uB798\uC2A4\uAC00 \uACF5\uC6A9\uC774 \uC544\uB2D9\uB2C8\uB2E4. 
42Z07=\uC9D1\uD569\uC740 ON\uC808\uC5D0\uC11C \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
43X08.U=\uCD5C\uC801\uD654 \uD504\uB85C\uADF8\uB7A8 \uC608\uC0C1 \uBE44\uC6A9\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Except
42Y08=\uC678\uBD80 \uD0A4 \uC81C\uD55C\uC870\uAC74\uC740 \uC2DC\uC2A4\uD15C \uD14C\uC774\uBE14\uC5D0\uC11C \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
43X26.U={0}\uC5D0 \uB300\uD55C \uAD6C\uBCC4 \uC2A4\uCE94 ResultSet
40001=\uAD50\uCC29 \uC0C1\uD0DC\uB85C \uC778\uD574 \uC7A0\uAE08\uC744 \uD655\uBCF4\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uC7A0\uAE08 \uBC0F \uB300\uAE30\uC790 \uC8FC\uAE30\:\n{0}. \uC120\uD0DD\uB41C \uB300\uC0C1\uC740 XID \: {1}\uC785\uB2C8\uB2E4.
42Y35=''{0}'' \uC5F4 \uCC38\uC870\uAC00 \uC720\uD6A8\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. SELECT \uBAA9\uB85D\uC5D0 \uCD5C\uC18C\uD55C \uD558\uB098\uC758 \uC9D1\uD569\uC774 \uB4E4\uC5B4 \uC788\uC73C\uBA74, \uBAA8\uB4E0 \uD56D\uBAA9\uC740 \uC720\uD6A8\uD55C \uC9D1\uD569 \uD45C\uD604\uC2DD\uC774\uC5B4\uC57C \uD569\uB2C8\uB2E4. 
43X44.U=\uADF8\uB8F9\uD654\uB41C \uC9D1\uD569
43X62.U={0}\uC5D0 \uB300\uD55C
42X09=''{0}'' \uD14C\uC774\uBE14 \uB610\uB294 \uBCC4\uBA85\uC774 FROM \uBAA9\uB85D\uC5D0\uC11C \uB450 \uBC88 \uC774\uC0C1 \uC0AC\uC6A9\uB429\uB2C8\uB2E4.
42Z43.U=\uC6B4\uC601\uC790
42Y62=''{0}''\uC774(\uAC00) \uBDF0\uC774\uBBC0\uB85C ''{1}''\uC5D0\uC11C \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
42X36=''{0}'' \uC5F0\uC0B0\uC790\uC5D0\uC11C ? \uB9E4\uAC1C\uBCC0\uC218\uB97C \uD53C\uC5F0\uC0B0\uC790\uB85C \uAC00\uC838\uC62C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
43X80.U=\uC624\uB978\uCABD\uC5D0\uC11C \uBCF4\uC774\uB294 \uD589
42X63=USING\uC808\uC774 \uACB0\uACFC\uB97C \uB9AC\uD134\uD558\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4. \uB9E4\uAC1C\uBCC0\uC218\uB97C \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. 
42X90=''{0}'' \uD14C\uC774\uBE14\uC5D0 \uB300\uD574 \uB458 \uC774\uC0C1\uC758 1\uCC28 \uD0A4 \uC81C\uD55C\uC870\uAC74\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
42Z25=\uB0B4\uBD80 \uC624\uB958 ID \uCE74\uC6B4\uD130. \uD604\uC7AC \uAC12\uC774 \uB110\uC77C \uB54C \uC778\uC218 \uC5C6\uC774 \uAC31\uC2E0\uC744 \uD638\uCD9C\uD588\uC2B5\uB2C8\uB2E4.
