#Thu May 16 17:55:33 BRT 2013
43Y16.U=\u041E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0438 {0}
42Y26=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 GROUP BY \u0430\u0433\u0440\u0435\u0433\u0430\u0442\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
22001=\u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u0443\u0441\u0435\u0447\u0435\u043D\u0438\u044F \u043F\u0440\u0438 \u043F\u043E\u043F\u044B\u0442\u043A\u0435 \u0441\u043E\u043A\u0440\u0430\u0442\u0438\u0442\u044C {0} ''{1}'' \u0434\u043E \u0434\u043B\u0438\u043D\u044B, \u0440\u0430\u0432\u043D\u043E\u0439 {2}.
43Y52.U=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u043A\u0430\u0441\u043A\u0430\u0434\u043D\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C
43X17.U=\u0423\u0434\u0430\u043B\u0435\u043D\u043E \u0441\u0442\u0440\u043E\u043A
XBCXV.S=\u0428\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u043E\u0432\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0438\u043B\u0438 \u043D\u043E\u0432\u043E\u0433\u043E \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u043E\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E\: {0}
43X35.U=\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0430
42X54=\u0423 \u043C\u0435\u0442\u043E\u0434\u0430 Java ''{0}'' \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 ? \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A\u0430.  \u042D\u0442\u043E \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F.
42Z16=\u0414\u043B\u0438\u043D\u0443 \u043C\u043E\u0436\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u044F\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0442\u0438\u043F\u0430 VARCHAR. 
42Z34.U=\u0432\u0440\u0435\u043C\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u0438\u044F (\u043C\u0441\u0435\u043A) \=
43X53.U=\u041A\u043B\u044E\u0447 \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F - \u043D\u043E\u043C\u0435\u0440 \u0441\u0442\u043E\u043B\u0431\u0446\u0430
43X71.U=ResultSet - \u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0434\u043B\u044F {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0438\u043D\u0434\u0435\u043A\u0441\u0430 {1}
42Z70=\u0421\u0432\u044F\u0437\u044B\u0432\u0430\u043D\u0438\u0435 \u043D\u0435\u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u0441\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C XML \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F; \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C XMLPARSE.
42Y44=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 Properties \u0441\u043F\u0438\u0441\u043A\u0430 FROM \u0443\u043A\u0430\u0437\u0430\u043D \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u043A\u043B\u044E\u0447 ''{0}''. \u0412 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u043A\u043B\u044E\u0447\u0438, \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0443\u0447\u0438\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\: ''{1}''. 
43Y07.U=\u0423\u0441\u0442\u0440\u0430\u043D\u044F\u0442\u044C \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442\u044B
42Y71=\u0421\u0438\u0441\u0442\u0435\u043C\u043D\u0443\u044E \u0444\u0443\u043D\u043A\u0446\u0438\u044E \u0438\u043B\u0438 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u0443 ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C.
42X45={0} \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0442\u0438\u043F\u043E\u043C \u0434\u043B\u044F \u043D\u043E\u043C\u0435\u0440 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430 {1} \u0438\u0437 {2}.
43Y25.U=\u0412\u0440\u0435\u043C\u044F \u0441\u0432\u044F\u0437\u044B\u0432\u0430\u043D\u0438\u044F
XSLAS.D=\u0412\u043E \u0432\u0440\u0435\u043C\u044F \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u0432 \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u043E\u0439 \u043A\u043E\u043F\u0438\u0438 \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 {0}. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u044D\u0442\u043E \u043D\u0443\u0436\u043D\u0430\u044F \u0440\u0435\u0437\u0435\u0440\u0432\u043D\u0430\u044F \u043A\u043E\u043F\u0438\u044F \u0438 \u0447\u0442\u043E \u043E\u043D\u0430 \u043D\u0435 \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D\u0430.
42X72=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u043E\u043B\u044F ''{0}'', \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0431\u044B \u043F\u0440\u0438\u043D\u0430\u0434\u043B\u0435\u0436\u0430\u043B\u043E \u043A \u043A\u043B\u0430\u0441\u0441\u0443 ''{1}''.  \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u043F\u043E\u043B\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u043D\u043E \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C \u0438/\u0438\u043B\u0438 \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u043C, \u043B\u0438\u0431\u043E \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u043B\u0438\u0431\u043E \u043A\u043B\u0430\u0441\u0441 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C.  
42Z07=\u0412 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 ON \u0430\u0433\u0440\u0435\u0433\u0430\u0442\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
43X08.U=\u0437\u0430\u0442\u0440\u0430\u0442\u044B \u043F\u043E \u043E\u0446\u0435\u043D\u043A\u0435 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Except
42Y08=\u0414\u043B\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u044B\u0445 \u0442\u0430\u0431\u043B\u0438\u0446 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
43X26.U=ResultSet - \u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u043E \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u0434\u043B\u044F {0}
40001=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0443 \u0438\u0437-\u0437\u0430 \u0442\u0443\u043F\u0438\u043A\u043E\u0432\u043E\u0439 \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u0438; \u0446\u0438\u043A\u043B \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043E\u043A \u0438 \u043E\u0436\u0438\u0434\u0430\u043D\u0438\u0439\:\n{0}. XID \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430, \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u043E\u0433\u043E \u043C\u0435\u0445\u0430\u043D\u0438\u0437\u043C\u043E\u043C \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043B\u044F \u0430\u043D\u043D\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F\: {1}.
42Y35=\u0421\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439. \u0415\u0441\u043B\u0438 \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 SELECT \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u0445\u043E\u0442\u044F \u0431\u044B \u043E\u0434\u0438\u043D \u0430\u0433\u0440\u0435\u0433\u0430\u0442, \u0442\u043E \u0432\u0441\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0446\u0438\u0438.  
43X44.U=\u0421\u0433\u0440\u0443\u043F\u043F\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0430\u0433\u0440\u0435\u0433\u0430\u0442
43X62.U=\u0434\u043B\u044F {0}
42X09=\u0418\u043C\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0438\u043B\u0438 \u0430\u043B\u0438\u0430\u0441 ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 FROM \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430.
42Z43.U=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440
42Y62=''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F ''{1}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440.
42X36=\u041E\u043F\u0435\u0440\u0430\u043D\u0434 ''{0}'' \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0442\u044C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 ? \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043E\u043F\u0435\u0440\u0430\u043D\u0434\u0430.
43X80.U=\u0412\u0438\u0434\u0438\u043C\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438 \u0441\u043F\u0440\u0430\u0432\u0430
42X63=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F USING \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u043B\u0430 \u043D\u0438\u043A\u0430\u043A\u0438\u0445 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432. \u041D\u0438\u043A\u0430\u043A\u0438\u0445 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432 \u0437\u0430\u0434\u0430\u0442\u044C \u043D\u0435\u043B\u044C\u0437\u044F. 
42X90=\u0414\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u0437\u0430\u0434\u0430\u043D\u043E \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0433\u043B\u0430\u0432\u043D\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430.
42Z25=\u0412\u041D\u0423\u0422\u0420\u0415\u041D\u041D\u042F\u042F \u041E\u0428\u0418\u0411\u041A\u0410 - \u0441\u0447\u0435\u0442\u0447\u0438\u043A \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u0432. \u0412\u044B\u0437\u0432\u0430\u043D\u043E \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0435 \u0431\u0435\u0437 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u043E\u0432 \u0432 \u0441\u043E\u0447\u0435\u0442\u0430\u043D\u0438\u0438 \u0441 \u0442\u0435\u043A\u0443\u0449\u0438\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \= NULL.
