#Thu May 16 17:55:33 BRT 2013
43Y16.U=Atualizar ResultSet utilizando o bloqueio {0}
22001=Foi encontrado um erro de truncamento ao tentar reduzir {0} ''{1}'' para o comprimento {2}.
43Y52.U=ResultSet de exclus\u00E3o em cascata utilizando
43X17.U=Linhas exclu\u00EDdas
XBCXV.S=A criptografia de um banco de dados criptografado com uma nova chave ou senha falhou\: {0}
43X35.U=posi\u00E7\u00E3o de parada
42X54=O m\u00E9todo Java ''{0}'' possui como receptor ?.  Isto n\u00E3o \u00E9 permitido.
42Z16=Somente as colunas do tipo VARCHAR podem ter seus comprimentos alterados.
42Z34.U=tempo para abrir (milissegundos)     \=
43X53.U=A chave de ''hash'' \u00E9 o n\u00FAmero da coluna
43X71.U=ResultSet de Varredura de \u00CDndice de Chaves Mais Recente para {0} utilizando o \u00EDndice {1}
42Z70=A liga\u00E7\u00E3o direta ao valor XML n\u00E3o \u00E9 permito, tente utilizando XMLPARSE.
42Y44=Chave inv\u00E1lida ''{0}'' especificada na lista Propriedades da lista FROM. As chaves que fazem distin\u00E7\u00E3o entre mai\u00FAsculas e min\u00FAsculas suportadas atualmente s\u00E3o ''{1}''.
43Y07.U=Eliminar duplicadas
42Y71=A fun\u00E7\u00E3o ou procedimento de sistema ''{0}'' n\u00E3o pode ser removida.
42X45={0} n\u00E3o \u00E9 um tipo v\u00E1lido para o argumento n\u00FAmero {1} de {2}.
43Y25.U=Tempo de liga\u00E7\u00E3o
XSLAS.D=N\u00E3o foi encontrado o diret\u00F3rio de log {0} no backup durante a restaura\u00E7\u00E3o. Certifique-se que a c\u00F3pia de backup \u00E9 a c\u00F3pia correta, e que n\u00E3o est\u00E1 corrompida.
42X72=N\u00E3o foi localizado um campo est\u00E1tico ''{0}'' pertencente \u00E0 classe ''{1}''.  O campo pode existir, mas n\u00E3o \u00E9 p\u00FAblico e/ou est\u00E1tico ou a classe n\u00E3o existe ou n\u00E3o \u00E9 p\u00FAblica.
42Z07=N\u00E3o s\u00E3o permitidas agrega\u00E7\u00F5es na cl\u00E1usula ON.
43X08.U=custo estimado pelo otimizador\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Exce\u00E7\u00E3o
42Y08=N\u00E3o s\u00E3o permitidas restri\u00E7\u00F5es de chave estrangeira nas tabelas do sistema.
43X26.U=ResultSet de varredura distinta para {0}
40001=N\u00E3o foi poss\u00EDvel obter o bloqueio devido a um impasse, o ciclo de bloqueios e aguardos \u00E9\:\n{0}. A v\u00EDtima selecionada foi XID\: {1}.
42Y35=A refer\u00EAncia de coluna ''{0}'' n\u00E3o \u00E9 v\u00E1lida. Quando a lista SELECT cont\u00E9m pelo menos uma agrega\u00E7\u00E3o, todas as entradas dever\u00E3o ser express\u00F5es de agrega\u00E7\u00E3o v\u00E1lidas.
43X44.U=Agrega\u00E7\u00E3o agrupada
43X62.U=para {0}
42X09=O nome de tabela ou ali\u00E1s ''{0}'' \u00E9 utilizado mais de uma vez na lista da cl\u00E1usula FROM.
42Z43.U=Operador
42Y62=''{0}'' n\u00E3o \u00E9 permitido em ''{1}'', porque ''{1}'' \u00E9 uma vis\u00E3o.
42X36=N\u00E3o \u00E9 permitido que operador ''{0}'' receba um par\u00E2metro ? como operando.
43X80.U=Linhas vistas da direita
42X63=A cl\u00E1usula USING n\u00E3o retornou nenhum resultado. Nenhum par\u00E2metro pode ser definido.
42X90=Foi especificada mais de uma restri\u00E7\u00E3o de chave prim\u00E1ria para a tabela ''{0}''.
42Z25=ERRO INTERNO contador de identidade. Foi chamada uma atualiza\u00E7\u00E3o sem argumentos com valor corrente igual a NULL.
