#Thu May 16 17:55:33 BRT 2013
43Y16.U=ResultSet friss\u00EDt\u00E9se {0} z\u00E1rol\u00E1ssal
42Y26=\u00D6sszes\u00EDt\u00E9sek a GROUP BY list\u00E1ban nem megengedettek.
22001=Csonk\u00EDt\u00E1si hiba t\u00F6rt\u00E9nt a(z) {0} ''{1}'' {2} hossz\u00FAs\u00E1g\u00FAra \u00F6sszeh\u00FAz\u00E1s\u00E1ra tett k\u00EDs\u00E9rlet sor\u00E1n.
43Y52.U=L\u00E9pcs\u0151s ResultSet t\u00F6rl\u00E9se
43X17.U=T\u00F6r\u00F6lt sorok
XBCXV.S=A titkos\u00EDtott adatb\u00E1zis \u00FAj kulccsal \u00E9s \u00FAj jelsz\u00F3val val\u00F3 titkos\u00EDt\u00E1sa meghi\u00FAsult\: {0}
43X35.U=befejez\u0151 poz\u00EDci\u00F3
42X54=A(z) ''{0}'' Java met\u00F3dus ? vev\u0151vel rendelkezik.  Ez nem enged\u00E9lyezett.
42Z16=Csak VARCHAR t\u00EDpus\u00FA oszlopok hossza v\u00E1ltoztathat\u00F3. 
42Z34.U=megnyit\u00E1si id\u0151pont (ezredm\u00E1sodperc) \=
43X53.U=A kivonatkulcs egy oszlopsz\u00E1m
43X71.U=Utols\u00F3 kulcsindex-keres\u00E9si ResultSet a(z) {0} t\u00E1bl\u00E1hoz {1} index seg\u00EDts\u00E9g\u00E9vel
42Z70=K\u00F6zvetlen\u00FCl XML \u00E9rt\u00E9kre lek\u00E9pez\u00E9s nem megengedett; pr\u00F3b\u00E1lja az XMLPARSE haszn\u00E1lat\u00E1t.
42Y44=A FROM lista tulajdons\u00E1gok list\u00E1j\u00E1ban ''{0}'' \u00E9rv\u00E9nytelen kulcs lett megadva. A jelenleg t\u00E1mogatott kis- \u00E9s nagybet\u0171t megk\u00FCl\u00F6nb\u00F6ztet\u0151 kulcsok\: ''{1}''. 
43Y07.U=T\u00F6bbsz\u00F6r\u00F6s elemek megsz\u00FCntet\u00E9se
42Y71=A(z) ''{0}'' rendszerf\u00FCggv\u00E9ny vagy elj\u00E1r\u00E1s nem sz\u00FCntethet\u0151 meg.
42X45={0} \u00E9rv\u00E9nytelen t\u00EDpus a(z) {1}/{2} argumentumsz\u00E1mhoz.
43Y25.U=K\u00F6t\u00E9si id\u0151
XSLAS.D=A(z) {0} napl\u00F3k\u00F6nyvt\u00E1r nem tal\u00E1lhat\u00F3 a ment\u00E9sben a vissza\u00E1ll\u00EDt\u00E1s sor\u00E1n. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a biztons\u00E1gi m\u00E1solat megfelel\u0151 \u00E9s nem s\u00E9r\u00FClt.
42X72=Nem tal\u00E1lhat\u00F3 a(z) ''{1}'' oszt\u00E1lyhoz tartoz\u00F3 ''{0}'' statikus mez\u0151.  Elk\u00E9pzelhet\u0151, hogy a mez\u0151 l\u00E9tezik de nem nyilv\u00E1nos \u00E9s/vagy statikus, vagy az oszt\u00E1ly nem l\u00E9tezik illetve nem nyilv\u00E1nos.  
42Z07=Az \u00F6sszes\u00EDt az ON r\u00E9szkifejez\u00E9sben nem t\u00E1mogatott.
43X08.U=optimaliz\u00E1l\u00F3 becs\u00FClt k\u00F6lts\u00E9g\: {0,number,\#\#\#\#\#\#\#\#\#\#\#0.00}
43Y61.U=Kiv\u00E9tel
42Y08=Az idegen kulcs megszor\u00EDt\u00E1sok rendszert\u00E1bl\u00E1kon nem megengedettek.
43X26.U={0} elemhez tartoz\u00F3 k\u00FCl\u00F6nb\u00F6z\u0151 keres\u00E9s ResultSet
40001=Holtpont miatt nem foganatos\u00EDthat\u00F3 z\u00E1rol\u00E1s, a z\u00E1rak \u00E9s v\u00E1rakoz\u00F3k ciklusa\: \n {0}. A kijel\u00F6lt \u00E1ldozat XID azonos\u00EDt\u00F3ja\: {1}.
42Y35=A(z) ''{0}'' oszlophivatkoz\u00E1s \u00E9rv\u00E9nytelen. Ha a SELECT lista legal\u00E1bb egy \u00F6sszes\u00EDt\u00E9st tartalmaz, akkor minden bejegyz\u00E9snek \u00E9rv\u00E9nyes \u00F6sszes\u00EDt\u0151 kifejez\u00E9snek kell lennie.  
43X44.U=Csoportos\u00EDtott \u00F6sszes\u00EDt\u00E9s
43X62.U={0} t\u00E1bl\u00E1hoz
42X09=A(z) ''{0}'' t\u00E1bla vagy \u00E1ln\u00E9v a FROM list\u00E1ban t\u00F6bbsz\u00F6r szerepel.
42Z43.U=M\u0171veleti jel
42Y62=A(z) ''{0}'' a(z) ''{1}'' elemen nem megengedett, mivel az egy n\u00E9zet.
42X36=A(z) ''{0}'' oper\u00E1tor operandusk\u00E9nt nem haszn\u00E1lhat ? param\u00E9tert.
43X80.U=Megjelen\u00EDtett oszlopok jobbr\u00F3l
42X63=A USING r\u00E9szkifejez\u00E9s nem ad vissza eredm\u00E9nyt. Nem \u00E1ll\u00EDthat\u00F3k be param\u00E9terek. 
42X90=A(z) ''{0}'' t\u00E1bl\u00E1hoz t\u00F6bb els\u0151dleges kulcs megszor\u00EDt\u00E1s van megadva.
42Z25=INTERNAL ERROR azonoss\u00E1gsz\u00E1ml\u00E1l\u00F3. Friss\u00EDt\u00E9s ker\u00FClt megh\u00EDv\u00E1sra argumentumok n\u00E9lk\u00FCl \= NULL aktu\u00E1lis \u00E9rt\u00E9kkel.
