#Thu May 16 17:55:33 BRT 2013
43Y53.U=A\u00E7\u00F5es referenciais em tabelas dependentes
42Z53=ERRO INTERNO\: N\u00E3o se sabe qual o tipo de ativa\u00E7\u00E3o a ser gerada para o n\u00F3 escolhido {0}.
42Y27=N\u00E3o s\u00E3o permitidos par\u00E2metros na a\u00E7\u00E3o de gatilho.
43X18.U=\u00CDndices atualizados
43X36.U=qualificadores da varredura
43X54.U=As chaves de ''hash'' s\u00E3o os n\u00FAmeros das colunas
42Z35.U=tempo para o pr\u00F3ximo (milissegundos) \=
42X28=A tabela de exclus\u00E3o ''{0}'' n\u00E3o \u00E9 destino do cursor ''{1}''.
43X72.U=no n\u00EDvel de isolamento {0} utilizando o bloqueio {1} escolhido pelo otimizador
42X55=O nome de tabela ''{1}'' deve ser o mesmo que ''{0}''.
42Z17=Comprimento inv\u00E1lido especificado para a coluna ''{0}''. O comprimento deve ser maior que o comprimento corrente da coluna.
43X90.U=ResultSet de jun\u00E7\u00E3o externa esquerda por la\u00E7o aninhado
42X82=A cl\u00E1usula USING retornou mais de uma linha. S\u00E3o permitidos apenas ResultSets de uma \u00FAnica linha.
42Z71=Os valores XML n\u00E3o s\u00E3o permitidos nos conjuntos de resultado de primeiro n\u00EDvel; tente utilizando XMLSERIALIZE.
43Y08.U=Classificar
42Y45=N\u00E3o \u00E9 poss\u00EDvel limitar o VTI ''{0}'', porque este \u00E9 um gatilho especial VTI, e esta instru\u00E7\u00E3o n\u00E3o faz parte de uma a\u00E7\u00E3o de gatilho ou cl\u00E1usula WHEN.
43Y26.U=Tempo de otimiza\u00E7\u00E3o
XSLAT.D=O diret\u00F3rio de log ''{0}'' existe. Pode ser que este diret\u00F3rio perten\u00E7a a outro banco de dados. Certifique-se que o local especificado para logDevice est\u00E1 correto.
43Y44.U=Texto do plano de execu\u00E7\u00E3o da instru\u00E7\u00E3o
42X19=A defini\u00E7\u00E3o da cl\u00E1usula WHERE ou HAVING, ou da restri\u00E7\u00E3o de verifica\u00E7\u00E3o, \u00E9 uma express\u00E3o ''{0}''.  Deve ser uma express\u00E3o booleana.
43X09.U=segundos
42X46=H\u00E1 v\u00E1rias fun\u00E7\u00F5es denominadas ''{0}''. Utilize uma assinatura completa ou o nome espec\u00EDfico.
42000=Erro de sintaxe ou viola\u00E7\u00E3o de regras de acesso. Consulte os erros adicionais para obter detalhes.
42X73=A resolu\u00E7\u00E3o de m\u00E9todo para a assinatura {0}.{1}({2}) era amb\u00EDgua (Nenhum m\u00E9todo \u00FAnico especificado de forma m\u00E1xima).
42Z08=A substitui\u00E7\u00E3o de inser\u00E7\u00E3o em massa n\u00E3o \u00E9 permitida em ''{0}'', porque esta possui o gatilho habilitado ({1}).
43X27.U=no n\u00EDvel de isolamento {0} utilizando o bloqueio {1}
01500=Removida a restri\u00E7\u00E3o {0} da tabela {1}.
43X45.U=Jun\u00E7\u00E3o ''EXISTS'' por ''hash''
42Y09=M\u00E9todos vazio s\u00E3o permitidos apenas dentro de instru\u00E7\u00E3o CALL.
42Z44.U=Nulos ordenados
43X63.U=\u00CDndice da linha para linha base
42Y36=A refer\u00EAncia de coluna ''{0}'' n\u00E3o \u00E9 v\u00E1lida. Em uma lista SELECT com GROUP BY, a lista pode conter apenas colunas de agrupamento e express\u00F5es de agrega\u00E7\u00E3o v\u00E1lidas.
43X81.U=Linhas retornadas
22011=O segundo ou terceiro argumento da fun\u00E7\u00E3o SUBSTR est\u00E1 fora da faixa.
42Y63=A jun\u00E7\u00E3o por ''hash'' requer um predicado ''equijoin'' otimiz\u00E1vel em uma coluna do \u00EDndice ou ''heap'' selecionado.  N\u00E3o existe um predicado equijoin otimiz\u00E1vel em nenhuma coluna da tabela ou \u00EDndice ''{0}''. Utilize a substitui\u00E7\u00E3o do otimizador ''\u00EDndice'' ou ''heap'' na tabela ''{1}''.
42Z80.U=seri\u00E1vel
42Y90=N\u00E3o \u00E9 permitido FOR UPDATE neste tipo de instru\u00E7\u00E3o.
42X37=O operador un\u00E1rio ''{0}'' n\u00E3o \u00E9 permitido no tipo ''{1}''.
43Y17.U=Linhas atualizadas
42X64=Na lista Propriedades, foi especificado o valor inv\u00E1lido ''{0}'' para a propriedade useStatistics. Os \u00FAnicos valores v\u00E1lidos s\u00E3o TRUE ou FALSE.
24000=Estado do cursor inv\u00E1lido - nenhuma linha corrente.
XIE0D.S=N\u00E3o foi poss\u00EDvel encontrar o separador de registro na linha {0}.
42X91=O nome da restri\u00E7\u00E3o ''{0}'' aparece mais de uma vez na instru\u00E7\u00E3o CREATE TABLE.
42Z26=A coluna, ''{0}'', com identidade como padr\u00E3o n\u00E3o pode aceitar valores nulos.
