#Thu May 16 17:55:33 BRT 2013
43Y53.U=Acciones de referencia en tablas dependientes
42Z53=ERROR INTERNO\: se desconoce el tipo de activaci\u00F3n a generar para la elecci\u00F3n del nodo {0}.
42Y27=No est\u00E1n permitidos par\u00E1metros en la acci\u00F3n del desencadenante.
43X18.U=\u00CDndices actualizados
XBCXW.S=El algoritmo de recopilaci\u00F3n de mensajes ''{0}'' no es compatible con ninguno de los proveedores de criptograf\u00EDa disponibles. Instale un proveedor de criptograf\u00EDa compatible con el algoritmo o especifique otro algoritmo en la propiedad derby.authentication.builtin.algorithm.
43X36.U=calificadores de exploraci\u00F3n
43X54.U=Claves hash son los n\u00FAmero de columna
42Z35.U=tiempo de siguiente (milisegundos) \=
42X28=Suprimir la tabla ''{0}'' no es el destino del cursor ''{1}''.
43X72.U=a nivel de aislamiento {0} mediante bloqueo {1} elegido por el optimizador
42X55=El nombre de tabla ''{1}'' debe ser el mismo que ''{0}''.
42Z17=Se ha especificado una longitud no v\u00E1lida para la columna ''{0}''. La longitud debe ser mayor que la longitud de columna actual.
43X90.U=ResultSet de uni\u00F3n externa izquierda de bucle anidado
42X82=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila. \u00DAnicamente se permiten filas individuales ResultSets.
42Z71=Los valores XML no est\u00E1n permitidos en conjuntos de resultados de nivel superior; intente utilizar XMLSERIALIZE.
43Y08.U=Ordenar
42Y45=No se puede vincular la VTI ''{0}'' porque es una VTI de desencadenante especial y esta sentencia no forma parte de una acci\u00F3n de desencadenante o cl\u00E1usula WHEN.
22020=La cadena de la funci\u00F3n trim no es v\u00E1lida, ''{0}''. La cadena de TRIM debe estar formada por un car\u00E1cter o ser nula. No puede tener m\u00E1s de un car\u00E1cter.
43Y26.U=Tiempo de optimizaci\u00F3n
XSLAT.D=El directorio de anotaciones cronol\u00F3gicas ''{0}'' ya existe. El directorio puede pertenecer a otra base de datos. Compruebe que la ubicaci\u00F3n especificada para el atributo logDevice sea correcta.
43Y44.U=Texto del plan de ejecuci\u00F3n de sentencia
42X19=La cl\u00E1usula WHERE o HAVING o definici\u00F3n CHECK CONSTRAINT es una expresi\u00F3n ''{0}''.  Debe ser una expresi\u00F3n BOOLEAN.
43X09.U=segundos
42000=Error de sintaxis o violaci\u00F3n de norma de acceso; consulte los errores adicionales para obtener detalles.
42X46=Existen varias funciones llamadas ''{0}''. Utilice la signatura completa o el nombre espec\u00EDfico.
42X73=Resoluci\u00F3n ambigua del m\u00E9todo para la firma {0}.{1}({2}). (No hay un m\u00E9todo espec\u00EDfico que sea m\u00E1s importante).
42Z08=La sustituci\u00F3n mediante inserci\u00F3n general no est\u00E1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
43X27.U=a nivel de aislamiento {0} mediante bloqueo {1}
01500=Se ha eliminado la restricci\u00F3n {0} de la tabla {1}.
43X45.U=Uni\u00F3n EXISTS hash
42Y09=Los m\u00E9todos void s\u00F3lo est\u00E1n permitidos dentro de una sentencia CALL.
42Z44.U=Nulos ordenados
43X63.U=Fila \u00EDndice para fila base
42Y36=La referencia de columna ''{0}'' no es v\u00E1lida o forma parte de una expresi\u00F3n no v\u00E1lida.  Para una lista SELECT con GROUP BY, las columnas y expresiones que se seleccionan s\u00F3lo pueden contener expresiones de agrupaci\u00F3n y de agregado v\u00E1lidas.
43X81.U=Filas devueltas
22011=El segundo o tercer argumento de la funci\u00F3n SUBSTR queda fuera de rango.
42Y63=La uni\u00F3n hash requiere un predicado equijoin optimizable sobre una columna del \u00EDndice o heap seleccionado.  No existe un predicado equijoin optimizable sobre ninguna columna de la tabla o \u00EDndice ''{0}''. Utilice el modificador del optimizador ''index'' para especificar dicho \u00EDndice o heap sobre la tabla ''{1}''.
42Z80.U=serializable
42Y90=No se permite FOR UPDATE en este tipo de sentencia.  
42X37=El operador unitario ''{0}'' no est\u00E1 permitido sobre el tipo ''{1}''.
24000=Estado del cursor no v\u00E1lido - sin fila actual.
43Y17.U=filas actualizadas
42X64=En la lista Properties, se ha especificado el valor ''{0}'' no v\u00E1lido para la propiedad useStatistics. Los \u00FAnicos valores v\u00E1lidos son TRUE o FALSE. 
XIE0D.S=No se puede encontrar el separador de registro en la l\u00EDnea {0}.
22011.S.1=El rango especificado para la subcadena con el desplazamiento {0} y el largo {1} est\u00E1 fuera de rango para la cadena\: {2}.
42X91=El nombre de restricci\u00F3n ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE TABLE. 
42Z26=Una columna, ''{0}'', con un valor por omisi\u00F3n de identidad no puede aceptar nulos.
