#Thu May 16 17:55:33 BRT 2013
43Y53.U=Dzia\u0142ania referencyjne na tabelach zale\u017Cnych
42Z53=B\u0141\u0104D WEWN\u0118TRZNY\: Nieznany typ aktywowania do wygenerowania dla w\u0119z\u0142a {0}.
42Y27=Parametry w wyzwalanym dzia\u0142aniu nie s\u0105 dozwolone.
43X18.U=Zaktualizowane indeksy
43X36.U=kwalifikatory skanowania
43X54.U=Klucze mieszaj\u0105ce s\u0105 numerami kolumn
42Z35.U=czas operacji next (milisekundy) \=
42X28=Usuwana tabela ''{0}'' nie jest docelowa dla kursora ''{1}''.
43X72.U=na poziomie odseparowania {0} za pomoc\u0105 blokowania {1} wybranego przez optymalizator
42X55=Nazwa tabeli ''{1}'' powinna by\u0107 taka sama, jak ''{0}''.
42Z17=Okre\u015Blono niepoprawn\u0105 d\u0142ugo\u015B\u0107 kolumny ''{0}''. D\u0142ugo\u015B\u0107 musi by\u0107 wi\u0119ksza ni\u017C bie\u017C\u0105ca d\u0142ugo\u015B\u0107 kolumny.
43X90.U=Interfejs ResultSet dla lewostronnego \u0142\u0105czenia zewn\u0119trznego zagnie\u017Cd\u017Conego
42X82=Klauzula USING zwr\u00F3ci\u0142a wi\u0119cej ni\u017C jeden wiersz. Dozwolone s\u0105 tylko wyniki ResultSets o pojedynczym wierszu.
42Z71=Warto\u015Bci XML nie s\u0105 dozwolone w tabelach wynikowych najwy\u017Cszego poziomu. Spr\u00F3buj u\u017Cy\u0107 komendy XMLSERIALIZE.
43Y08.U=Sortowanie
42Y45=Wyzwalacz VTI ''{0}'' nie mo\u017Ce by\u0107 powi\u0105zany, poniewa\u017C jest to specjalny wyzwalacz VTI, a to wyra\u017Cenie nie jest cz\u0119\u015Bci\u0105 wyzwalanego dzia\u0142ania ani klauzuli WHEN.
43Y26.U=Czas optymalizowania
XSLAT.D=Katalog dziennika ''{0}'' istnieje. Katalog mo\u017Ce nale\u017Ce\u0107 do innej bazy danych. Sprawd\u017A, czy po\u0142o\u017Cenie podane w atrybucie logDevice jest poprawne.
43Y44.U=Tekst planu wykonania instrukcji
42X19=Klauzula WHERE lub HAVING albo definicja CHECK CONSTRAINT jest wyra\u017Ceniem typu ''{0}''. Musi by\u0107 wyra\u017Ceniem typu BOOLEAN.
43X09.U=sekundy
42X46=Istnieje wiele funkcji o nazwie ''{0}''. U\u017Cyj pe\u0142nej sygnatury lub konkretnej nazwy.
42000=B\u0142\u0105d sk\u0142adniowy lub naruszenie regu\u0142y dost\u0119pu. Szczeg\u00F3\u0142y zawieraj\u0105 dodatkowe b\u0142\u0119dy.
42X73=Rozstrzyganie metod dla sygnatury {0}.{1}({2}) by\u0142o niejednoznaczne. (Brak pojedynczej jak najbardziej konkretnej metody).
42Z08=Masowe wstawianie (zast\u0119powanie) nie jest dozwolone dla ''{0}'', poniewa\u017C jest w\u0142\u0105czony wyzwalacz ({1}).
43X27.U=na poziomie odseparowania {0} za pomoc\u0105 blokowania {1}
01500=Regu\u0142a ograniczaj\u0105ca {0} tabeli {1} zosta\u0142a usuni\u0119ta.
43X45.U=\u0141\u0105czenie mieszaj\u0105ce Exists
42Y09=Metody void dozwolone s\u0105 tylko wewn\u0105trz instrukcji CALL.
42Z44.U=Uporz\u0105dkowane warto\u015Bci null
43X63.U=Wiersz indeksu do wiersza podstawowego
42Y36=Odwo\u0142anie ''{0}'' do kolumny jest niepoprawne. Lista SELECT z instrukcj\u0105 GROUP BY mo\u017Ce zawiera\u0107 tylko poprawne wyra\u017Cenia grupuj\u0105ce oraz poprawne wyra\u017Cenia agreguj\u0105ce. 
43X81.U=Wiersze zwr\u00F3cone
22011=Drugi lub trzeci argument funkcji SUBSTR jest spoza zakresu.
42Y63=\u0141\u0105czenie mieszaj\u0105ce wymaga optymalizowalnego predykatu \u0142\u0105czenia wed\u0142ug r\u00F3wno\u015Bci dla kolumny w wybranym indeksie lub stercie. Optymalizowalny predykat \u0142\u0105czenia wed\u0142ug r\u00F3wno\u015Bci nie istnieje dla \u017Cadnej kolumny w tabeli lub indeksie ''{0}''. U\u017Cyj nadpisania optymalizatora ''index'', aby okre\u015Bli\u0107 taki indeks lub stert\u0119 dla tabeli ''{1}''.
42Z80.U=mo\u017Cliwe do serializacji
42Y90=Instrukcja FOR UPDATE nie jest dozwolona dla tego typu instrukcji. 
42X37=Operator unarny ''{0}'' nie jest dozwolony dla typu ''{1}''.
43Y17.U=Zaktualizowane wiersze
42X64=Na li\u015Bcie w\u0142a\u015Bciwo\u015Bci, dla w\u0142a\u015Bciwo\u015Bci useStatistics podano niepoprawn\u0105 warto\u015B\u0107 ''{0}''. Jedynymi poprawnymi warto\u015Bciami s\u0105 TRUE lub FALSE. 
24000=Niepoprawny stan kursora - brak bie\u017C\u0105cego wiersza.
XIE0D.S=Nie mo\u017Cna znale\u017A\u0107 separatora rekord\u00F3w w wierszu {0}.
42X91=Nazwa regu\u0142y ograniczaj\u0105cej ''{0}'' pojawia si\u0119 w instrukcji CREATE TABLE wi\u0119cej ni\u017C jeden raz. 
42Z26=Kolumna ''{0}'' z warto\u015Bci\u0105 domy\u015Bln\u0105 to\u017Csamo\u015Bci nie mo\u017Ce dopuszcza\u0107 warto\u015Bci null.
