#Thu May 16 17:55:33 BRT 2013
43Y53.U=Actions de r\u00E9f\u00E9rentiel dans des tables d\u00E9pendantes
42Z53=ERREUR INTERNE \: le type d''activation \u00E0 g\u00E9n\u00E9rer pour le choix du noeud {0} est inconnu.
42Y27=Les param\u00E8tres ne sont pas autoris\u00E9s dans l''action du d\u00E9clencheur.
43X18.U=Index mis \u00E0 jour
XBCXW.S=L''algorithme de synth\u00E8se des messages ''{0}'' n''est pas pris en charge par les fournisseurs de chiffrement disponibles. Installez un fournisseur de chiffrement prenant en charge l''algorithme ou sp\u00E9cifiez un autre algorithme dans la propri\u00E9t\u00E9 derby.authentication.builtin.algorithm.
43X36.U=qualifiants d''analyse
43X54.U=Les cl\u00E9s de hachage sont les num\u00E9ros de colonne
42Z35.U=dur\u00E9e next (millisecondes) \=
42X28=La table de suppression ''{0}'' n''est pas la cible du curseur ''{1}''.
43X72.U=au niveau d''isolement {0} \u00E0 l''aide du verrouillage {1} choisi par l''optimiseur
42X55=Le nom de table ''{1}'' doit \u00EAtre le m\u00EAme que ''{0}''.
42Z17=Longueur non valide indiqu\u00E9e pour la colonne ''{0}''. La longueur doit \u00EAtre sup\u00E9rieure \u00E0 la longueur de colonne actuelle.
43X90.U=ResultSet de jointure externe gauche en boucle imbriqu\u00E9e
42X82=La clause USING a renvoy\u00E9 plusieurs lignes. Seuls les ResultSets comportant une seule ligne sont autoris\u00E9s.
42Z71=Les valeurs XML ne sont pas admises dans les ensembles de r\u00E9sultats de niveau sup\u00E9rieur. Utilisez XMLSERIALIZE.
43Y08.U=Tri
42Y45=Le VTI ''{0}'' ne peut pas \u00EAtre li\u00E9 parce qu''il s''agit d''un VTI de d\u00E9clencheur sp\u00E9cial et que cette instruction ne fait pas partie d''une action de d\u00E9clencheur ou d''une clause WHEN.
22020=Cha\u00EEne trim ''{0}'' non valide. Elle doit comprendre exactement un caract\u00E8re ou \u00EAtre NULLE. Elle ne doit pas compter plus d''un caract\u00E8re.
43Y26.U=Dur\u00E9e de l''optimisation
XSLAT.D=Le r\u00E9pertoire des journaux ''{0}'' existe. Ce r\u00E9pertoire fait peut-\u00EAtre partie d''une autre base de donn\u00E9es. Assurez-vous que l''emplacement indiqu\u00E9 pour l''attribut logDevice est correct.
43Y44.U=Texte du plan d''ex\u00E9cution de l''instruction
42X19=La clause WHERE ou HAVING ou la d\u00E9finition CHECK CONSTRAINT est une expression ''{0}''.  Il faut que ce soit une expression BOOLEENNE.
43X09.U=secondes
42000=Erreur de syntaxe ou violation des r\u00E8gles d''acc\u00E8s ; pour plus de d\u00E9tails, voir les autres erreurs.
42X46=Il existe plusieurs fonctions nomm\u00E9es ''{0}''. Utilisez la signature compl\u00E8te ou le nom sp\u00E9cifique.
42X73=La r\u00E9solution de m\u00E9thode pour la signature {0}.{1}({2}) \u00E9tait ambigu\u00EB. (Plus d''une m\u00E9thode correspondait \u00E0 la requ\u00EAte.)
42Z08=Une op\u00E9ration d''insertion/remplacement globale n''est pas autoris\u00E9e  sur ''{0}'' parce qu''il contient un d\u00E9clencheur activ\u00E9 ({1}).
43X27.U=au niveau d''isolement {0} \u00E0 l''aide du verrouillage {1}
01500=La contrainte {0} sur la table {1} a \u00E9t\u00E9 supprim\u00E9e.
43X45.U=Jointure Exists par hachage
42Y09=Les m\u00E9thodes void sont uniquement autoris\u00E9es dans une instruction CALL.
42Z44.U=Valeurs NULL ordonn\u00E9es
43X63.U=Ligne de base vers ligne d''index
42Y36=La r\u00E9f\u00E9rence de colonne ''{0}'' est incorrecte ou fait partie d''une expression incorrecte.  Pour une liste SELECT comportant un \u00E9l\u00E9ment GROUP BY, les colonnes et les expressions s\u00E9lectionn\u00E9es ne peuvent contenir que des expressions de regroupement et des expressions d''agr\u00E9gat valides.
43X81.U=Lignes renvoy\u00E9es
22011=Le deuxi\u00E8me ou troisi\u00E8me argument de la fonction SUBSTR se situe hors de la fourchette admise.
42Y63=Une jointure par hachage n\u00E9cessite un pr\u00E9dicat equijoin optimisable sur une colonne dans l''index ou le segment de m\u00E9moire s\u00E9lectionn\u00E9.  Un pr\u00E9dicat equijoin optimisable n''existe dans aucune colonne de la table ou de l''index ''{0}''. Utilisez l''\u00E9l\u00E9ment de substitution d''optimiseur ''index'' pour sp\u00E9cifier cet index ou ce segment de m\u00E9moire sur la table ''{1}''.
42Z80.U=s\u00E9rialisable
42Y90=FOR UPDATE n''est pas autoris\u00E9 dans ce type d''instruction.  
42X37=L''op\u00E9rateur unaire ''{0}'' n''est pas autoris\u00E9e sur le type ''{1}''.
24000=Etat du curseur non valide - pas de ligne en cours.
43Y17.U=Lignes mises \u00E0 jour
42X64=Dans la liste Propri\u00E9t\u00E9s, la valeur non valide ''{0}'' a \u00E9t\u00E9 indiqu\u00E9e pour la propri\u00E9t\u00E9 useStatistics. Les seules valeurs valides sont TRUE ou FALSE. 
XIE0D.S=Impossible de trouver le s\u00E9parateur d''enregistrement sur la ligne {0}.
22011.S.1=La plage sp\u00E9cifi\u00E9e pour la sous-cha\u00EEne au d\u00E9calage {0} et au nbcar {1} est hors plage pour la cha\u00EEne \: {2}.
42X91=Le nom de contrainte ''{0}'' figure plusieurs fois dans l''instruction CREATE TABLE. 
42Z26=Une colonne,  ''{0}'', associ\u00E9e \u00E0 une valeur d''identit\u00E9 par d\u00E9faut ne peut pas prendre la valeur NULL.
