#Thu May 16 17:55:33 BRT 2013
43Y53.U=Referen\u010Dn\u00ED akce v z\u00E1visl\u00FDch tabulk\u00E1ch
42Z53=VNIT\u0158N\u00CD CHYBA\: Typ aktivace, kter\u00FD se m\u00E1 generovat pro volbu uzlu {0}, je nezn\u00E1m\u00FD.
42Y27=V akci triggeru nejsou povoleny parametry.
43X18.U=Aktualizovan\u00E9 indexy
43X36.U=kvalifik\u00E1tory skenov\u00E1n\u00ED
43X54.U=Transforma\u010Dn\u00EDmi kl\u00ED\u010Di jsou \u010D\u00EDsla sloupc\u016F
42Z35.U=dal\u0161\u00ED \u010Das (milisekundy) \=
42X28=V\u00FDmaz tabulky ''{0}'' nen\u00ED c\u00EDlem kurzoru ''{1}''.
43X72.U=na \u00FArovni izolace {0} pomoc\u00ED uzam\u010Den\u00ED {1} vybran\u00E9ho optimaliz\u00E1torem
42X55=Jm\u00E9no tabulky ''{1}'' by m\u011Blo b\u00FDt stejn\u00E9 jako ''{0}''.
42Z17=Byla uvedena neplatn\u00E1 d\u00E9lka pro sloupec ''{0}''. D\u00E9lka mus\u00ED b\u00FDt v\u011Bt\u0161\u00ED ne\u017E aktu\u00E1ln\u00ED d\u00E9lka sloupce.
43X90.U=Rozhran\u00ED ResultSet lev\u00E9ho vn\u011Bj\u0161\u00EDho slou\u010Den\u00ED vno\u0159en\u00E9 smy\u010Dky
42X82=Klauzule USING vr\u00E1tila v\u00EDce ne\u017E jeden \u0159\u00E1dek. P\u0159\u00EDpustn\u00E9 jsou pouze jedno\u0159\u00E1dkov\u00E9 mno\u017Einy v\u00FDsledk\u016F.
42Z71=Hodnoty XML nejsou povoleny v mno\u017Ein\u00E1ch v\u00FDsledk\u016F na nejvy\u0161\u0161\u00ED \u00FArovni; zkuste pou\u017E\u00EDt XMLSERIALIZE.
43Y08.U=Set\u0159\u00EDdit
42Y45=VTI ''{0}'' nelze propojit, proto\u017Ee se jedn\u00E1 o VTI speci\u00E1ln\u00EDho triggeru a tento p\u0159\u00EDkaz nen\u00ED sou\u010D\u00E1st\u00ED akce triggeru nebo klauzule WHEN.
43Y26.U=\u010Cas optimalizace
XSLAT.D=Adres\u00E1\u0159 protokolu ''{0}'' existuje. Adres\u00E1\u0159 m\u016F\u017Ee pat\u0159it jin\u00E9 datab\u00E1zi. Zkontrolujte, \u017Ee um\u00EDst\u011Bn\u00ED uveden\u00E9 pro atribut logDevice je spr\u00E1vn\u00E9.
43Y44.U=Text pl\u00E1nu proveden\u00ED p\u0159\u00EDkazu
42X19=Klauzule WHERE nebo HAVING nebo definice CHECK CONSTRAINT je v\u00FDraz ''{0}''. Mus\u00ED b\u00FDt v\u00FDrazem typu BOOLEAN.
43X09.U=sekundy
42X46=Existuje n\u011Bkolik funkc\u00ED pojmenovan\u00FDch ''{0}''. Pou\u017Eijte \u00FApln\u00E9 ozna\u010Den\u00ED nebo ur\u010Dit\u00E9 jm\u00E9no.
42000=Chyba syntaxe nebo naru\u0161en\u00ED pravidla p\u0159\u00EDstupu; podrobnosti viz dal\u0161\u00ED chyby.
42X73=Rozli\u0161en\u00ED metody pro ozna\u010Den\u00ED {0}.{1}({2}) bylo nejednozna\u010Dn\u00E9. (\u017D\u00E1dn\u00E1 jednoduch\u00E1, maxim\u00E1ln\u011B ur\u010Dit\u00E1 metoda.)
42Z08=Nahrazen\u00ED hromadn\u00E9ho vlo\u017Een\u00ED nen\u00ED povoleno v ''{0}'', proto\u017Ee m\u00E1 aktivovan\u00FD trigger ({1}).
43X27.U=na \u00FArovni izolace {0} pomoc\u00ED uzam\u010Den\u00ED {1}
01500=Omezen\u00ED {0} v tabulce {1} bylo uvoln\u011Bno.
43X45.U=Ha\u0161ovat existuj\u00EDc\u00ED slou\u010Den\u00ED
42Y09=Neobsazen\u00E9 metody jsou povoleny pouze v p\u0159\u00EDkazu CALL.
42Z44.U=Uspo\u0159\u00E1dan\u00E9 hodnoty ''null''
43X63.U=\u0158\u00E1dek indexu po \u0159\u00E1dek b\u00E1ze
42Y36=Odkaz na sloupec ''{0}'' je neplatn\u00FD. Pro seznam SELECT s GROUP BY m\u016F\u017Ee seznam obsahovat pouze platn\u00E9 v\u00FDrazy seskupen\u00ED a platn\u00E9 seskupen\u00E9 v\u00FDrazy. 
43X81.U=Vr\u00E1cen\u00E9 \u0159\u00E1dky
22011=Druh\u00FD nebo t\u0159et\u00ED argument funkce SUBSTR je mimo rozsah.
42Y63=Slou\u010Den\u00ED ha\u0161ov\u00E1n\u00ED vy\u017Eaduje optimalizovateln\u00FD predik\u00E1t equijoin ve sloupci ve vybran\u00E9m indexu nebo z\u00E1sobn\u00EDkov\u00E9 pam\u011Bti. Optimalizovateln\u00FD predik\u00E1t equijoin neexistuje v \u017E\u00E1dn\u00E9m sloupci v tabulce nebo rejst\u0159\u00EDku ''{0}''. Pou\u017Eijte p\u0159epis nastaven\u00ED optimaliz\u00E1toru ''index'', abyste zadali takov\u00FD index nebo z\u00E1sobn\u00EDkovou pam\u011B\u0165 v tabulce ''{1}''.
42Z80.U=serializovateln\u00FD
42Y90=FOR UPDATE nen\u00ED povoleno v tomto typu p\u0159\u00EDkazu. 
42X37=Un\u00E1rn\u00ED oper\u00E1tor ''{0}'' nen\u00ED povolen u typu ''{1}''.
43Y17.U=Aktualizovan\u00E9 \u0159\u00E1dky
42X64=V seznamu Vlastnosti byla uvedena neplatn\u00E1 hodnota ''{0}'' pro vlastnost useStatistics. Jedin\u00FDmi platn\u00FDmi hodnotami jsou hodnoty TRUE nebo FALSE. 
24000=Neplatn\u00FD stav kurzoru - \u017E\u00E1dn\u00FD aktu\u00E1ln\u00ED \u0159\u00E1dek.
XIE0D.S=Nelze nal\u00E9zt odd\u011Blova\u010D z\u00E1znam\u016F na \u0159\u00E1dku {0}.
42X91=Jm\u00E9no omezen\u00ED ''{0}'' se objevuje v\u00EDce ne\u017E jednou v p\u0159\u00EDkazu CREATE TABLE. 
42Z26=Sloupec ''{0}'' s p\u0159edvolbou toto\u017Enosti nem\u016F\u017Ee nab\u00FDvat hodnoty ''null''.
