#Thu May 16 17:55:33 BRT 2013
43Y53.U=\u5F93\u5C5E\u8868\u306B\u5BFE\u3059\u308B\u53C2\u7167\u30A2\u30AF\u30B7\u30E7\u30F3
42Z53=\u5185\u90E8\u30A8\u30E9\u30FC\: \u30CE\u30FC\u30C9\u9078\u629E {0} \u306B\u5BFE\u3057\u3066\u751F\u6210\u3059\u308B Activation \u306E\u30BF\u30A4\u30D7\u304C\u4E0D\u660E\u3067\u3059\u3002
42Y27=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u3001\u30C8\u30EA\u30AC\u30FC\u30FB\u30A2\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
43X18.U=\u66F4\u65B0\u3055\u308C\u305F\u7D22\u5F15
XBCXW.S=\u30E1\u30C3\u30BB\u30FC\u30B8\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0 ''{0}'' \u306F\u3001\u5229\u7528\u53EF\u80FD\u306A\u6697\u53F7\u5316\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u3044\u305A\u308C\u306B\u3082\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u305D\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u6697\u53F7\u5316\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u304B\u3001derby.authentication.builtin.algorithm \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3067\u5225\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
43X36.U=\u30B9\u30AD\u30E3\u30F3\u4FEE\u98FE\u5B50
43X54.U=\u30CF\u30C3\u30B7\u30E5\u30FB\u30AD\u30FC\u306F\u5217\u756A\u53F7\u3067\u3059
42Z35.U=\u6B21\u306E\u6642\u9593 (\u30DF\u30EA\u79D2) \=
42X28=\u524A\u9664\u8868 ''{0}'' \u306F\u30AB\u30FC\u30BD\u30EB ''{1}'' \u306E\u30BF\u30FC\u30B2\u30C3\u30C8\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
43X72.U=\u30AA\u30D7\u30C6\u30A3\u30DE\u30A4\u30B6\u30FC\u306B\u3088\u3063\u3066\u9078\u629E\u3055\u308C\u305F {1} \u30ED\u30C3\u30AF\u3092\u4F7F\u7528\u3059\u308B {0} \u5206\u96E2\u30EC\u30D9\u30EB\u3067
42X55=\u8868\u540D ''{1}'' \u306F ''{0}'' \u3068\u540C\u3058\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
42Z17=\u5217 ''{0}'' \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A\u9577\u3055\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 \u9577\u3055\u306F\u3001\u73FE\u884C\u306E\u5217\u306E\u9577\u3055\u3088\u308A\u3082\u9577\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
43X90.U=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30EB\u30FC\u30D7\u306E\u5DE6\u5916\u90E8\u7D50\u5408 ResultSet
42X82=USING \u6587\u7BC0\u304C\u8907\u6570\u306E\u884C\u3092\u623B\u3057\u307E\u3057\u305F\u3002 \u5358\u4E00\u884C\u306E ResultSet \u306E\u307F\u304C\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
42Z71=\u6700\u4E0A\u4F4D\u7D50\u679C\u30BB\u30C3\u30C8\u3067\u306F XML \u5024\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002XMLSERIALIZE \u306E\u4F7F\u7528\u3092\u8A66\u307F\u3066\u304F\u3060\u3055\u3044\u3002
43Y08.U=\u30BD\u30FC\u30C8
42Y45=VTI ''{0}'' \u306F\u7279\u6B8A\u30C8\u30EA\u30AC\u30FC VTI \u3067\u3042\u308A\u3001\u3053\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306F\u30C8\u30EA\u30AC\u30FC\u30FB\u30A2\u30AF\u30B7\u30E7\u30F3\u307E\u305F\u306F WHEN \u6587\u7BC0\u306E\u4E00\u90E8\u3067\u306A\u3044\u305F\u3081\u3001\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
22020=''{0}'' \u306F\u7121\u52B9\u306A trim \u6587\u5B57\u5217\u3067\u3059\u3002 trim \u6587\u5B57\u5217\u306F\u3001\u53B3\u5BC6\u306B 1 \u6587\u5B57\u307E\u305F\u306F NULL \u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 2 \u6587\u5B57\u4EE5\u4E0A\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
43Y26.U=\u6700\u9069\u5316\u6642\u9593
XSLAT.D=\u30ED\u30B0\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC ''{0}'' \u304C\u5B58\u5728\u3057\u307E\u3059\u3002 \u3053\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306F\u3001\u5225\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u5C5E\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002 logDevice \u5C5E\u6027\u306B\u6307\u5B9A\u3057\u305F\u5834\u6240\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
43Y44.U=\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u5B9F\u884C\u30D7\u30E9\u30F3\u30FB\u30C6\u30AD\u30B9\u30C8
42X19=WHERE \u307E\u305F\u306F HAVING \u6587\u7BC0\u3001\u3042\u308B\u3044\u306F CHECK CONSTRAINT \u5B9A\u7FA9\u306F ''{0}'' \u5F0F\u3067\u3059\u3002  \u3053\u308C\u306F\u30D6\u30FC\u30EB\u5F0F\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
43X09.U=\u79D2
42000=\u69CB\u6587\u30A8\u30E9\u30FC\u307E\u305F\u306F\u30A2\u30AF\u30BB\u30B9\u898F\u5247\u9055\u53CD\u3002\u8A73\u3057\u304F\u306F\u8FFD\u52A0\u30A8\u30E9\u30FC\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
42X46=''{0}'' \u3068\u3044\u3046\u540D\u524D\u306E\u95A2\u6570\u304C\u8907\u6570\u5B58\u5728\u3057\u307E\u3059\u3002 \u5B8C\u5168\u306A\u30B7\u30B0\u30CB\u30C1\u30E3\u30FC\u304B\u56FA\u6709\u306E\u540D\u524D\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
42X73=\u30B7\u30B0\u30CB\u30C1\u30E3\u30FC {0}.{1}({2}) \u306E\u30E1\u30BD\u30C3\u30C9\u89E3\u6C7A\u304C\u672A\u78BA\u5B9A\u3067\u3057\u305F\u3002 (\u6700\u5927\u9650\u306B\u7279\u5B9A\u306E\u5358\u4E00\u30E1\u30BD\u30C3\u30C9\u306F\u3042\u308A\u307E\u305B\u3093\u3002)
42Z08=''{0}'' \u306F\u4F7F\u7528\u53EF\u80FD\u306A\u30C8\u30EA\u30AC\u30FC ({1}) \u3092\u6301\u3063\u3066\u3044\u308B\u305F\u3081\u3001\u3053\u308C\u306B\u5BFE\u3059\u308B\u30D0\u30EB\u30AF\u633F\u5165\u7F6E\u63DB\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
43X27.U={1} \u30ED\u30C3\u30AF\u3092\u4F7F\u7528\u3057\u305F {0} \u5206\u96E2\u30EC\u30D9\u30EB\u3067
01500=\u8868 {1} \u306E\u5236\u7D04 {0} \u304C\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
43X45.U=Hash Exists Join
42Y09=void \u30E1\u30BD\u30C3\u30C9\u306F\u3001CALL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u5185\u3067\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
42Z44.U=\u9806\u5E8F\u4ED8\u3051\u3055\u308C\u305F NULL
43X63.U=\u57FA\u672C\u884C\u306B\u5BFE\u3059\u308B\u7D22\u5F15\u884C
42Y36=\u5217\u53C2\u7167 ''{0}'' \u306F\u7121\u52B9\u3067\u3042\u308B\u304B\u3001\u7121\u52B9\u306A\u5F0F\u306E\u4E00\u90E8\u3067\u3059\u3002GROUP BY \u3092\u6301\u3064 SELECT \u30EA\u30B9\u30C8\u306E\u5834\u5408\u3001\u9078\u629E\u3055\u308C\u308B\u5217\u3068\u5F0F\u306B\u306F\u6709\u52B9\u306A\u30B0\u30EB\u30FC\u30D7\u5316\u5F0F\u3068\u6709\u52B9\u306A\u96C6\u5408\u4F53\u5F0F\u3057\u304B\u542B\u3080\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
43X81.U=\u623B\u3055\u308C\u305F\u884C
22011=SUBSTR \u95A2\u6570\u306E 2 \u756A\u76EE\u307E\u305F\u306F 3 \u756A\u76EE\u306E\u5F15\u6570\u304C\u7BC4\u56F2\u5916\u3067\u3059\u3002
42Y63=\u30CF\u30C3\u30B7\u30E5\u7D50\u5408\u306B\u306F\u3001\u9078\u629E\u3055\u308C\u305F\u7D22\u5F15\u307E\u305F\u306F\u30D2\u30FC\u30D7\u5185\u306E\u5217\u306B\u6700\u9069\u5316\u53EF\u80FD\u306A\u7B49\u4FA1\u7D50\u5408\u8FF0\u90E8\u304C\u5FC5\u8981\u3067\u3059\u3002  \u8868\u307E\u305F\u306F\u7D22\u5F15 ''{0}'' \u5185\u306E\u3069\u306E\u5217\u306B\u3082\u3001\u6700\u9069\u5316\u53EF\u80FD\u306A\u7B49\u4FA1\u7D50\u5408\u8FF0\u90E8\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002 ''index'' \u30AA\u30D7\u30C6\u30A3\u30DE\u30A4\u30B6\u30FC\u30FB\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3092\u4F7F\u3063\u3066\u3001\u8868 ''{1}'' \u306B\u305D\u306E\u3088\u3046\u306A\u7D22\u5F15\u307E\u305F\u306F\u30D2\u30FC\u30D7\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
42Z80.U=\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u53EF\u80FD
42Y90=FOR UPDATE \u306F\u3001\u3053\u306E\u578B\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002  
42X37=\u5358\u9805 ''{0}'' \u6F14\u7B97\u5B50\u306F\u3001''{1}'' \u578B\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
24000=\u7121\u52B9\u306A\u30AB\u30FC\u30BD\u30EB\u72B6\u614B - \u73FE\u5728\u884C\u304C\u3042\u308A\u307E\u305B\u3093\u3002
43Y17.U=\u66F4\u65B0\u3055\u308C\u305F\u884C
42X64=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30EA\u30B9\u30C8\u3067\u3001useStatistics \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306B\u7121\u52B9\u306A\u5024 ''{0}'' \u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 \u6709\u52B9\u306A\u5024\u306F TRUE \u307E\u305F\u306F FALSE \u306E\u307F\u3067\u3059\u3002 
XIE0D.S=\u884C {0} \u306E\u30EC\u30B3\u30FC\u30C9\u5206\u96E2\u6587\u5B57\u3092\u691C\u51FA\u3067\u304D\u307E\u305B\u3093\u3002
22011.S.1=\u30AA\u30D5\u30BB\u30C3\u30C8 {0}\u3001\u9577\u3055 {1} \u306E\u90E8\u5206\u6587\u5B57\u5217\u306B\u6307\u5B9A\u3055\u308C\u305F\u7BC4\u56F2\u304C\u3001\u6587\u5B57\u5217\u306E\u7BC4\u56F2\u5916\u3067\u3059\: {2}\u3002
42X91=\u5236\u7D04\u540D ''{0}'' \u306F\u3001CREATE TABLE \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u8907\u6570\u56DE\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002 
42Z26=ID \u30C7\u30D5\u30A9\u30EB\u30C8\u3092\u6301\u3064\u5217 ''{0}'' \u306F NULL \u53EF\u80FD \u306B\u3067\u304D\u307E\u305B\u3093\u3002
