#Thu May 16 17:55:33 BRT 2013
43Y53.U=\u0414\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u0430\u043C\u0438 \u0434\u043B\u044F \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u044B\u0445 \u0442\u0430\u0431\u043B\u0438\u0446
42Z53=\u0412\u041D\u0423\u0422\u0420\u0415\u041D\u041D\u042F\u042F \u041E\u0428\u0418\u0411\u041A\u0410\: \u0422\u0438\u043F \u0430\u043A\u0442\u0438\u0432\u0430\u0446\u0438\u0438, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043D\u0443\u0436\u043D\u043E \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0434\u043B\u044F \u0432\u044B\u0431\u043E\u0440\u0430 \u0443\u0437\u043B\u0430 {0}, \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u0435\u043D.
42Y27=\u0412 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0438 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F.
43X18.U=\u041E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0438\u043D\u0434\u0435\u043A\u0441\u043E\u0432
43X36.U=\u043A\u0432\u0430\u043B\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
43X54.U=\u041A\u043B\u044E\u0447\u0438 \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F - \u044D\u0442\u043E \u043D\u043E\u043C\u0435\u0440\u0430 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432
42Z35.U=\u0432\u0440\u0435\u043C\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 next (\u043C\u0441\u0435\u043A) \=
42X28=\u0423\u0434\u0430\u043B\u0435\u043D\u0438\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u043C \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u0443\u0440\u0441\u043E\u0440\u0430 ''{1}''.
43X72.U=\u043F\u0440\u0438 \u0443\u0440\u043E\u0432\u043D\u0435 \u0438\u0437\u043E\u043B\u044F\u0446\u0438\u0438 {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0438 \u0442\u0438\u043F\u0430 {1}, \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u043E\u0439 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u043E\u043C
42X55=\u0418\u043C\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}'' \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C \u0441 ''{0}''.
42Z17=\u0417\u0430\u0434\u0430\u043D\u0430 \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0434\u043B\u0438\u043D\u0430 \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}''. \u0414\u043B\u0438\u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0434\u043B\u0438\u043D\u044B \u0441\u0442\u043E\u043B\u0431\u0446\u0430.
43X90.U=ResultSet - \u041B\u0435\u0432\u043E\u0435 \u0432\u043D\u0435\u0448\u043D\u0435\u0435 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u0433\u043E \u0446\u0438\u043A\u043B\u0430
42X82=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F USING \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u043B\u0430 \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0438. \u0420\u0430\u0437\u0440\u0435\u0448\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u043E\u0441\u0442\u0440\u043E\u0447\u043D\u044B\u0435 \u043D\u0430\u0431\u043E\u0440\u044B \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432.
42Z71=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u044F XML \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0432 \u043D\u0430\u0431\u043E\u0440\u0430\u0445 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 \u0432\u044B\u0441\u0448\u0435\u0433\u043E \u0443\u0440\u043E\u0432\u043D\u044F; \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C XMLSERIALIZE.
43Y08.U=\u0421\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C
42Y45=VTI ''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u0441\u0432\u044F\u0437\u0430\u0442\u044C, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E VTI \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430, \u0438 \u0434\u0430\u043D\u043D\u044B\u0439 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u043D\u0438 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430, \u043D\u0438 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 WHEN.
43Y26.U=\u0412\u0440\u0435\u043C\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u0438
XSLAT.D=\u041A\u0430\u0442\u0430\u043B\u043E\u0433 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 ''{0}'' \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442. \u041A\u0430\u0442\u0430\u043B\u043E\u0433 \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0440\u0438\u043D\u0430\u0434\u043B\u0435\u0436\u0430\u0442\u044C \u043A \u0434\u0440\u0443\u0433\u043E\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C, \u0447\u0442\u043E \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 logDevice \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E\u043D\u0430\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0435.
43Y44.U=\u0422\u0435\u043A\u0441\u0442 \u043F\u043B\u0430\u043D\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430
42X19=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F WHERE \u0438\u043B\u0438 HAVING \u043B\u0438\u0431\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 CHECK CONSTRAINT \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0442 \u0441\u043E\u0431\u043E\u0439 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 ''{0}''.  \u041E\u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u0430 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u0435 (BOOLEAN) \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435.
43X09.U=\u0441\u0435\u043A.
42X46=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0444\u0443\u043D\u043A\u0446\u0438\u0439 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C ''{0}''. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043F\u043E\u043B\u043D\u0443\u044E \u0441\u0438\u0433\u043D\u0430\u0442\u0443\u0440\u0443 \u0438\u043B\u0438 \u043A\u043E\u043D\u043A\u0440\u0435\u0442\u043D\u043E\u0435 \u0438\u043C\u044F.
42000=\u0421\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430 \u0438\u043B\u0438 \u043D\u0430\u0440\u0443\u0448\u0435\u043D\u0438\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0430; \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0431\u043E\u043B\u0435\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u0432 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0445 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F\u0445 \u043E\u0431 \u043E\u0448\u0438\u0431\u043A\u0430\u0445.
42X73=\u0420\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043C\u0435\u0442\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u0438\u0433\u043D\u0430\u0442\u0443\u0440\u044B {0}.{1}({2}) \u043E\u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u043D\u0435\u043E\u0434\u043D\u043E\u0437\u043D\u0430\u0447\u043D\u044B\u043C. (\u041D\u0435\u0442 \u0435\u0434\u0438\u043D\u043E\u0433\u043E \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u0447\u043D\u043E\u0433\u043E \u043C\u0435\u0442\u043E\u0434\u0430.)
42Z08=\u041C\u0430\u0441\u0441\u043E\u0432\u0430\u044F \u0437\u0430\u043C\u0435\u043D\u0430 \u043F\u0440\u0438 \u0432\u0441\u0442\u0430\u0432\u043A\u0435 \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F ''{0}'' \u0438\u0437-\u0437\u0430 \u043D\u0430\u043B\u0438\u0447\u0438\u044F \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u043D\u043E\u0433\u043E \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430 ({1}).
43X27.U=\u043F\u0440\u0438 \u0443\u0440\u043E\u0432\u043D\u0435 \u0438\u0437\u043E\u043B\u044F\u0446\u0438\u0438 {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u043A\u0438 \u0442\u0438\u043F\u0430 {1}
01500=\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 {0} \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B {1} \u043E\u0442\u0431\u0440\u043E\u0448\u0435\u043D\u043E.
43X45.U=\u041E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42Y09=\u041C\u0435\u0442\u043E\u0434\u044B Void \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 CALL.
42Z44.U=\u0423\u043F\u043E\u0440\u044F\u0434\u043E\u0447\u0435\u043D\u043D\u044B\u0435 \u043D\u0443\u043B\u0438
43X63.U=\u0421\u0442\u0440\u043E\u043A\u0430 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u043F\u043E \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u044E \u043A \u0431\u0430\u0437\u043E\u0432\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0435
42Y36=\u0421\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439.  \u0415\u0441\u043B\u0438 \u0434\u043B\u044F \u0441\u043F\u0438\u0441\u043A\u0430 SELECT \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F GROUP BY, \u0432 \u044D\u0442\u043E\u043C \u0441\u043F\u0438\u0441\u043A\u0435 \u043C\u043E\u0433\u0443\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0432 \u0433\u0440\u0443\u043F\u043F\u044B \u0438 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0446\u0438\u0438.  
43X81.U=\u0412\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043E \u0441\u0442\u0440\u043E\u043A
22011=\u0412\u0442\u043E\u0440\u043E\u0439 \u0438\u043B\u0438 \u0442\u0440\u0435\u0442\u0438\u0439 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 SUBSTR \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432\u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0433\u043E \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D\u0430.
42Y63=\u0414\u043B\u044F \u0445\u044D\u0448-\u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0438\u0440\u0443\u0435\u043C\u044B\u0439 \u043F\u0440\u0435\u0434\u0438\u043A\u0430\u0442 equijoin \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0432 \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u043E\u043C \u0438\u043D\u0434\u0435\u043A\u0441\u0435 \u0438\u043B\u0438 \u043A\u0443\u0447\u0435.  \u041E\u043F\u0442\u0438\u043C\u0438\u0437\u0438\u0440\u0443\u0435\u043C\u043E\u0433\u043E \u043F\u0440\u0435\u0434\u0438\u043A\u0430\u0442\u0430 equijoin \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0438 \u0434\u043B\u044F \u043E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0438\u043B\u0438 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 ''{0}''. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0442\u043E\u0440\u0430 ''index'', \u0447\u0442\u043E\u0431\u044B \u0437\u0430\u0434\u0430\u0442\u044C \u0442\u0430\u043A\u043E\u0439 \u0438\u043D\u0434\u0435\u043A\u0441 \u0438\u043B\u0438 \u043A\u0443\u0447\u0443 \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}''.
42Z80.U=\u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0443\u0435\u043C\u0430\u044F
42Y90=FOR UPDATE \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0442\u0438\u043F\u0430.  
42X37=\u0423\u043D\u0430\u0440\u043D\u044B\u0439 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 ''{0}'' \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0442\u0438\u043F\u0430 ''{1}''.
43Y17.U=\u041E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0441\u0442\u0440\u043E\u043A
42X64=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432 \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 (''{0}'') \u0434\u043B\u044F \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 useStatistics. \u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F\u043C\u0438 \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E TRUE \u0438 FALSE. 
24000=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0435 \u043A\u0443\u0440\u0441\u043E\u0440\u0430 - \u043D\u0435\u0442 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0441\u0442\u0440\u043E\u043A\u0438.
XIE0D.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u043D\u0430\u0439\u0442\u0438 \u0440\u0430\u0437\u0434\u0435\u043B\u0438\u0442\u0435\u043B\u044C \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 {0}.
42X91=\u0418\u043C\u044F \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 CREATE TABLE \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430. 
42Z26=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u0441 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E \u043D\u0435\u043B\u044C\u0437\u044F \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u043C.
