#Thu May 16 17:55:33 BRT 2013
43X37.U=pr\u00F3ximos qualificadores
42Z36.U=tempo para fechar (milissegundos)    \=
43X55.U=Varredura por ''hash''
22003=O valor resultante est\u00E1 fora da faixa para o tipo de dado {0}.
42Y55=''{0}'' n\u00E3o pode ser realizado em ''{1}'', porque ''{1}'' n\u00E3o existe.
42Z54.U=Esta exce\u00E7\u00E3o p\u00E1ra a instru\u00E7\u00E3o ap\u00F3s a an\u00E1lise - n\u00E3o \u00E9 necess\u00E1rio nenhum processamento posterior.
43X73.U=Varredura de tabela
42Y82=A instru\u00E7\u00E3o preparada armazenada gerada do sistema ''{0}'' n\u00E3o pode ser removida utilizando DROP STATEMENT, porque faz parte de um gatilho.
43X91.U=Normalizar ResultSet
42X29=A tabela de atualiza\u00E7\u00E3o ''{0}'' n\u00E3o \u00E9 destino do cursor ''{1}''.
42X56=O n\u00FAmero de colunas na lista de colunas da vis\u00E3o n\u00E3o corresponde ao n\u00FAmero de colunas na express\u00E3o de consulta subjacente da defini\u00E7\u00E3o de vis\u00E3o de ''{0}''.
42Z18=A coluna ''{0}'' faz parte de uma restri\u00E7\u00E3o da chave estrangeira ''{1}''. Para alterar o comprimento desta coluna, primeiro \u00E9 preciso remover a restri\u00E7\u00E3o, executar ALTER TABLE e, em seguida, recriar a restri\u00E7\u00E3o.
43Y09.U=ResultSet de varredura de \u00EDndice para {0} utilizando {1} {2}
42X83=As restri\u00E7\u00F5es na coluna ''{0}'' requerem que esta tanto permita quanto n\u00E3o permita valores nulos.
43Y27.U=Tempo de gera\u00E7\u00E3o
42Y19=''{0}'' aparece diversas vezes na lista GROUP BY. As colunas da lista GROUP BY n\u00E3o podem ser amb\u00EDguas.
42Z72=''{0}'' palavra(s)-chave SQL/XML ausente(s) na linha {1}, coluna {2}.
43Y45.U=100% do tempo de execu\u00E7\u00E3o, {0} segundos
42Y46=Lista de propriedades inv\u00E1lidas na lista FROM.  N\u00E3o h\u00E1 \u00EDndice ''{0}'' na tabela ''{1}''.
X0A00.S=A lista de sele\u00E7\u00E3o menciona a coluna ''{0}'' duas vezes. Isto n\u00E3o \u00E9 permitido em consultas contendo a cl\u00E1usula GROUP BY ou HAVING. Tente criar um ali\u00E1s para uma das colunas em conflito com um nome \u00FAnico.
42Z09.U=O valor padr\u00E3o da coluna para
43X28.U=informa\u00E7\u00F5es de varredura
43X46.U=ResultSet de jun\u00E7\u00E3o ''EXISTS'' por ''hash''
42X47=H\u00E1 v\u00E1rios procedimentos denominados ''{0}''. Utilize uma assinatura completa ou o nome espec\u00EDfico.
42X74=Sintaxe inv\u00E1lida da instru\u00E7\u00E3o CALL.
42Z45.U=Valor de retorno desconhecido
43X64.U=modo de inser\u00E7\u00E3o\: inser\u00E7\u00E3o em massa
01501=Removida a vis\u00E3o {0}.
43X82.U=Conjunto de resultados \u00E0 esquerda
42Z81.U=ler efetivado
07000=Pelo menos um par\u00E2metro da instru\u00E7\u00E3o corrente n\u00E3o foi inicializado.
42Y37=''{0}'' \u00E9 um primitivo Java e n\u00E3o pode ser utilizado com este operador.
42Z90=A classe ''{0}'' n\u00E3o retorna um ResultSet atualiz\u00E1vel.
22012=Tentativa de dividir por zero.
42Y64=O valor de bulkFetch ''{0}'' n\u00E3o \u00E9 v\u00E1lido. O valor m\u00EDnimo para bulkFetch \u00E9 1.
43Y18.U=Atualizar
XIE0E.S=Lido fim-de-arquivo em local n\u00E3o esperado na linha {0}.
22003.S.3=Ocorreu um estouro durante convers\u00E3o de tipo de dado num\u00E9rico de ''{0}'' para {1}.
22003.S.2=Decimais podem ter no m\u00E1ximo 31 d\u00EDgitos.
42Y91=N\u00E3o \u00E9 permitida a cl\u00E1usula USING em uma instru\u00E7\u00E3o EXECUTE para uma a\u00E7\u00E3o de gatilho.
22003.S.1=O ano ({0}) excede o m\u00E1ximo ''{1}''.
42X38=''SELECT *'' \u00E9 permitido apenas em subconsultas EXISTS e NOT EXISTS.
43Y54.U=Iniciar a a\u00E7\u00E3o referencial na tabela dependente n\u00FAmero
42X65=O \u00EDndice ''{0}'' n\u00E3o existe.
42X92=O nome da coluna ''{0}'' aparece mais de uma vez na lista de colunas da restri\u00E7\u00E3o.
42Z27=A coluna que aceita valores nulos, ''{0}'', n\u00E3o pode ser modificada para ter identidade como padr\u00E3o.
43X19.U=Excluir
XBCM1.S=Erro de liga\u00E7\u00E3o Java lan\u00E7ado durante o carregamento da classe {0} gerada.
