#Thu May 16 17:55:33 BRT 2013
43X37.U=\u043A\u0432\u0430\u043B\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 next
42Z36.U=\u0432\u0440\u0435\u043C\u044F \u0437\u0430\u043A\u0440\u044B\u0442\u0438\u044F (\u043C\u0441\u0435\u043A) \=
43X55.U=\u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0441 \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C
22003=\u041F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u043E\u0435 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432\u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0433\u043E \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D\u0430 \u0434\u043B\u044F \u0442\u0438\u043F\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 {0}.
42Y55=''{0}'' \u043D\u0435\u043B\u044C\u0437\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0434\u043B\u044F ''{1}'', \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u044D\u0442\u043E\u0442 \u043E\u0431\u044A\u0435\u043A\u0442 \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
42Z54.U=\u0414\u0430\u043D\u043D\u043E\u0435 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0435\u0442 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 \u043F\u043E\u0441\u043B\u0435 \u0430\u043D\u0430\u043B\u0438\u0437\u0430 - \u043D\u0438\u043A\u0430\u043A\u043E\u0439 \u0434\u0430\u043B\u044C\u043D\u0435\u0439\u0448\u0435\u0439 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u043D\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F.
43X73.U=\u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
42Y82=\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043B\u0430 \u0445\u0440\u0430\u043D\u0438\u043C\u044B\u0439 \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0439 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 ''{0}'', \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435\u043B\u044C\u0437\u044F \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C \u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 DROP. \u042D\u0442\u043E \u0447\u0430\u0441\u0442\u044C \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430. 
43X91.U=ResultSet - \u041D\u043E\u0440\u043C\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F
01006=\u041F\u043E\u043B\u043D\u043E\u043C\u043E\u0447\u0438\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F {0} \u043D\u0435 \u0430\u043D\u043D\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u044B.
42X29=\u041E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u043C \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u0443\u0440\u0441\u043E\u0440\u0430 ''{1}''.
42X56=\u0427\u0438\u0441\u043B\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0430 \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0435\u0442 \u0441 \u0447\u0438\u0441\u043B\u043E\u043C \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0432 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u043C \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0438 \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0432 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0438 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0430 \u0434\u043B\u044F ''{0}''.
42Z18=\u0421\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 ''{1}''. \u0427\u0442\u043E\u0431\u044B \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0434\u043B\u0438\u043D\u0443 \u044D\u0442\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u0430, \u043D\u0443\u0436\u043D\u043E \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435, \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435 ALTER TABLE, \u0430 \u0437\u0430\u0442\u0435\u043C \u0437\u0430\u043D\u043E\u0432\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435.
43Y09.U=ResultSet - \u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u0434\u043B\u044F {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C {1} {2}
42X83=\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0442\u0440\u0435\u0431\u0443\u044E\u0442, \u0447\u0442\u043E\u0431\u044B \u043E\u043D \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u044F\u0432\u043B\u044F\u043B\u0441\u044F \u0438 \u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u043C, \u0438 \u043D\u0435\u043E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u043C.
43Y27.U=\u0412\u0440\u0435\u043C\u044F \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42Z72=\u041E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0442 \u043A\u043B\u044E\u0447\u0435\u0432\u044B\u0435 \u0441\u043B\u043E\u0432\u0430 SQL/XML ''{0}'' \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 {1} \u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u0435 {2}.
43Y45.U=\u0412\u0440\u0435\u043C\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F 100%, {0} \u0441\u0435\u043A.
42Y46=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0441\u043F\u0438\u0441\u043E\u043A \u0441\u0432\u043E\u0439\u0441\u0442\u0432 \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 FROM.  \u0418\u043D\u0434\u0435\u043A\u0441\u0430 ''{0}'' \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
X0A00.S=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 Select \u0434\u0432\u0430\u0436\u0434\u044B \u0443\u043F\u043E\u043C\u0438\u043D\u0430\u0435\u0442\u0441\u044F \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}''. \u042D\u0442\u043E \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0432 \u0437\u0430\u043F\u0440\u043E\u0441\u0430\u0445 \u0441 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F\u043C\u0438 GROUP BY \u0438 HAVING. \u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043F\u0440\u0438\u0441\u0432\u043E\u0438\u0442\u044C \u043E\u0434\u043D\u043E\u043C\u0443 \u0438\u0437 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432, \u0432\u0441\u0442\u0443\u043F\u0438\u0432\u0448\u0438\u0445 \u0432 \u043A\u043E\u043D\u0444\u043B\u0438\u043A\u0442, \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u0435 \u0438\u043C\u044F.
42Z09.U=COLUMN DEFAULT \u0434\u043B\u044F
43X28.U=\u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u043E \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0438
43X46.U=ResultSet - \u041E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u0445\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42X47=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440 \u0441 \u0438\u043C\u0435\u043D\u0435\u043C ''{0}''. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043F\u043E\u043B\u043D\u0443\u044E \u0441\u0438\u0433\u043D\u0430\u0442\u0443\u0440\u0443 \u0438\u043B\u0438 \u043A\u043E\u043D\u043A\u0440\u0435\u0442\u043D\u043E\u0435 \u0438\u043C\u044F.
42X74=\u041D\u0435\u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0439 \u0441\u0438\u043D\u0442\u0430\u043A\u0441\u0438\u0441 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 CALL.
42Z45.U=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0435\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435
43X64.U=\u0440\u0435\u0436\u0438\u043C \u0432\u0441\u0442\u0430\u0432\u043A\u0438\: \u043C\u0430\u0441\u0441\u043E\u0432\u0430\u044F \u0432\u0441\u0442\u0430\u0432\u043A\u0430
01501=\u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440 {0} \u043E\u0442\u0431\u0440\u043E\u0448\u0435\u043D.
43X82.U=\u041B\u0435\u0432\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432
42Z81.U=\u0447\u0442\u0435\u043D\u0438\u0435 \u0441 \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u0435\u043C
07000=\u041D\u0435 \u0438\u043D\u0438\u0446\u0438\u0430\u043B\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u043D, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u0438\u043D \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430.
42Y37=''{0}'' \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u043F\u0440\u0438\u043C\u0438\u0442\u0438\u0432\u043D\u044B\u0439 \u0442\u0438\u043F Java \u0438 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0432 \u0441\u043E\u0447\u0435\u0442\u0430\u043D\u0438\u0438 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u043E\u043C.
42Z90=\u041A\u043B\u0430\u0441\u0441 ''{0}'' \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet), \u043F\u043E\u0434\u043B\u0435\u0436\u0430\u0449\u0438\u0439 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044E.
22012=\u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043D\u0430 \u043D\u043E\u043B\u044C.
42Y64=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 bulkFetch, \u0440\u0430\u0432\u043D\u043E\u0435 ''{0}'', \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C. \u041C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 bulkFetch \u0440\u0430\u0432\u043D\u043E 1.
43Y18.U=\u041E\u0431\u043D\u043E\u0432\u0438\u0442\u044C
XIE0E.S=\u041F\u0440\u043E\u0447\u0438\u0442\u0430\u043D \u043A\u043E\u043D\u0435\u0446 \u0444\u0430\u0439\u043B\u0430 (EOF) \u0432 \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E\u043C \u043C\u0435\u0441\u0442\u0435 \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 {0}.
22003.S.4=\u0414\u043B\u0438\u043D\u0430 ({0}) \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u0443\u044E \u0434\u043B\u0438\u043D\u0443 \u0434\u043B\u044F \u0442\u0438\u043F\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 ({1}).
22003.S.3=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0447\u0438\u0441\u043B\u043E\u0432\u043E\u0433\u043E \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u0442\u0438\u043F\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0438\u0437 ''{0}'' \u0432 {1}.
22003.S.2=\u0414\u0435\u0441\u044F\u0442\u0438\u0447\u043D\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043E 31 \u0440\u0430\u0437\u0440\u044F\u0434\u0430.
42Y91=\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F USING \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 EXECUTE STATEMENT \u0434\u043B\u044F \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u0430.
22003.S.1=\u0413\u043E\u0434 ({0}) \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{1}''.
42X38=''SELECT *'' \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043F\u043E\u0434\u0437\u0430\u043F\u0440\u043E\u0441\u0430\u0445 EXISTS \u0438 NOT EXISTS.
43Y54.U=\u041D\u0430\u0447\u0430\u043B\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u0430\u043C\u0438 \u0434\u043B\u044F \u043D\u043E\u043C\u0435\u0440\u0430 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
42X65=\u0418\u043D\u0434\u0435\u043A\u0441 ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
42X92=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430.
42Z27=\u041E\u0431\u043D\u0443\u043B\u044F\u0435\u043C\u044B\u0439 \u0441\u0442\u043E\u043B\u0431\u0435\u0446, ''{0}'', \u043D\u0435\u043B\u044C\u0437\u044F \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u0442\u044C, \u0442\u0430\u043A \u0447\u0442\u043E\u0431\u044B \u043E\u043D \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043B \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E.
43X19.U=\u0423\u0434\u0430\u043B\u0438\u0442\u044C
XBCM1.S=\u041E\u0448\u0438\u0431\u043A\u0430 \u0441\u0432\u044F\u0437\u044B\u0432\u0430\u043D\u0438\u044F Java \u043F\u0440\u0438 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u043A\u043B\u0430\u0441\u0441\u0430 {0}.
