#Thu May 16 17:55:33 BRT 2013
43X37.U=qualifiants next
42Z36.U=dur\u00E9e de fermeture (millisecondes) \=
43X55.U=Analyse du hachage
22003=La valeur r\u00E9sultante se situe hors de la fourchette admise pour le type de donn\u00E9es {0}.
42Y55=''{0}'' ne peut pas \u00EAtre ex\u00E9cut\u00E9 sur ''{1}'' parce qu''il n''existe pas.
42Z54.U=Cette exception arr\u00EAte l''instruction apr\u00E8s l''analyse syntaxique - aucun autre traitement n''est requis.
43X73.U=Analyse de table
42Y82=L''instruction pr\u00E9par\u00E9e stock\u00E9e ''{0}'' g\u00E9n\u00E9r\u00E9e par le syst\u00E8me ne peut pas \u00EAtre supprim\u00E9e \u00E0 l''aide de l''instruction DROP STATEMENT. Elle fait partie d''un d\u00E9clencheur. 
43X91.U=ResultSet normalis\u00E9
01006=Le privil\u00E8ge de l''utilisateur {0} n''a pas \u00E9t\u00E9 r\u00E9voqu\u00E9.
42X29=La table de mise \u00E0 jour ''{0}'' n''est pas la cible du curseur ''{1}''.
42X56=Le nombre de colonnes de la liste des colonnes de vue doit correspondre au nombre de colonnes de l''expression de requ\u00EAte sous-jacente dans la d\u00E9finition de vue pour ''{0}''.
42Z18=La colonne ''{0}'' fait partie d''une contrainte de cl\u00E9 externe ''{1}''. Pour modifier la longueur de cette colonne, vous devez d''abord supprimer la contrainte, ex\u00E9cuter ALTER TABLE, puis recr\u00E9er la contrainte.
43Y09.U=ResultSet d''analyse d''index pour {0} en utilisant {1} {2}
42X83=Les contraintes s''appliquant \u00E0 la colonne  ''{0}'' n\u00E9cessitent que cette derni\u00E8re contienne \u00E0 la fois des valeurs nulles et des valeurs non nulles.
43Y27.U=Dur\u00E9e de la g\u00E9n\u00E9ration
42Z72=Le ou les mots cl\u00E9s SQL/XML ''{0}'' \u00E0 la ligne {1}, colonne {2} sont manquants.
43Y45.U=Phase d''ex\u00E9cution 100%, {0} secondes
42Y46=Liste Propri\u00E9t\u00E9s non valide dans la liste FROM.  Il n''existe aucun index ''{0}'' sur la table ''{1}''.
X0A00.S=La liste de s\u00E9lection mentionne la colonne ''{0}'' deux fois. Ceci n''est pas autoris\u00E9 dans les requ\u00EAtes contenant des clauses GROUP BY ou HAVING. Essayez d''attribuer un nom unique \u00E0 l''une des colonnes en conflit.
42Z09.U=le COLUMN DEFAULT pour
43X28.U=informations d''analyse
43X46.U=ResultSet de jointure Exists par hachage
42X47=Il existe plusieurs proc\u00E9dures nomm\u00E9es ''{0}''. Utilisez la signature compl\u00E8te ou le nom sp\u00E9cifique.
42X74=Syntaxe de l''instruction CALL incorrecte.
42Z45.U=Valeur de retour inconnue
43X64.U=mode d''insertion \: insertion globale
01501=La vue {0} a \u00E9t\u00E9 supprim\u00E9e.
43X82.U=Ensemble de r\u00E9sultats de gauche
42Z81.U=lecture valid\u00E9e
07000=Au moins un param\u00E8tre de l''instruction en cours n''est pas initialis\u00E9.
42Y37=''{0}'' est de type Java primitif et ne peut pas \u00EAtre utilis\u00E9 avec cet op\u00E9rateur.
42Z90=La classe ''{0}'' ne renvoie pas d''ensemble de ResultSet pouvant \u00EAtre mis \u00E0 jour.
22012=Tentative de division par z\u00E9ro.
42Y64=La valeur bulkFetch de ''{0}'' n''est pas valide. La valeur minimale de bulkFetch est 1.
43Y18.U=Mettre \u00E0 jour
XIE0E.S=Fin de fichier lue en un point inattendu de la ligne {0}.
22003.S.4=La longueur ({0}) d\u00E9passe la longueur maximale ({1}) autoris\u00E9e pour le type de donn\u00E9es.
22003.S.3=Un d\u00E9passement de capacit\u00E9 s''est produit au cours de la conversion du type de donn\u00E9e num\u00E9rique de''{0}'' en {1}.
22003.S.2=Les nombres d\u00E9cimaux ne peuvent comporter que 31 d\u00E9cimales maximum.
42Y91=La clause USING n''est pas autoris\u00E9e dans un EXECUTE STATEMENT pour une action de d\u00E9clencheur.
22003.S.1=L''ann\u00E9e ({0}) d\u00E9passe le maximum, d\u00E9fini \u00E0 ''{1}''.
42X38=''SELECT *'' est uniquement autoris\u00E9 dans les sous-requ\u00EAtes EXISTS et NOT EXISTS.
43Y54.U=D\u00E9but de l''action de r\u00E9f\u00E9rentiel dans un num\u00E9ro de table d\u00E9pendante
42X65=L''index ''{0}'' n''existe pas.
42X92=Le nom de colonne ''{0}'' figure plusieurs fois dans la liste de de colonnes d''une contrainte.
42Z27=Une colonne pouvant prendre la valeur NULL, ''{0}'', ne peut pas \u00EAtre modifi\u00E9e pour prendre une valeur d''identit\u00E9 par d\u00E9faut.
43X19.U=Supprimer
XBCM1.S=Erreur de liaison Java \u00E9mise au cours du chargement de la classe g\u00E9n\u00E9r\u00E9e {0}.
