#Thu May 16 17:55:33 BRT 2013
43X37.U=next m\u0171velet min\u0151s\u00EDt\u0151i
42Z36.U=bez\u00E1r\u00E1si id\u0151pont (ezredm\u00E1sodperc) \=
43X55.U=Kivonatkeres\u00E9s
22003=Az eredm\u00E9ny\u00FCl kapott \u00E9rt\u00E9k k\u00EDv\u00FCl esik a(z) {0} adatt\u00EDpus tartom\u00E1ny\u00E1n.
42Y55=''{0}'' a(z) ''{1}'' elemen nem hajthat\u00F3 v\u00E9gre, mivel nem l\u00E9tezik.
42Z54.U=A kiv\u00E9tel elemz\u00E9s ut\u00E1n le\u00E1ll\u00EDtja az utas\u00EDt\u00E1st - tov\u00E1bbi feldolgoz\u00E1s nem sz\u00FCks\u00E9ges.
43X73.U=T\u00E1blakeres\u00E9s
42Y82=A rendszer \u00E1ltal el\u0151\u00E1ll\u00EDtott t\u00E1rolt el\u0151k\u00E9sz\u00EDtett ''{0}'' utas\u00EDt\u00E1s a DROP STATEMENT seg\u00EDts\u00E9g\u00E9vel nem sz\u00FCntethet\u0151 meg. Ez a trigger r\u00E9sze. 
43X91.U=ResultSet normaliz\u00E1l\u00E1sa
01006=A jogosults\u00E1g nem ker\u00FClt visszavon\u00E1sra a(z) {0} felhaszn\u00E1l\u00F3t\u00F3l.
42X29=A(z) ''{0}'' t\u00E1bla friss\u00EDt\u00E9se nem a(z) ''{1}'' kurzor c\u00E9lja.
42X56=A n\u00E9zet oszloplist\u00E1ban tal\u00E1lhat\u00F3 oszlopok sz\u00E1ma nem felel meg a(z) ''{0}'' n\u00E9zet meghat\u00E1roz\u00E1s\u00E1ban l\u00E9v\u0151 alapul szolg\u00E1l\u00F3 lek\u00E9rdez\u00E9s kifejez\u00E9s oszlopsz\u00E1m\u00E1nak.
42Z18=A(z) ''{0}'' oszlop a(z) ''{1}'' idegen kulcs megszor\u00EDt\u00E1s r\u00E9sze. Az oszlop hossz\u00E1nak megv\u00E1ltoztat\u00E1s\u00E1hoz el\u0151sz\u00F6r meg kell sz\u00FCntetni a megszor\u00EDt\u00E1st, v\u00E9gre kell hajtani az ALTER TABLE utas\u00EDt\u00E1st, majd \u00FAjb\u00F3l l\u00E9tre kell hozni a megszor\u00EDt\u00E1st.
43Y09.U=Indexkeres\u00E9si ResultSet a(z) {0} t\u00E1bl\u00E1hoz {1} {2} felhaszn\u00E1l\u00E1s\u00E1val
42X83=A(z) ''{0}'' oszlop megszor\u00EDt\u00E1sai szerint az oszlopnak nullk\u00E9pesnek \u00E9s nem nullk\u00E9pesnek egyar\u00E1nt lennie kell.
43Y27.U=El\u0151\u00E1ll\u00EDt\u00E1si id\u0151
42Z72=Hi\u00E1nyz\u00F3 ''{0}'' SQL/XML kulcssz\u00F3 a(z) {1}. sor {2}. oszlop\u00E1ban.
43Y45.U=Fut\u00E1si id\u0151 100 %, {0} m\u00E1sodperc
42Y46=\u00C9rv\u00E9nytelen tulajdons\u00E1gok lista a FROM list\u00E1ban.  A(z) ''{1}'' t\u00E1bl\u00E1n nem tal\u00E1lhat\u00F3 ''{0}'' index.
X0A00.S=A select lista a(z) ''{0}'' oszlopot k\u00E9tszer tartalmazza. Ez GROUP BY vagy HAVING r\u00E9szkifejez\u00E9st tartalmaz\u00F3 lek\u00E9rdez\u00E9sekben nem megengedett. Pr\u00F3b\u00E1ljon meg az egyik \u00FCtk\u00F6z\u0151 oszlopnak egyedi \u00E1lnevet adni.
42Z09.U=COLUMN DEFAULT \u00E9rt\u00E9ke
43X28.U=keres\u00E9si inform\u00E1ci\u00F3k
43X46.U=L\u00E9tez\u0151 kivonat join ResultSet
42X47=T\u00F6bb ''{0}'' nev\u0171 elj\u00E1r\u00E1s tal\u00E1lhat\u00F3. Teljes al\u00E1\u00EDr\u00E1s vagy az adott n\u00E9v haszn\u00E1lata.
42X74=\u00C9rv\u00E9nytelen CALL utas\u00EDt\u00E1s szintaxis.
42Z45.U=Ismeretlen visszat\u00E9r\u00E9si \u00E9rt\u00E9k
43X64.U=besz\u00FAr\u00E1si m\u00F3d\: t\u00F6meges besz\u00FAr\u00E1s
01501=A(z) {0} n\u00E9zet megsz\u00FCntetve.
43X82.U=Bal oldali eredm\u00E9nyhalmaz
42Z81.U=v\u00E9gleges\u00EDtett olvas\u00E1s
07000=Az aktu\u00E1lis utas\u00EDt\u00E1s legal\u00E1bb egy param\u00E9tere nem lett inizializ\u00E1lva.
42Y37=A(z) ''{0}'' egy Java primit\u00EDv \u00E9s oper\u00E1torral nem haszn\u00E1lhat\u00F3.
42Z90=A(z) ''{0}'' oszt\u00E1ly nem ad vissza friss\u00EDthet\u0151 ResultSet halmazt.
22012=Null\u00E1val oszt\u00E1sra t\u00F6rt\u00E9nt k\u00EDs\u00E9rlet.
42Y64=A(z) ''{0}'' bulkFetch \u00E9rt\u00E9ke \u00E9rv\u00E9nytelen. A bulkFetch minim\u00E1lis \u00E9rt\u00E9ke 1.
43Y18.U=Friss\u00EDt\u00E9s
XIE0E.S=endOfFile beolvas\u00E1s v\u00E1ratlan helyen a(z) {0} sorban.
22003.S.4=A(z) {0} hossz meghaladja a(z) {1} adatt\u00EDpus maxim\u00E1lis hossz\u00E1t.
22003.S.3=T\u00FAlcsordul\u00E1s t\u00F6rt\u00E9nt a(z) ''{0}'' numerikus adatt\u00EDpus \u00E1talak\u00EDt\u00E1sa sor\u00E1n a k\u00F6vetkez\u0151re\: {1}.
22003.S.2=A decim\u00E1lis \u00E9rt\u00E9k legfeljebb 31 sz\u00E1mjegy\u0171 lehet.
42Y91=A USING r\u00E9szkifejez\u00E9s a trigger m\u0171velet EXECUTE STATEMENT utas\u00EDt\u00E1s\u00E1ban nem megengedett.
22003.S.1=A(z) {0} \u00E9v meghaladja a maxim\u00E1lis ''{1}'' \u00E9rt\u00E9ket.
42X38=A ''SELECT *'' csak EXISTS \u00E9s NOT EXISTS allek\u00E9rdez\u00E9sekben megengedett.
43Y54.U=Hivatkoz\u00E1si tev\u00E9kenys\u00E9g ind\u00EDt\u00E1sa a f\u00FCgg\u0151 t\u00E1blasz\u00E1mon
42X65=A(z) ''{0}'' index nem l\u00E9tezik.
42X92=A(z) ''{0}'' oszlopn\u00E9v a megszor\u00EDt\u00E1s oszloplist\u00E1j\u00E1ban t\u00F6bbsz\u00F6r megjelenik.
42Z27=A(z) ''{0}'' nullk\u00E9pes oszlop nem m\u00F3dos\u00EDthat\u00F3, hogy alap\u00E9rtelmezett azonoss\u00E1ggal rendelkezzen.
43X19.U=T\u00F6rl\u00E9s
XBCM1.S=Java l\u00E1ncol\u00E1si hiba a(z) {0} el\u0151\u00E1ll\u00EDtott oszt\u00E1ly bet\u00F6lt\u00E9se sor\u00E1n.
