#Thu May 16 17:55:33 BRT 2013
43X37.U=calificadores next
42Z36.U=tiempo de cierre (milisegundos) \=
43X55.U=Exploraci\u00F3n hash
22003=El valor resultante queda fuera del rango para el tipo de datos {0}.
42Y55=No se puede realizar ''{0}'' sobre ''{1}'' porque no existe.
42Z54.U=Esta excepci\u00F3n detiene la sentencia despu\u00E9s de analizar; no se necesitan m\u00E1s procesos.
43X73.U=Exploraci\u00F3n de tabla
42Y82=La sentencia preparada almacenada generada por el sistema ''{0}'' no se puede eliminar mediante DROP STATEMENT. Es parte de un desencadenante. 
43X91.U=Normalizar ResultSet
01006=Privilegio no revocado del usuario {0}.
42X29=Actualizar la tabla ''{0}'' no es el destino del cursor ''{1}''.
42X56=El n\u00FAmero de columnas de la lista de columnas de la vista no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta subyacente en la definici\u00F3n de la vista para ''{0}''.
42Z18=La columna ''{0}'' forma parte de una restricci\u00F3n de clave for\u00E1nea ''{1}''. Para alterar la longitud de esta columna, primero debe eliminar la restricci\u00F3n, realizar ALTER TABLE y despu\u00E9s volver a crear la restricci\u00F3n.
43Y09.U=ResultSet de exploraci\u00F3n de \u00EDndice para {0} mediante {1} {2}
42X83=Las restricciones sobre la columna ''{0}'' requieren que acepte nulos y que no los acepte.
43Y27.U=Tiempo de generaci\u00F3n
42Z72=Falta(n) palabra(s) clave de SQL/XML ''{0}'' en la l\u00EDnea {1}, columna {2}.
43Y45.U=Tiempo de ejecuci\u00F3n 100%, {0} segundos
42Y46=Lista Properties no v\u00E1lida en lista FROM.  No existe ning\u00FAn \u00EDndice ''{0}'' en la tabla ''{1}''.
X0A00.S=La lista de selecci\u00F3n menciona la columna ''{0}'' dos veces. Esto no se permite en consultas con las cl\u00E1usulas GROUP BY o HAVING. Intente crear un alias de una de las columnas en conflicto que sea un nombre exclusivo.
42Z09.U=COLUMN DEFAULT para
43X28.U=informaci\u00F3n de exploraci\u00F3n
43X46.U=ResultSet de uni\u00F3n EXISTS hash
42X47=Existen varios procedimientos llamados ''{0}''. Utilice la signatura completa o el nombre espec\u00EDfico.
42X74=Sintaxis de la sentencia CALL no v\u00E1lida.
42Z45.U=Valor devuelto desconocido
43X64.U=modalidad de inserci\u00F3n\: inserci\u00F3n general
01501=Se ha eliminado la vista {0}.
43X82.U=Juego de resultados izquierdo
42Z81.U=lectura comprometida
07000=Al menos un par\u00E1metro de la sentencia actual no est\u00E1 inicializado.
42Y37=''{0}'' es un primitivo Java y no puede utilizarse con este operador.
42Z90=La clase ''{0}'' no devuelve un ResultSet actualizable.
22012=Intento de divisi\u00F3n por cero.
42Y64=El valor de bulkFetch de ''{0}'' no es v\u00E1lido. El valor m\u00EDnimo para bulkFetch es 1.
43Y18.U=Actualizar
XIE0E.S=Se ha le\u00EDdo un fin de archivo en un lugar inesperado de la l\u00EDnea {0}.
22003.S.4=La longitud de ({0}) excede la longitud m\u00E1xima para el tipo de datos ({1}).
22003.S.3=Se ha producido un desbordamiento durante la conversi\u00F3n del tipo de datos num\u00E9rico de ''{0}'' a {1}.
22003.S.2=El decimal s\u00F3lo puede tener un m\u00E1ximo de 31 d\u00EDgitos.
42Y91=La cl\u00E1usula USING no se permite en EXECUTE STATEMENT de una acci\u00F3n de desencadenante.
22003.S.1=El a\u00F1o ({0}) excede el m\u00E1ximo ''{1}''.
42X38=''SELECT *'' s\u00F3lo est\u00E1 permitido en subconsultas EXISTS y NOT EXISTS.
43Y54.U=Iniciar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente
42X65=El \u00EDndice ''{0}'' no existe.
42X92=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en una lista de columnas de la restricci\u00F3n.
42Z27=Una columna que acepta nulos, ''{0}'', no puede modificarse para que tenga un valor por omisi\u00F3n de identidad.
43X19.U=Suprimir
XBCM1.S=Error de enlace Java generado durante la carga de la clase generada {0}.
