#Thu May 16 17:55:33 BRT 2013
43X37.U=Qualifikationsmerkmale f\u00FCr next
42Z36.U=Zeit f\u00FCr close (Millisekunden) \=
43X55.U=Hash-Suche
22003=Der resultierende Wert liegt au\u00DFerhalb des Bereichs f\u00FCr den Datentyp {0}.
42Y55=''{0}'' kann nicht f\u00FCr ''{1}'' ausgef\u00FChrt werden, da dieses Objekt nicht vorhanden ist.
42Z54.U=Diese Ausnahme stoppt die Anweisung nach der Syntaxanalyse. Es ist keine weitere Verarbeitung erforderlich.
43X73.U=Tabellensuche
42Y82=Die vom System generierte gespeicherte vorbereitete Anweisung ''{0}'' kann mit DROP STATEMENT nicht gel\u00F6scht werden. Sie geh\u00F6rt zu einem Ausl\u00F6ser.
43X91.U=ResultSet normalisieren
01006=Die Berechtigung wurde dem Benutzer {0} nicht entzogen.
42X29=Die zu aktualisierende Tabelle ''{0}'' ist nicht die Zieltabelle des Cursors ''{1}''.
42X56=Die Spaltenanzahl in der angezeigten Spaltenliste stimmt nicht mit der Spaltenanzahl im zugrundeliegen Abfrageausdruck in der Anzeigedefinition f\u00FCr ''{0}'' \u00FCberein.
42Z18=Die Spalte ''{0}'' geh\u00F6rt zur Integrit\u00E4tsbedingung ''{1}'' f\u00FCr Fremdschl\u00FCssel. Wenn Sie die L\u00E4nge dieser Spalte \u00E4ndern m\u00F6chten, sollten Sie zun\u00E4chst die Integrit\u00E4tsbedingung l\u00F6schen. F\u00FChren Sie dann ALTER TABLE aus und erstellen Sie die Integrit\u00E4tsbedingung neu.
43Y09.U=ResultSet der Indexsuche f\u00FCr {0} unter Verwendung von {1} {2}
42X83=Die Integrit\u00E4tsbedingungen f\u00FCr die Spalte ''{0}'' erfordern, dass f\u00FCr die Spalte sowohl Eintragspflicht als auch keine Eintragspflicht gilt.
43Y27.U=Generierungszeit
42Z72=Fehlende SQL/XML-Schl\u00FCsselw\u00F6rter ''{0}'' in Zeile {1}, Spalte {2}
43Y45.U=Laufzeit 100 %, {0} Sekunden
42Y46=Ung\u00FCltige Merkmalliste in FROM-Liste. F\u00FCr die Tabelle ''{1}'' gibt es keinen Index ''{0}''.
X0A00.S=Die Auswahlliste enth\u00E4lt zweimal die Spalte ''{0}''. In Abfragen mit der Klausel GROUP BY oder HAVING ist dies nicht zul\u00E4ssig. Verwenden Sie f\u00FCr eine der in Konflikt stehenden Spalten einen Aliasnamen, um eindeutige Spaltennamen zu erhalten.
42Z09.U=COLUMN DEFAULT f\u00FCr
43X28.U=Suchinformationen
43X46.U=ResultSet f\u00FCr EXISTS-Verkn\u00FCpfung von Hash-Eintr\u00E4gen
42X47=Es gibt mehrere Prozeduren mit dem Namen ''{0}''. Verwenden Sie die vollst\u00E4ndige Signatur oder den spezifischen Namen.
42X74=Ung\u00FCltige Syntax f\u00FCr Anweisung CALL.
42Z45.U=Unbekannter R\u00FCckgabewert
43X64.U=Einf\u00FCgemodus\: Einf\u00FCgen von Massendaten
01501=Die Ansicht {0} wurde gel\u00F6scht.
43X82.U=Linke Ergebnisliste
42Z81.U=READ COMMITED
07000=Mindestens ein Parameter der aktuellen Anweisung wurde nicht initialisiert.
42Y37=''{0}'' ist ein Java-Primitive-Typ und kann nicht mit diesem Operator verwendet werden.
42Z90=Die Klasse ''{0}'' gibt kein aktualisierbares ResultSet zur\u00FCck.
22012=Es wurde eine Division durch null versucht.
42Y64=Der bulkFetch-Wert ''{0}'' ist ung\u00FCltig. der Mindestwert f\u00FCr bulkFetch ist 1.
43Y18.U=Aktualisieren
XIE0E.S=In Zeile {0} wurde an unerwarteter Stelle ein Dateiende gelesen.
22003.S.4=Die L\u00E4nge ({0}) \u00FCberschreitet das Maximum f\u00FCr den Datentyp ({1}).
22003.S.3=Bei der Konvertierung eines numerischen Datentyps von ''{0}'' in {1} ist es zu einem \u00DCberlauf gekommen.
22003.S.2=Eine Dezimalzahl darf nicht mehr als 31 Stellen haben.
42Y91=Die USING-Klausel ist in EXECUTE STATEMENT f\u00FCr eine Ausl\u00F6seaktion nicht zul\u00E4ssig.
22003.S.1=Die Jahresangabe ({0}) \u00FCberschreitet den Maximalwert ''{1}''.
42X38=''SELECT *'' ist nur in den Unterabfragen EXISTS und NOT EXISTS zul\u00E4ssig.
43Y54.U=Referenzielle Aktion f\u00FCr abh\u00E4ngige Tabelle beginnen
42X65=Der Index ''{0}'' ist nicht vorhanden.
42X92=Der Spaltenname ''{0}'' erscheint mehr als einmal in der Spaltenliste einer Integrit\u00E4tsbedingung.
42Z27=F\u00FCr die Spalte ''{0}'' ohne Eintragspflicht kann keine Standardidentit\u00E4t festgelegt werden.
43X19.U=L\u00F6schen
XBCM1.S=Beim Laden der generierten Klasse {0} wurde ein Java-Verbindungsfehler ausgel\u00F6st.
