#Thu May 16 17:55:33 BRT 2013
43X37.U=kvalifik\u00E1tory vr\u00E1cen\u00E9 operac\u00ED next
42Z36.U=\u010Das zav\u0159en\u00ED (milisekundy) \=
43X55.U=Transforma\u010Dn\u00ED skenov\u00E1n\u00ED
22003=V\u00FDsledn\u00E1 hodnota je mimo rozsah pro datov\u00FD typ {0}.
42Y55=''{0}'' nelze prov\u00E9st v ''{1}'', proto\u017Ee neexistuje.
42Z54.U=Tato v\u00FDjimka zastav\u00ED p\u0159\u00EDkaz po anal\u00FDze - nen\u00ED pot\u0159ebn\u00E9 \u017E\u00E1dn\u00E9 dal\u0161\u00ED zpracov\u00E1n\u00ED.
43X73.U=Skenov\u00E1n\u00ED tabulky
42Y82=Syst\u00E9m generoval ulo\u017Een\u00FD p\u0159ipraven\u00FD p\u0159\u00EDkaz ''{0}'', kter\u00FD nelze uvolnit pomoc\u00ED p\u0159\u00EDkazu DROP. Jedn\u00E1 se o sou\u010D\u00E1st triggeru. 
43X91.U=Normalizovat rozhran\u00ED ResultSet
01006=Opr\u00E1vn\u011Bn\u00ED nebylo od u\u017Eivatele {0} odvol\u00E1no.
42X29=Aktualizace tabulky ''{0}'' nen\u00ED c\u00EDlem kurzoru ''{1}''.
42X56=Po\u010Det sloupc\u016F v seznamu sloupc\u016F pohledu neodpov\u00EDd\u00E1 po\u010Dtu sloupc\u016F v z\u00E1kladn\u00EDm v\u00FDrazu dotazu v definici pohledu pro ''{0}''.
42Z18=Sloupec ''{0}'' je sou\u010D\u00E1st\u00ED omezen\u00ED ciz\u00EDho kl\u00ED\u010De ''{1}''. Abyste mohli pozm\u011Bnit d\u00E9lku tohoto sloupce, nejprve byste m\u011Bli uvolnit omezen\u00ED, prov\u00E9st p\u0159\u00EDkaz ALTER TABLE, a potom znovu vytvo\u0159it omezen\u00ED.
43Y09.U=Rozhran\u00ED ResultSet skenov\u00E1n\u00ED indexu pro {0} pomoc\u00ED {1} {2}
42X83=Omezen\u00ED sloupce ''{0}'' vy\u017Eaduj\u00ED, aby byly p\u0159evediteln\u00E9 i nep\u0159evediteln\u00E9 na hodnotu ''null''.
43Y27.U=\u010Cas generov\u00E1n\u00ED
42Z72=Chyb\u00ED kl\u00ED\u010Dov\u00E9 slovo(a) SQL/XML ''{0}'' v \u0159\u00E1dku {1}, sloupci {2}.
43Y45.U=\u010Cas spu\u0161t\u011Bn\u00ED 100%, {0} sekund
42Y46=Neplatn\u00FD seznam Vlastnosti v seznamu FROM. V tabulce ''{1}'' nen\u00ED index ''{0}''.
X0A00.S=Seznam pro v\u00FDb\u011Br uv\u00E1d\u00ED sloupec ''{0}'' dvakr\u00E1t. To nen\u00ED povoleno v dotazech s klauzulemi GROUP BY nebo HAVING. Zkuste vytvo\u0159it alias pro jeden z konfliktn\u00EDch sloupc\u016F, aby m\u011Bl jedine\u010Dn\u00E9 jm\u00E9no.
42Z09.U=COLUMN DEFAULT pro
43X28.U=informace o skenov\u00E1n\u00ED
43X46.U=Ha\u0161ovat existuj\u00EDc\u00ED rozhran\u00ED ResultSet slou\u010Den\u00ED
42X47=Existuje n\u011Bkolik procedur pojmenovan\u00FDch ''{0}''. Pou\u017Eijte \u00FApln\u00E9 ozna\u010Den\u00ED nebo ur\u010Dit\u00E9 jm\u00E9no.
42X74=Neplatn\u00E1 syntaxe p\u0159\u00EDkazu CALL.
42Z45.U=Nezn\u00E1m\u00E1 n\u00E1vratov\u00E1 hodnota
43X64.U=re\u017Eim vkl\u00E1d\u00E1n\u00ED\: hromadn\u00E9 vkl\u00E1d\u00E1n\u00ED
01501=Pohled {0} byl uvoln\u011Bn.
43X82.U=Lev\u00E1 mno\u017Eina v\u00FDsledk\u016F
42Z81.U=\u010Dten\u00ED potvrzeno
07000=Alespo\u0148 jeden parametr aktu\u00E1ln\u00EDho p\u0159\u00EDkazu nen\u00ED inicializov\u00E1n.
42Y37=''{0}'' je primitivum Javy a nelze jej pou\u017E\u00EDt s t\u00EDmto oper\u00E1torem.
42Z90=T\u0159\u00EDda ''{0}'' nevrac\u00ED mno\u017Einu v\u00FDsledk\u016F, kterou lze aktualizovat.
22012=Pokus o d\u011Blen\u00ED nulou.
42Y64=Hodnota bulkFetch ''{0}'' je neplatn\u00E1. Minim\u00E1ln\u00ED hodnota pro bulkFetch je 1.
43Y18.U=Aktualizovat
XIE0E.S=Byl na\u010Dten konec souboru na neo\u010Dek\u00E1van\u00E9m m\u00EDst\u011B na \u0159\u00E1dku {0}.
22003.S.4=D\u00E9lka ({0}) p\u0159ekra\u010Duje maxim\u00E1ln\u00ED d\u00E9lku pro datov\u00FD typ ({1}).
22003.S.3=Vyskytlo se p\u0159ete\u010Den\u00ED b\u011Bhem konverze \u010D\u00EDseln\u00E9ho datov\u00E9ho typu ''{0}'' na {1}.
22003.S.2=Des\u00EDtkov\u00E9 \u010D\u00EDslo m\u016F\u017Ee m\u00EDt maxim\u00E1ln\u011B 31 \u010D\u00EDslic.
42Y91=Klauzule USING nen\u00ED povolena v p\u0159\u00EDkazu EXECUTE pro akci triggeru.
22003.S.1=Rok ({0}) p\u0159ekra\u010Duje maximum ''{1}''.
42X38=P\u0159\u00EDkaz ''SELECT *'' je povolen pouze v poddotazech EXISTS a NOT EXISTS.
43Y54.U=Za\u010D\u00EDt referen\u010Dn\u00ED akci v \u010D\u00EDsle z\u00E1visl\u00E9 tabulky
42X65=Index ''{0}'' neexistuje.
42X92=Jm\u00E9no sloupce ''{0}'' se objevuje v\u00EDce ne\u017E jednou v seznamu sloupc\u016F omezen\u00ED.
42Z27=Sloupec ''{0}'', kter\u00FD m\u016F\u017Ee nab\u00FDvat hodnoty ''null'', nelze modifikovat, aby obsahoval p\u0159edvolbu toto\u017Enosti.
43X19.U=Vymazat
XBCM1.S=Do\u0161lo k chyb\u011B propojov\u00E1n\u00ED Javy b\u011Bhem zav\u00E1d\u011Bn\u00ED generovan\u00E9 t\u0159\u00EDdy {0}.
