#Thu May 16 17:55:33 BRT 2013
42Z55.U=A v\u00E9grehajt\u00E1s a StopAfterParsing hibakeres\u00E9si jelz\u0151 \u00E1ltali feldolgoz\u00E1s ut\u00E1n le\u00E1llt.
43X74.U=Indexkeres\u00E9s
42Y29=A nem csoportos\u00EDtott lek\u00E9rdez\u00E9s SELECT list\u00E1ja legal\u00E1bb egy \u00E9rv\u00E9nytelen kifejez\u00E9st tartalmaz. Ha a SELECT lista legal\u00E1bb egy \u00F6sszes\u00EDt\u00E9st tartalmaz, akkor minden bejegyz\u00E9snek \u00E9rv\u00E9nyes \u00F6sszes\u00EDt\u0151 kifejez\u00E9snek kell lennie.
43X92.U=Egyszeri ResultSet
08000=A kapcsolatot ismeretlen megszak\u00EDt\u00E1s lez\u00E1rta.
42Y56=\u00C9rv\u00E9nytelen ''{0}'' \u00F6sszef\u00E9s\u00FCl\u00E9si strat\u00E9gia lett megadva a(z) ''{1}'' tulajdons\u00E1gok list\u00E1j\u00E1ban. Az \u00F6sszef\u00E9s\u00FCl\u00E9s strat\u00E9gia \u00E1ltal jelenleg t\u00E1mogatott \u00E9rt\u00E9kek\: ''hash'' \u00E9s ''nestedloop''.
42Y83=Nem t\u00EDpusos null {0} \u00F6sszes\u00EDt\u00E9s argumentumak\u00E9nt nem megengedett.  Alak\u00EDtsa \u00E1t a null \u00E9rt\u00E9ket megfelel\u0151 t\u00EDpusra.
43Y28.U=Ford\u00EDt\u00E1si id\u0151
42X57=A getColumnCount() a(z) ''{0}'' k\u00FCls\u0151 virtu\u00E1lis t\u00E1bl\u00E1hoz ''{1}'' \u00E9rv\u00E9nytelen \u00E9rt\u00E9ket adott vissza.  Az \u00E9rv\u00E9nyes \u00E9rt\u00E9kek nem kisebbek 1-n\u00E9l. 
42Z19=A(z) ''{0}'' oszlopra legal\u00E1bb egy ''{1}'' idegen kulcs megszor\u00EDt\u00E1s fog hivatkozni. Az oszlop hossz\u00E1nak megv\u00E1ltoztat\u00E1s\u00E1hoz el\u0151sz\u00F6r meg kell sz\u00FCntetni a hivatkoz\u00F3 megszor\u00EDt\u00E1sokat, v\u00E9gre kell hajtani az ALTER TABLE utas\u00EDt\u00E1st, majd \u00FAjb\u00F3l l\u00E9tre kell hozni a megszor\u00EDt\u00E1st. 
43Y46.U=VTI ResultSet besz\u00FAr\u00E1sa
42X84=A(z) ''{0}'' l\u00E9trehoz\u00E1sra ker\u00FClt a(z) ''{1}'' megszor\u00EDt\u00E1s foganatos\u00EDt\u00E1sa \u00E9rdek\u00E9ben.  Ez csak a megszor\u00EDt\u00E1s megsz\u00FCntet\u00E9s\u00E9vel sz\u00FCntethet\u0151 meg.
25001=A kapcsolat nem z\u00E1rhat\u00F3 le, am\u00EDg van akt\u00EDv tranzakci\u00F3.
42Z73=\u00C9rv\u00E9nytelen XMLSERIALIZE c\u00E9lt\u00EDpus\: ''{0}''.
43X29.U=Az elk\u00FCl\u00F6n\u00EDtett oszlop egy oszlopsz\u00E1m
43X47.U=Kivonat join
42Z46.U=\u00D6sszehasonl\u00EDt\u00E1si eredm\u00E9ny neg\u00E1l\u00E1sa
43X65.U=besz\u00FAr\u00E1si m\u00F3d\: norm\u00E1l (a t\u00F6meges besz\u00FAr\u00E1s nem \u00FCres t\u00E1bla miatt nem hajthat\u00F3 v\u00E9gre)
43X83.U=Jobb oldali eredm\u00E9nyhalmaz
42X48=A(z) ''{1}'' \u00E9rv\u00E9nytelen pontoss\u00E1g a(z) {0} elemhez.
42X75=A(z) {0}({1}) al\u00E1\u00EDr\u00E1shoz nem tal\u00E1lhat\u00F3 konstruktor.  Elk\u00E9pzelhet\u0151, hogy a param\u00E9tert\u00EDpusok nem alak\u00EDthat\u00F3k met\u00F3dush\u00EDv\u00E1ss\u00E1.
42Z82.U=kiz\u00E1r\u00F3lagos
01502=A(z) {1} t\u00E1bla {0} triggere megsz\u00FCntetve.
43Y19.U={0} VTI ResultSet fel\u00FClete
42Y38=insertMode \= helyettes\u00EDt\u00E9s olyan besz\u00FAr\u00E1s eset\u00E9n nem megengedett, amelyben a SELECT r\u00E9szkifejez\u00E9sben a(z) ''{0}'' c\u00E9lt\u00E1bl\u00E1ra mutat\u00F3 hivatkoz\u00E1s tal\u00E1lhat\u00F3.
42Z91=allek\u00E9rdez\u00E9s
22013=''{0}'' negat\u00EDv sz\u00E1mb\u00F3l n\u00E9gyzetgy\u00F6k von\u00E1s\u00E1ra t\u00F6rt\u00E9nt k\u00EDs\u00E9rlet.
43Y55.U=Hivatkoz\u00E1si tev\u00E9kenys\u00E9g ind\u00EDt\u00E1sa a f\u00FCgg\u0151 t\u00E1blasz\u00E1mon
42Y65=A bulkFetch ''{0}'' \u00F6sszef\u00E9s\u00FCl\u00E9seken nem megengedettek.
42X39=Az allek\u00E9rdez\u00E9s csak egy oszlopot adhat vissza.
42Y92={0} trigger csak {1} \u00E1tmenet v\u00E1ltoz\u00F3kra/t\u00E1bl\u00E1kra hivatkozhat.
XBCM2.S=Nem hozhat\u00F3 l\u00E9tre a(z) {0} el\u0151\u00E1ll\u00EDtott oszt\u00E1ly p\u00E9ld\u00E1nya.
43X38.U={0} fel\u00FCleten {1} haszn\u00E1lat\u00E1val
42X66=A(z) ''{0}'' oszlopn\u00E9v a CREATE INDEX utas\u00EDt\u00E1sban t\u00F6bbsz\u00F6r lett megadva.
42X93=A(z) ''{0}'' t\u00E1bla tartalmaz a t\u00E1bl\u00E1ban nem tal\u00E1lhat\u00F3 ''{1}'' oszloppal rendelkez\u0151 megszor\u00EDt\u00E1s-meghat\u00E1roz\u00E1st.
42Z37.U=Nincs
43X56.U=Csatolt allek\u00E9rdez\u00E9sek
