#Thu May 16 17:55:33 BRT 2013
42Z55.U=StopAfterParsing \u30C7\u30D0\u30C3\u30B0\u30FB\u30D5\u30E9\u30B0\u306B\u3088\u308B\u69CB\u6587\u89E3\u6790\u5F8C\u3001\u5B9F\u884C\u304C\u505C\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
43X74.U=\u7D22\u5F15\u30B9\u30AD\u30E3\u30F3
42Y29=\u30B0\u30EB\u30FC\u30D7\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u7167\u4F1A\u306E SELECT \u30EA\u30B9\u30C8\u306B\u3001\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u7121\u52B9\u306A\u5F0F\u304C\u3042\u308A\u307E\u3059\u3002 SELECT \u30EA\u30B9\u30C8\u306B\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u96C6\u5408\u4F53\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3059\u3079\u3066\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u6709\u52B9\u306A\u96C6\u5408\u4F53\u5F0F\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
43X92.U=\u4E00\u56DE ResultSet
42Y56=\u8868 ''{1}'' \u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30EA\u30B9\u30C8\u306B\u7121\u52B9\u306A\u7D50\u5408\u30B9\u30C8\u30E9\u30C6\u30B8 ''{0}'' \u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002 \u7D50\u5408\u30B9\u30C8\u30E9\u30C6\u30B8\u306B\u5BFE\u3057\u3066\u73FE\u5728\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u5024\: ''hash'' \u304A\u3088\u3073 ''nestedloop''\u3002
08000=\u4E0D\u660E\u306E\u5272\u308A\u8FBC\u307F\u306B\u3088\u308A\u3001\u63A5\u7D9A\u304C\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u307E\u3057\u305F\u3002
42Y83=\u578B\u306E\u306A\u3044 NULL \u306F\u3001\u96C6\u5408\u4F53 {0} \u306E\u5F15\u6570\u3068\u3057\u3066\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002  NULL \u3092\u9069\u5207\u306A\u578B\u306B\u30AD\u30E3\u30B9\u30C8\u3057\u3066\u304F\u3060\u3055\u3044\u3002
01007=\u30ED\u30FC\u30EB {0} \u304C\u8A8D\u8A3C ID {1} \u304B\u3089\u53D6\u308A\u6D88\u3055\u308C\u307E\u305B\u3093\u3002
43Y28.U=\u30B3\u30F3\u30D1\u30A4\u30EB\u6642\u9593
42X57=\u5916\u90E8\u4EEE\u60F3\u8868 ''{0}'' \u306E getColumnCount() \u304C\u7121\u52B9\u306A\u5024 ''{1}'' \u3092\u623B\u3057\u307E\u3057\u305F\u3002  \u6709\u52B9\u5024\u306F 1 \u4EE5\u4E0A\u3067\u3059\u3002 
42Z19=\u5217 ''{0}'' \u306F\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u5916\u90E8\u30AD\u30FC\u5236\u7D04 ''{1}'' \u306B\u3088\u308A\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002 \u3053\u306E\u5217\u306E\u9577\u3055\u3092\u5909\u66F4\u3059\u308B\u306B\u306F\u3001\u307E\u305A\u53C2\u7167\u5236\u7D04\u3092\u30C9\u30ED\u30C3\u30D7\u3057\u3001ALTER TABLE \u3092\u5B9F\u884C\u3057\u3066\u304B\u3089\u3001\u5236\u7D04\u3092\u518D\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
43Y46.U=\u633F\u5165 VTI ResultSet
42X84=\u5236\u7D04 ''{1}'' \u3092\u5F37\u5236\u3059\u308B\u305F\u3081\u306B\u7D22\u5F15 ''{0}'' \u304C\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002  \u3053\u306E\u7D22\u5F15\u3092\u30C9\u30ED\u30C3\u30D7\u3059\u308B\u552F\u4E00\u306E\u65B9\u6CD5\u306F\u3001\u3053\u306E\u5236\u7D04\u3092\u30C9\u30ED\u30C3\u30D7\u3059\u308B\u3053\u3068\u3067\u3059\u3002
25001=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u307E\u3060\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u3068\u304D\u306B\u63A5\u7D9A\u3092\u30AF\u30ED\u30FC\u30BA\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42Z73=XMLSERIALIZE \u306B\u7121\u52B9\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u30BF\u30A4\u30D7\: ''{0}''\u3002
43X29.U=\u7279\u6B8A\u5217\u306F\u5217\u756A\u53F7
43X47.U=\u30CF\u30C3\u30B7\u30E5\u7D50\u5408
42Z46.U=\u6BD4\u8F03\u7D50\u679C\u306E\u5426\u5B9A
43X65.U=\u633F\u5165\u30E2\u30FC\u30C9\: \u901A\u5E38 (\u7A7A\u3067\u306A\u3044\u8868\u306E\u305F\u3081\u3001\u30D0\u30EB\u30AF\u633F\u5165\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093)
43X83.U=\u53F3\u65B9\u7D50\u679C\u30BB\u30C3\u30C8
42X48=\u5024 ''{1}'' \u306F {0} \u306E\u6709\u52B9\u306A\u7CBE\u5EA6\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
42X75=\u30B7\u30B0\u30CB\u30C1\u30E3\u30FC {0}({1}) \u3092\u6301\u3064\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002  \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u578B\u304C\u30E1\u30BD\u30C3\u30C9\u8D77\u52D5\u5909\u63DB\u53EF\u80FD\u3067\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
42Z82.U=\u6392\u4ED6\u7684
01502=\u8868 {1} \u306E\u30C8\u30EA\u30AC\u30FC {0} \u304C\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
25001.S.1=\u7121\u52B9\u306A\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u72B6\u614B\u3067\u3059\u3002SQL \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30A2\u30AF\u30C6\u30A3\u30D6\u3067\u3059\u3002
43Y19.U={0} \u306E\u305F\u3081\u306E VTI ResultSet
42Y38=insertMode \= replace \u306F\u3001\u30BF\u30FC\u30B2\u30C3\u30C8\u8868 ''{0}'' \u304C SELECT \u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u308B\u5834\u6240\u3067\u306E\u633F\u5165\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Z91=\u526F\u7167\u4F1A
22013=\u8CA0\u306E\u6570\u5024 ''{0}'' \u306E\u5E73\u65B9\u6839\u3092\u53D6\u308D\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002
42Y65=bulkFetch \u306F\u3001''{0}'' \u7D50\u5408\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
43Y55.U=\u5F93\u5C5E\u8868\u756A\u53F7\u306B\u5BFE\u3059\u308B\u53C2\u7167\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u7D42\u4E86
42X39=\u526F\u7167\u4F1A\u306F\u3001\u5358\u4E00\u5217\u3092\u623B\u3059\u3053\u3068\u3057\u304B\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Y92={0} \u30C8\u30EA\u30AC\u30FC\u306F\u3001{1} \u9077\u79FB\u5909\u6570/\u8868\u3057\u304B\u53C2\u7167\u3067\u304D\u307E\u305B\u3093\u3002
XBCM2.S=\u751F\u6210\u3055\u308C\u305F\u30AF\u30E9\u30B9 {0} \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
43X38.U={1} \u3092\u4F7F\u7528\u3057\u3066 {0} \u4E0A\u3067
42X66=\u5217\u540D ''{0}'' \u306F\u3001CREATE INDEX \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u8907\u6570\u56DE\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
42X93=\u8868 ''{0}'' \u306B\u306F\u3001\u3053\u306E\u8868\u306B\u306A\u3044\u5217 ''{1}'' \u3092\u6301\u3064\u5236\u7D04\u5B9A\u7FA9\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
42Z37.U=\u306A\u3057
43X56.U=\u30A2\u30BF\u30C3\u30C1\u3055\u308C\u305F\u526F\u7167\u4F1A
