#Thu May 16 17:55:33 BRT 2013
42Z55.U=Ejecuci\u00F3n detenida despu\u00E9s de analizar mediante el distintivo de depuraci\u00F3n StopAfterParsing.
43X74.U=Exploraci\u00F3n de \u00EDndice
42Y29=La lista SELECT de una consulta no agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Cuando la lista SELECT contiene al menos una agregaci\u00F3n entonces todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas.
43X92.U=ResultSet una vez
42Y56=Se ha especificado una estrategia de uni\u00F3n ''{0}'' en la lista Properties de la tabla ''{1}''. Los valores actualmente soportados para una estrategia de uni\u00F3n son\: ''hash'' y ''nestedloop''.
08000=Conexi\u00F3n cerrada por una interrupci\u00F3n desconocida.
42Y83=No se permite un nulo sin tipo como argumento del agregado {0}.  Convierta el nulo a un tipo adecuado.
01007=La funci\u00F3n {0} no se ha revocado del ID de autenticaci\u00F3n {1}.
43Y28.U=Tiempo de compilaci\u00F3n
42X57=getColumnCount() de la tabla virtual externa ''{0}'' ha devuelto un valor no v\u00E1lido ''{1}''.  Los valores v\u00E1lidos son mayores o iguales que 1. 
42Z19=La columna ''{0}'' est\u00E1 referenciada por al menos una restricci\u00F3n de clave for\u00E1nea ''{1}''. Para alterar la longitud de esta columna, debe eliminar las restricciones de referencia, realizar ALTER TABLE y despu\u00E9s volver a crear las restricciones. 
43Y46.U=Insertar ResultSet de VTI
42X84=El \u00EDndice ''{0}'' se ha creado para imponer la restricci\u00F3n ''{1}''.  S\u00F3lo puede eliminarse eliminando la restricci\u00F3n.
25001=No se puede cerrar una conexi\u00F3n mientras todav\u00EDa siga activa una transacci\u00F3n.
42Z73=Tipo de destino no v\u00E1lido para XMLSERIALIZE\: ''{0}''.
43X29.U=Columna distinct es el n\u00FAmero de columna
43X47.U=Uni\u00F3n hash
42Z46.U=Invalidar resultado de comparaci\u00F3n
43X65.U=modalidad de inserci\u00F3n\: normal (imposible realizar inserci\u00F3n general debido a que la tabla no est\u00E1 vac\u00EDa)
43X83.U=Juego de resultados derecho
42X48=El valor ''{1}'' no es una precisi\u00F3n v\u00E1lida para {0}.
42X75=No se ha encontrado ning\u00FAn constructor con la firma {0}({1}).  Es posible que los tipos de par\u00E1metro no sean convertibles por la invocaci\u00F3n del m\u00E9todo.
42Z82.U=exclusivo
01502=Se ha eliminado el desencadenante {0} de la tabla {1}.
25001.S.1=Estado de transacci\u00F3n no v\u00E1lido\: transacci\u00F3n de SQL activa.
43Y19.U=ResultSet de VTI para {0}
42Y38=insertMode \= replace no est\u00E1 permitido en una inserci\u00F3n donde se hace referencia a la tabla destino, ''{0}'', en SELECT.
42Z91=subconsulta
22013=Intento de calcular la ra\u00EDz cuadrada de un n\u00FAmero negativo, ''{0}''.
42Y65=bulkFetch no se permite en uniones ''{0}''.
43Y55.U=Finalizar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente
42X39=La consulta s\u00F3lo tiene permitido devolver una sola columna.
42Y92=Los desencadenantes {0} s\u00F3lo pueden hacer referencia a variables/tablas de transici\u00F3n {1}.
XBCM2.S=No se puede crear una instancia de la clase generada {0}.
43X38.U=sobre {0} mediante {1}
42X66=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE INDEX.
42X93=La tabla ''{0}'' contiene una definici\u00F3n de restricci\u00F3n con la columna ''{1}'' que no est\u00E1 en la tabla.
42Z37.U=Ninguno
43X56.U=Subconsultas conectadas
