#Thu May 16 17:55:33 BRT 2013
42Z55.U=Wykonywanie zatrzymane przez opcj\u0119 debugowania StopAfterParsing po przeanalizowaniu.
43X74.U=Skanowanie indeksu
42Y29=Lista SELECT niegrupowanego zapytania zawiera przynajmniej jedno niepoprawne wyra\u017Cenie. Gdy lista SELECT zawiera przynajmniej jedn\u0105 agregacj\u0119, wszystkie pozycje musz\u0105 by\u0107 poprawnymi wyra\u017Ceniami agreguj\u0105cymi.
43X92.U=Interfejs ResultSet - teraz
08000=Po\u0142\u0105czenie zosta\u0142o zamkni\u0119te przez nieznane przerwanie.
42Y56=Niepoprawna strategia \u0142\u0105czenia ''{0}'' okre\u015Blona na li\u015Bcie w\u0142a\u015Bciwo\u015Bci tabeli ''{1}''. Aktualnie obs\u0142ugiwane warto\u015Bci dla strategii \u0142\u0105czenia to \: ''hash'' i ''nestedloop''.
42Y83=Beztypowa warto\u015B\u0107 null nie jest dozwolona jako argument agregacji {0}. Wykonaj rzutowanie warto\u015Bci null do odpowiedniego typu.
43Y28.U=Czas kompilacji
42X57=Funkcja getColumnCount() dla zewn\u0119trznej tabeli wirtualnej ''{0}'' zwr\u00F3ci\u0142a niepoprawn\u0105 warto\u015B\u0107 ''{1}''. Poprawne warto\u015Bci s\u0105 wi\u0119ksze lub r\u00F3wne 1. 
42Z19=Do kolumny ''{0}'' odnosi si\u0119 przynajmniej jedna regu\u0142a ograniczaj\u0105ca klucz obcy ''{1}''. Aby zmieni\u0107 d\u0142ugo\u015B\u0107 tej kolumny, nale\u017Cy usun\u0105\u0107 odnosz\u0105ce si\u0119 do niej regu\u0142y ograniczaj\u0105ce, wykona\u0107 instrukcj\u0119 ALTER TABLE, a nast\u0119pnie utworzy\u0107 ponownie regu\u0142\u0119 ograniczaj\u0105c\u0105. 
43Y46.U=Wstaw interfejs ResultSet VTI
42X84=Indeks ''{0}'' zosta\u0142 utworzony, aby narzuci\u0107 regu\u0142\u0119 ograniczaj\u0105c\u0105 ''{1}''. Mo\u017Ce by\u0107 usuni\u0119ty przez usuni\u0119cie regu\u0142y ograniczaj\u0105cej.
25001=Nie mo\u017Cna zamkn\u0105\u0107 po\u0142\u0105czenia, gdy transakcja jest nadal aktywna.
42Z73=Niepoprawny typ docelowy dla XMLSERIALIZE\: ''{0}''.
43X29.U=Kolumna odr\u0119bna jest numerem kolumny
43X47.U=\u0141\u0105czenie mieszaj\u0105ce
42Z46.U=Zanegowany wynik por\u00F3wnania
43X65.U=tryb wstawiania\: zwyk\u0142e (nie mo\u017Cna przeprowadzi\u0107 wstawiania masowego, gdy\u017C tabela nie jest pusta)
43X83.U=Prawa tabela wynikowa
42X48=Warto\u015B\u0107 ''{1}'' nie ma poprawnej dok\u0142adno\u015Bci dla {0}.
42X75=Nie znaleziono konstruktora z sygnatur\u0105 {0}({1}). Mo\u017Ce by\u0107 tak, \u017Ce typy parametr\u00F3w w wywo\u0142aniu metody nie podlegaj\u0105 konwersji.
42Z82.U=wy\u0142\u0105czny
01502=Wyzwalacz {0} dla tabeli {1} zosta\u0142 usuni\u0119ty.
43Y19.U=Interfejs ResultSet VTI dla klasy {0}
42Y38=Wyra\u017Cenie insertMode \= replace nie jest dozwolone w instrukcji wstawiania, do kt\u00F3rej w instrukcji SELECT wyst\u0119puje odwo\u0142anie do tabeli docelowej ''{0}''.
42Z91=podzapytanie
22013=Pr\u00F3ba obliczenia pierwiastka kwadratowego z liczby ujemnej, ''{0}''.
43Y55.U=Numer zako\u0144czenia dzia\u0142ania referencyjnego na tabeli zale\u017Cnej
42Y65=Warto\u015B\u0107 bulkFetch nie jest dozwolona dla \u0142\u0105cze\u0144 typu ''{0}''.
42X39=Podzapytanie zwraca tylko pojedyncz\u0105 kolumn\u0119.
42Y92=Wyzwalacze {0} mog\u0105 odwo\u0142ywa\u0107 si\u0119 tylko do zmiennych/tabel przej\u015Bciowych {1}.
XBCM2.S=Nie mo\u017Cna utworzy\u0107 instancji wygenerowanej klasy {0}.
43X38.U=w tabeli {0} wykorzystywany jest indeks {1}
42X66=Nazwa kolumny ''{0}'' pojawia si\u0119 w instrukcji CREATE INDEX wi\u0119cej ni\u017C jeden raz.
42X93=Tabela ''{0}'' zawiera definicj\u0119 regu\u0142y ograniczaj\u0105cej z kolumn\u0105 ''{1}'', kt\u00F3rej nie ma w tabeli.
42Z37.U=Brak
43X56.U=Pod\u0142\u0105czone podzapytania
