#Thu May 16 17:55:33 BRT 2013
42Z55.U=Die Ausf\u00FChrung wurde nach der Syntaxanalyse von der Debug-Markierung StopAfterParsing gestoppt.
43X74.U=Indexsuche
42Y29=Die SELECT-Liste einer nicht gruppierten Abfrage enth\u00E4lt mindestens einen ung\u00FCltigen Ausdruck. Wenn die SELECT-Liste mindestens ein Aggregat enth\u00E4lt, m\u00FCssen alle Eintr\u00E4ge g\u00FCltige Aggregatausdr\u00FCcke sein.
43X92.U=Einzelwert-ResultSet
42Y56=In der Merkmalliste f\u00FCr die Tabelle ''{1}'' wurde die ung\u00FCltige Verkn\u00FCpfungsstrategie ''{0}'' angegeben. Derzeit werden folgende Werte als Verkn\u00FCpfungsstrategie unterst\u00FCtzt\: ''hash'' und ''nestedloop''.
08000=Die Verbindung wurde von einer unbekannten Unterbrechung aufgehoben.
42Y83=Eine Nullangabe ohne Typ ist kein zul\u00E4ssiges Argument f\u00FCr das Aggregat {0}. Setzen Sie die Nullangabe in einen geeigneten Typ um.
01007=Rolle {0} wurde der Authentifizierungs-ID {1}nicht entzogen.
43Y28.U=Kompilierzeit
42X57=getColumnCount() f\u00FCr die \u00E4u\u00DFere virtuelle Tabelle ''{0}'' hat den ung\u00FCltigen Wert ''{1}'' zur\u00FCckgegeben. G\u00FCltige Werte sind gr\u00F6\u00DFer als oder gleich 1. 
42Z19=Die Spalte ''{0}'' wird von mindestens einer Integrit\u00E4tsbedingung ''{1}'' f\u00FCr Fremdschl\u00FCssel referenziert. Wenn Sie die L\u00E4nge dieser Spalte \u00E4ndern m\u00F6chten, sollten Sie zun\u00E4chst die verweisenden Integrit\u00E4tsbedingungen l\u00F6schen. F\u00FChren Sie dann ALTER aus und erstellen Sie die Integrit\u00E4tsbedingungen neu.
43Y46.U=ResultSet f\u00FCr VTI einf\u00FCgen
42X84=Der Index ''{0}'' wurde erstellt, um die Integrit\u00E4tsbedingung ''{1}'' durchzusetzen. Der Index kann nur gel\u00F6scht werden, wenn die Integrit\u00E4tsbedingung gel\u00F6scht wird.
25001=Eine Verbindung kann nicht beendet werden, solange noch eine Transaktion aktiv ist.
42Z73=Ung\u00FCltiger Zieltyp f\u00FCr XMLSERIALIZE\: ''{0}''.
43X29.U=Die spezifische Spalte hat die Nummer
43X47.U=Verkn\u00FCpfung von Hash-Eintr\u00E4gen
42Z46.U=Vergleichsergebnis negieren
43X65.U=Einf\u00FCgemodus\: normal (das Einf\u00FCgen von Massendaten ist nicht m\u00F6glich, da die Tabelle nicht leer ist)
43X83.U=Rechte Ergebnisliste
42X48=Der Wert ''{1}'' hat eine f\u00FCr ''{0}'' nicht g\u00FCltige Genauigkeit.
42X75=Es wurde kein Konstruktor mit der Signatur {0}({1}) gefunden. M\u00F6glicherweise sind die Parametertypen beim Aufruf der Methode nicht konvertierbar.
42Z82.U=EXCLUSIVE
01502=Der Ausl\u00F6ser {0} in Tabelle {1} wurde gel\u00F6scht.
25001.S.1=Ung\u00FCltiger Transaktionsstatus\: aktive SQL-Transaktion.
43Y19.U=VTI-ResultSet f\u00FCr {0}
42Y38=insertMode \= replace ist f\u00FCr eine Einf\u00FCgung unzul\u00E4ssig, bei der sich SELECT auf die Zieltabelle ''{0}'' bezieht.
42Z91=Unterabfrage
22013=Es wurde versucht, die Quadratwurzel einer negativen Zahl (''{0}'') zu ziehen.
42Y65=bulkFetch ist f\u00FCr ''{0}''-Verkn\u00FCpfungen nicht zul\u00E4ssig.
43Y55.U=Referenzielle Aktion f\u00FCr abh\u00E4ngige Tabelle beenden
42X39=Eine Unterabfrage darf nur eine Spalte zur\u00FCckgeben.
42Y92={0}-Ausl\u00F6ser k\u00F6nnen nur auf \u00DCbergangsvariablen/Tabellen des Typs {1} Bezug nehmen.
XBCM2.S=Es kann keine Instanz der generierten Klasse {0} erstellt werden.
43X38.U=f\u00FCr {0} mit {1}
42X66=Der Spaltenname ''{0}'' erscheint in der Anweisung CREATE INDEX mehr als einmal.
42X93=Die Tabelle ''{0}'' enth\u00E4lt die Definition einer Integrit\u00E4tsbedingung mit der Spalte ''{1}'', die nicht in der Tabelle ist.
42Z37.U=Keine
43X56.U=Zugeordnete Unterabfragen
