#Thu May 16 17:55:33 BRT 2013
42Z55.U=Execu\u00E7\u00E3o parada ap\u00F3s a an\u00E1lise pelo sinalizador de depura\u00E7\u00E3o StopAfterParsing.
43X74.U=Varredura de \u00EDndice
42Y29=A lista SELECT de uma consulta n\u00E3o agrupada cont\u00E9m pelo menos uma express\u00E3o inv\u00E1lida. Quando a lista SELECT cont\u00E9m pelo menos uma agrega\u00E7\u00E3o, todas as entradas dever\u00E3o ser express\u00F5es de agrega\u00E7\u00E3o v\u00E1lidas.
43X92.U=ResultSet de uma vez
08000=Conex\u00E3o encerrada por interrup\u00E7\u00E3o desconhecida.
42Y56=Estrat\u00E9gia de jun\u00E7\u00E3o inv\u00E1lida ''{0}'' especificada na lista de propriedades na tabela ''{1}''. Atualmente, os valores suportados para uma estrat\u00E9gia de jun\u00E7\u00E3o s\u00E3o\: ''hash'' e ''nestedloop''.
42Y83=N\u00E3o \u00E9 permitido um nulo sem tipo como argumento para a agrega\u00E7\u00E3o {0}.  Por favor converta o nulo para um tipo adequado.
43Y28.U=Tempo de compila\u00E7\u00E3o
42X57=getColumnCount() da tabela virtual externa ''{0}'' retornou o valor inv\u00E1lido ''{1}''.  Os valores v\u00E1lidos s\u00E3o maiores que ou iguais a 1.
42Z19=A coluna ''{0}'' est\u00E1 sendo referenciada por, pelo menos, uma restri\u00E7\u00E3o da chave estrangeira ''{1}''. Para alterar o comprimento desta coluna, \u00E9 preciso remover as restri\u00E7\u00F5es que est\u00E3o fazendo refer\u00EAncia, executar ALTER TABLE e, em seguida, recriar a restri\u00E7\u00E3o.
43Y46.U=Inserir ResultSet de VTI
42X84=O \u00EDndice ''{0}'' foi criado para impor a restri\u00E7\u00E3o ''{1}''.  Este \u00EDndice somente pode ser removido atrav\u00E9s da remo\u00E7\u00E3o da restri\u00E7\u00E3o.
25001=N\u00E3o \u00E9 poss\u00EDvel fechar a conex\u00E3o quando a transa\u00E7\u00E3o ainda est\u00E1 ativa.
42Z73=Tipo de destino inv\u00E1lido para XMLSERIALIZE\: ''{0}''.
43X29.U=A coluna distinta \u00E9 o n\u00FAmero de colunas
43X47.U=Jun\u00E7\u00E3o por ''hash''
42Z46.U=Resultado da compara\u00E7\u00E3o negado
43X65.U=modo de inser\u00E7\u00E3o\: normal (n\u00E3o \u00E9 poss\u00EDvel realizar a inser\u00E7\u00E3o em massa devido a tabela n\u00E3o estar vazia)
43X83.U=Conjunto de resultados \u00E0 direita
42X48=O valor ''{1}'' n\u00E3o \u00E9 uma precis\u00E3o v\u00E1lida para {0}.
42X75=N\u00E3o foi encontrado nenhum construtor com a assinatura {0}({1}).  Pode ser que os tipos dos par\u00E2metros n\u00E3o sejam convers\u00EDveis em chamadas de m\u00E9todo.
42Z82.U=exclusivo
01502=Removido o gatilho {0} da tabela {1}.
43Y19.U=ResultSet de VTI para {0}
42Y38=insertMode \= substitui\u00E7\u00E3o n\u00E3o \u00E9 permitida em uma inser\u00E7\u00E3o cuja tabela de destino, ''{0}'', \u00E9 referida na lista SELECT.
42Z91=subconsulta
22013=Tentativa de obter a raiz quadrada de um n\u00FAmero negativo, ''{0}''.
43Y55.U=Terminar a a\u00E7\u00E3o referencial na tabela dependente n\u00FAmero
42Y65=N\u00E3o \u00E9 permitido bulkFetch nas jun\u00E7\u00F5es ''{0}''.
42X39=S\u00F3 \u00E9 permitido \u00E0 subconsulta retornar uma \u00FAnica coluna.
42Y92=Os gatilhos {0} podem fazer refer\u00EAncia apenas \u00E0s tabelas/vari\u00E1veis de transi\u00E7\u00E3o {1}.
XBCM2.S=N\u00E3o foi poss\u00EDvel criar uma inst\u00E2ncia da classe gerada {0}.
43X38.U=em {0} utilizando {1}
42X66=O nome de coluna ''{0}'' aparece mais de uma vez na instru\u00E7\u00E3o CREATE INDEX.
42X93=A tabela ''{0}'' cont\u00E9m uma defini\u00E7\u00E3o de restri\u00E7\u00E3o referenciando a coluna ''{1}'' que n\u00E3o est\u00E1 na tabela.
42Z37.U=Nenhum
43X56.U=Subconsultas anexadas
