#Thu May 16 17:55:33 BRT 2013
42Z55.U=\u0412\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u043F\u043E\u0441\u043B\u0435 \u0430\u043D\u0430\u043B\u0438\u0437\u0430 \u0444\u043B\u0430\u0433\u043E\u043C \u043E\u0442\u043B\u0430\u0434\u043A\u0438 StopAfterParsing.
43X74.U=\u0421\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0438\u043D\u0434\u0435\u043A\u0441\u0430
42Y29=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 SELECT \u0434\u043B\u044F \u043D\u0435\u0433\u0440\u0443\u043F\u043F\u043E\u0432\u043E\u0433\u043E \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u043D\u043E \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435. \u0415\u0441\u043B\u0438 \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 SELECT \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u0445\u043E\u0442\u044F \u0431\u044B \u043E\u0434\u0438\u043D \u0430\u0433\u0440\u0435\u0433\u0430\u0442, \u0442\u043E \u0432\u0441\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043E\u0431\u043E\u0439 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0446\u0438\u0438.
43X92.U=ResultSet - \u041E\u0434\u043D\u043E\u043C\u043E\u043C\u0435\u043D\u0442\u043D\u044B\u0439
08000=\u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u044B\u0442\u043E \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u043C \u043F\u0440\u0435\u0440\u044B\u0432\u0430\u043D\u0438\u0435\u043C.
42Y56=\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432 \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{1}'' \u0443\u043A\u0430\u0437\u0430\u043D\u0430 \u043D\u0435\u0432\u0435\u0440\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u0442\u0435\u0433\u0438\u044F \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F ''{0}''. \u0412 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0441\u0442\u0440\u0430\u0442\u0435\u0433\u0438\u0438 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F ''hash'' \u0438 ''nestedloop''.
42Y83=\u041D\u0443\u043B\u0435\u0432\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0431\u0435\u0437 \u0442\u0438\u043F\u0430 \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430 \u0434\u043B\u044F \u0430\u0433\u0440\u0435\u0433\u0430\u0446\u0438\u0438 {0}.  \u0417\u0430\u0434\u0430\u0439\u0442\u0435 \u0434\u043B\u044F \u043D\u0443\u043B\u044F \u043F\u043E\u0434\u0445\u043E\u0434\u044F\u0449\u0438\u0439 \u0442\u0438\u043F.
43Y28.U=\u0412\u0440\u0435\u043C\u044F \u043A\u043E\u043C\u043F\u0438\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
42X57=\u0412\u044B\u0437\u043E\u0432 getColumnCount() \u0434\u043B\u044F \u0432\u043D\u0435\u0448\u043D\u0435\u0439 \u0432\u0438\u0440\u0442\u0443\u0430\u043B\u044C\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B ''{0}'' \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u043B \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\: ''{1}''.  \u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F\u043C\u0438 \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F, \u0431\u043E\u043B\u044C\u0448\u0435 \u0438\u043B\u0438 \u0440\u0430\u0432\u043D\u044B\u0435 1. 
42Z19=\u041D\u0430 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'' \u0441\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F, \u043A\u0430\u043A \u043C\u0438\u043D\u0438\u043C\u0443\u043C, \u043E\u0434\u043D\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0447\u0443\u0436\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 ''{1}''. \u0427\u0442\u043E\u0431\u044B \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0434\u043B\u0438\u043D\u0443 \u044D\u0442\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u0430, \u043D\u0443\u0436\u043D\u043E \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043D\u0430 \u043D\u0435\u0433\u043E \u0441\u0441\u044B\u043B\u0430\u044E\u0442\u0441\u044F, \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435 ALTER TABLE, \u0430 \u0437\u0430\u0442\u0435\u043C \u0437\u0430\u043D\u043E\u0432\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F. 
43Y46.U=\u0412\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) VTI
42X84=\u0418\u043D\u0434\u0435\u043A\u0441 ''{0}'' \u0431\u044B\u043B \u0441\u043E\u0437\u0434\u0430\u043D \u0434\u043B\u044F \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F ''{1}''.  \u0415\u0433\u043E \u043C\u043E\u0436\u043D\u043E \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0442\u044C, \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0442\u0431\u0440\u043E\u0441\u0438\u0432 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435.
25001=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435, \u043F\u043E\u043A\u0430 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044F \u0430\u043A\u0442\u0438\u0432\u043D\u0430.
42Z73=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0439 \u0442\u0438\u043F \u043E\u0431\u044A\u0435\u043A\u0442\u0430 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0434\u043B\u044F XMLSERIALIZE\: ''{0}''.
43X29.U=\u041E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0439 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 - \u044D\u0442\u043E \u043D\u043E\u043C\u0435\u0440 \u0441\u0442\u043E\u043B\u0431\u0446\u0430
43X47.U=\u0425\u044D\u0448-\u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435
42Z46.U=\u041F\u0440\u043E\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u043E\u0442\u0440\u0438\u0446\u0430\u043D\u0438\u0435 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0430 \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044F
43X65.U=\u0440\u0435\u0436\u0438\u043C \u0432\u0441\u0442\u0430\u0432\u043A\u0438\: \u043E\u0431\u044B\u0447\u043D\u044B\u0439 (\u043D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043C\u0430\u0441\u0441\u043E\u0432\u0443\u044E \u0432\u0441\u0442\u0430\u0432\u043A\u0443, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u043D\u0435 \u043F\u0443\u0441\u0442\u0430\u044F)
43X83.U=\u041F\u0440\u0430\u0432\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432
42X48=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{1}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u0442\u043E\u0447\u043D\u043E\u0441\u0442\u044C\u044E \u0434\u043B\u044F {0}.
42X75=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u043E\u0440\u0430 \u0441 \u0441\u0438\u0433\u043D\u0430\u0442\u0443\u0440\u043E\u0439 {0}({1}).  \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0442\u0438\u043F\u044B \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432 \u043D\u0435 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u044E\u0442 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435 \u0434\u043B\u044F \u0432\u044B\u0437\u043E\u0432\u0430 \u043C\u0435\u0442\u043E\u0434\u0430.
42Z82.U=\u0438\u0441\u043A\u043B\u044E\u0447\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F
01502=\u0422\u0440\u0438\u0433\u0433\u0435\u0440 {0} \u0434\u043B\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u044B {1} \u043E\u0442\u0431\u0440\u043E\u0448\u0435\u043D\u043E.
43Y19.U=\u041D\u0430\u0431\u043E\u0440 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u0432 (ResultSet) VTI \u0434\u043B\u044F {0}
42Y38=insertMode \= replace \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u0438 \u0432\u0441\u0442\u0430\u0432\u043A\u0435, \u0435\u0441\u043B\u0438 \u0432 SELECT \u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0441\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F, ''{0}''.
42Z91=\u043F\u043E\u0434\u0437\u0430\u043F\u0440\u043E\u0441
22013=\u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0438\u0437\u0432\u043B\u0435\u0447\u044C \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u043D\u044B\u0439 \u043A\u043E\u0440\u0435\u043D\u044C \u0438\u0437 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0447\u0438\u0441\u043B\u0430, ''{0}''.
43Y55.U=\u041E\u043A\u043E\u043D\u0447\u0430\u043D\u0438\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u0430\u043C\u0438 \u0434\u043B\u044F \u043D\u043E\u043C\u0435\u0440\u0430 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
42Y65=bulkFetch \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0439 ''{0}''.
42X39=\u041F\u043E\u0434\u0437\u0430\u043F\u0440\u043E\u0441 \u043C\u043E\u0436\u0435\u0442 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u0438\u043D \u0441\u0442\u043E\u043B\u0431\u0435\u0446.
42Y92=\u0422\u0440\u0438\u0433\u0433\u0435\u0440\u044B {0} \u043C\u043E\u0433\u0443\u0442 \u0441\u0441\u044B\u043B\u0430\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430 \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u043D\u044B\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435/\u0442\u0430\u0431\u043B\u0438\u0446\u044B {1}.
XBCM2.S=\u041D\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u043A\u043B\u0430\u0441\u0441\u0430 {0}.
43X38.U=\u0434\u043B\u044F {0} \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C {1}
42X66=\u0418\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{0}'' \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0432 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0435 CREATE INDEX \u0431\u043E\u043B\u0435\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u0430.
42X93=\u0422\u0430\u0431\u043B\u0438\u0446\u0430 ''{0}'' \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0441\u0442\u043E\u043B\u0431\u0446\u0430 ''{1}'', \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043D\u0435\u0442 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435.
42Z37.U=\u041D\u0435\u0442
43X56.U=\u041F\u0440\u0438\u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u043D\u044B\u0435 \u043F\u043E\u0434\u0437\u0430\u043F\u0440\u043E\u0441\u044B
