#Thu May 16 17:55:33 BRT 2013
08001.C.14=Es konnte keine Verbindung hergestellt werden, da der Servername (SRVNAM) eine L\u00E4nge von null hat oder l\u00E4nger als die vom Netzwerkprotokoll zugelassene maximale L\u00E4nge ist.
08001.C.13=Es konnte keine Verbindung hergestellt werden, da der externe Name (EXTNAM) eine L\u00E4nge von null hat oder l\u00E4nger als die vom Netzwerkprotokoll zugelassene maximale L\u00E4nge ist.
08001.C.12=Es konnte keine Verbindung hergestellt werden, weil das Kennwort die L\u00E4nge null hat oder l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.11=Es konnte keine Verbindung hergestellt werden, weil die Benutzer-ID die L\u00E4nge null hat oder l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.10=Es konnte keine Verbindung hergestellt werden, weil das Sicherheitstoken gr\u00F6\u00DFer als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
22005=Es wurde versucht, einen Datenwert des Typs ''{0}'' aus einem Datenwert des Typs ''{1}'' abzurufen.
43Y29.U=Ausf\u00FChrungszeit
43Y47.U=ResultSet f\u00FCr VTI l\u00F6schen
42Y84=''{0}'' darf in einer DEFAULT-Definition nicht erscheinen.
01008=WITH ADMIN OPTION von Rolle {0}wurde der Authentifizierungs-ID {1}nicht entzogen.
42X58=Die Spaltenanzahl auf der linken Seite von {0} muss mit der auf der rechten Seite \u00FCbereinstimmen.
22005.S.7=Unicode-Zeichenfolge kann nicht in UTF-8-Zeichenfolge konvertiert werden
42X85=Die Integrit\u00E4tsbedingung ''{0}'' muss sich in demselben Schema wie die Tabelle ''{1}'' befinden.
22005.S.6=Nicht erkannter Java-SQL-Typ {0}
22005.S.5=Ung\u00FCltiger JDBC-Typ f\u00FCr den Parameter {0}
22005.S.4=Nicht erkannter JDBC-Typ. Typ\: {0}, Spaltennummer\: {1}, Spaltenindex\: {2}
22005.S.3=Eine Unicode-Zeichenfolge kann nicht in eine EBCDIC-Zeichenfolge konvertiert werden.
22005.S.2=Der erforderliche Zeichenumsetzer ist nicht verf\u00FCgbar.
22005.S.1=Ein Wert des Typs ''{0}'' kann nicht in den Typ ''{1}'' konvertiert werden. Die Codierung wird nicht unterst\u00FCtzt.
43X48.U=ResultSet f\u00FCr Verkn\u00FCpfung von Hash-Eintr\u00E4gen
42Z74=Nicht unterst\u00FCtztes XML-Feature\: ''{0}''.
42Z47.U=Das Abrufen des Abfrageplans als Zeichenfolge wird derzeit f\u00FCr {0} nicht unterst\u00FCtzt
43X66.U=Einf\u00FCgemodus\: normal
42Y48=Ung\u00FCltige Merkmalliste in FROM-Liste. Entweder gibt es f\u00FCr Tabelle ''{1}'' keine benannte Integrit\u00E4tsbedingung ''{0}'' oder es gibt keinen Sicherungsindex f\u00FCr die Integrit\u00E4tsbedingung.
43X84.U=Verkn\u00FCpfung \u00FCber vorhandene verschachtelte Schleife
42Z83.U=INSTANTANEOUS SHARE
42X49=Der Wert ''{0}'' ist kein g\u00FCltiges ganzzahliges Literal.
42X76=F\u00FCr mindestens eine Spalte (''{0}'') des hinzuzuf\u00FCgenden prim\u00E4ren Schl\u00FCssels besteht keine Eintragspflicht. F\u00FCr alle Spalten eines Prim\u00E4rschl\u00FCssels muss Eintragspflicht gelten.
01503=Die Spalte {0} in Tabelle {1} wurde durch das Hinzuf\u00FCgen einer Integrit\u00E4tsbedingung ungleich null ge\u00E4ndert.
43Y56.U=Der Benutzer hat f\u00FCr {0} folgende vorrangigen Optimizer-Werte angegeben\: {1}
42Y39=''{0}'' darf nicht in einer ''CHECK CONSTRAINT''-Definition erscheinen, da dies zu unvorhersehbaren Ergebnissen f\u00FChren k\u00F6nnte.
42Z92=wiederholbares Lesen
22014=Die Anfangsposition f\u00FCr LOCATE ist ung\u00FCltig. Sie muss eine positive ganze Zahl sein. Der Index, bei dem die Suche beginnen soll, ist ''{2}''. Zu suchende Zeichenfolge\: ''{0}''. Die Zeichenfolge, bei der die Suche beginnen soll, ist ''{1}''. 
XBCM3.S=Die Methode {1}() ist in der generierten Klasse {0} nicht vorhanden.
42Y66=bulkFetch ist f\u00FCr aktualisierbare Cursor nicht zul\u00E4ssig. 
43X39.U=Spezifische Suche
08001.C.9=Es konnte keine Verbindung hergestellt werden, weil der Datenbankname {0} l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.8=Das Kennwort muss ungleich null sein.
08001.C.7=Die Benutzer-ID muss ungleich null sein.
42Y93=Ung\u00FCltige REFERENCING-Klausel\: F\u00FCr jede Art von \u00DCbergangsvariable/-tabelle ist nur ein Name zul\u00E4ssig.
42Z38.U=Es ist keine Positionierungsangabe verf\u00FCgbar, weil dieses ResultSet nie ge\u00F6ffnet wurde.
43X57.U=ResultSet f\u00FCr Hash-Tabelle
08001.C.6=Die L\u00E4nge des Kennworts ({0}) liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
08001.C.5=Die L\u00E4nge der Benutzer-ID ({0}) liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
08001.C.4=Am Socket ''{0}'' kann kein Datenstrom ge\u00F6ffnet werden.
08001.C.3=SocketException\: ''{0}''
08001.C.2={0}\: Fehler beim Herstellen der Verbindung zum Server {1} am Port {2}. Nachricht\: {3}.
43X75.U=f\u00FCr {0}
08001.C.1=Das erforderliche Derby-DataSource-Merkmal {0} ist nicht gesetzt.
42Z56.U=Die Ausf\u00FChrung wurde nach der Bindung von der Debug-Markierung StopAfterBinding gestoppt.
43X93.U=ResultSet f\u00FCr eingeschr\u00E4nkte Projektion
42X94={0} ''{1}'' ist nicht vorhanden.
