#Thu May 16 17:55:33 BRT 2013
08001.C.14=\u30B5\u30FC\u30D0\u30FC\u540D (SRVNAM) \u9577\u3055\u304C\u30BC\u30ED\u3067\u3042\u308B\u304B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
08001.C.13=\u5916\u90E8\u540D (EXTNAM) \u306E\u9577\u3055\u304C\u30BC\u30ED\u3067\u3042\u308B\u304B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
08001.C.12=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u9577\u3055\u304C\u30BC\u30ED\u3067\u3042\u308B\u304B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
08001.C.11=\u30E6\u30FC\u30B6\u30FC ID \u306E\u9577\u3055\u304C\u30BC\u30ED\u3067\u3042\u308B\u304B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
08001.C.10=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30C8\u30FC\u30AF\u30F3\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
22005=\u578B ''{1}'' \u306E\u30C7\u30FC\u30BF\u5024\u304B\u3089\u578B ''{0}'' \u306E\u30C7\u30FC\u30BF\u5024\u3092\u53D6\u5F97\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u3002
43Y29.U=\u5B9F\u884C\u6642\u9593
43Y47.U=\u524A\u9664 VTI ResultSet
42Y84=''{0}'' \u306F DEFAULT \u5B9A\u7FA9\u306B\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
01008=\u30ED\u30FC\u30EB {0} \u306E WITH ADMIN OPTION \u304C\u8A8D\u8A3C ID {1} \u304B\u3089\u53D6\u308A\u6D88\u3055\u308C\u307E\u305B\u3093\u3002
42X58={0} \u306E\u5DE6\u5074\u306E\u5217\u3068\u53F3\u5074\u306E\u5217\u306E\u6570\u306F\u540C\u3058\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
22005.S.7=Unicode \u30B9\u30C8\u30EA\u30F3\u30B0\u3092 UTF-8 \u30B9\u30C8\u30EA\u30F3\u30B0\u306B\u5909\u63DB\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42X85=\u5236\u7D04 ''{0}'' \u306F\u3001\u8868 ''{1}'' \u3068\u540C\u3058\u30B9\u30AD\u30FC\u30DE\u306B\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
22005.S.6=\u8A8D\u8B58\u3055\u308C\u306A\u3044 Java SQL \u578B {0} \u3067\u3059\u3002
22005.S.5=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC {0} \u306B\u5BFE\u3057\u3066\u7121\u52B9\u306A JDBC \u578B\u3067\u3059\u3002
22005.S.4=\u8A8D\u8B58\u3055\u308C\u306A\u3044 JDBC \u578B\u3067\u3059\u3002 \u578B\: {0}\u3001columnCount\: {1}\u3001columnIndex\: {2}\u3002
22005.S.3=Unicode \u30B9\u30C8\u30EA\u30F3\u30B0\u3092 EBCDIC \u30B9\u30C8\u30EA\u30F3\u30B0\u306B\u5909\u63DB\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
22005.S.2=\u5FC5\u8981\u306A\u6587\u5B57\u30B3\u30F3\u30D0\u30FC\u30BF\u30FC\u3092\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
22005.S.1=\u578B ''{0}'' \u306E\u5024\u3092\u578B ''{1}'' \u306B\u5909\u63DB\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
43X48.U=\u30CF\u30C3\u30B7\u30E5\u7D50\u5408 ResultSet
42Z74=XML \u30D5\u30A3\u30FC\u30C1\u30E3\u30FC\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\: ''{0}''\u3002
42Z47.U=\u7167\u4F1A\u30D7\u30E9\u30F3\u3092 String \u3068\u3057\u3066\u53D6\u5F97\u3059\u308B\u3053\u3068\u306F\u3001{0} \u3067\u306F\u73FE\u5728\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
43X66.U=\u633F\u5165\u30E2\u30FC\u30C9\: \u901A\u5E38
42Y48=FROM \u30EA\u30B9\u30C8\u306B\u7121\u52B9\u306A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30EA\u30B9\u30C8\u3002  \u540D\u524D\u4ED8\u304D\u5236\u7D04 ''{0}'' \u304C\u8868 ''{1}'' \u4E0A\u306B\u306A\u3044\u304B\u3001\u307E\u305F\u306F\u5236\u7D04\u304C\u30D0\u30C3\u30AD\u30F3\u30B0\u7D22\u5F15\u3092\u6301\u3063\u3066\u3044\u307E\u305B\u3093\u3002
43X84.U=Nested Loop Exists Join
42Z83.U=\u77AC\u9593\u5171\u7528
42X49=\u5024 ''{0}'' \u306F\u6709\u52B9\u306A\u6574\u6570\u30EA\u30C6\u30E9\u30EB\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
42X76=\u8FFD\u52A0\u3055\u308C\u3066\u3044\u308B\u4E3B\u30AD\u30FC\u306E\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E\u5217 ''{0}'' \u304C NULL \u53EF\u80FD\u3067\u3059\u3002 \u4E3B\u30AD\u30FC\u5217\u306F\u3069\u308C\u3082 NULL \u53EF\u80FD\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
01503=\u8868 {1} \u306E\u5217 {0} \u306F\u3001\u975E\u30CC\u30EB\u5236\u7D04\u306E\u8FFD\u52A0\u306B\u3088\u308A\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
43Y56.U={0} \u306B\u5BFE\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u63D0\u4F9B\u306E\u30AA\u30D7\u30C6\u30A3\u30DE\u30A4\u30B6\u30FC\u30FB\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u306F {1} \u3067\u3059
42Y39=''{0}'' \u306F\u3001\u975E deterministic \u7D50\u679C\u3092\u623B\u3059\u53EF\u80FD\u6027\u304C\u3042\u308B\u306E\u3067\u3001CHECK CONSTRAINT \u5B9A\u7FA9\u306B\u73FE\u308C\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
42Z92=\u53CD\u5FA9\u53EF\u80FD\u8AAD\u307F\u53D6\u308A
22014=LOCATE \u306E\u958B\u59CB\u4F4D\u7F6E\u304C\u7121\u52B9\u3067\u3059\u3002\u3053\u306E\u4F4D\u7F6E\u306F\u6B63\u306E\u6574\u6570\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 \u691C\u7D22\u3092\u958B\u59CB\u3059\u308B\u7D22\u5F15\u306F ''{2}'' \u3067\u3059\u3002  \u691C\u7D22\u3059\u308B\u30B9\u30C8\u30EA\u30F3\u30B0\u306F ''{0}'' \u3067\u3059\u3002  \u30B9\u30C8\u30EA\u30F3\u30B0\u306E\u691C\u7D22\u5143\u306F ''{1}'' \u3067\u3059\u3002 
XBCM3.S=\u30E1\u30BD\u30C3\u30C9 {1}() \u306F\u3001\u751F\u6210\u3055\u308C\u305F\u30AF\u30E9\u30B9 {0} \u306B\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
42Y66=bulkFetch \u306F\u66F4\u65B0\u53EF\u80FD\u306A\u30AB\u30FC\u30BD\u30EB\u3067\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002 
43X39.U=\u7279\u6B8A\u30B9\u30AD\u30E3\u30F3
08001.C.9=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u540D ''{0}'' \u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u306B\u3088\u308A\u8A31\u53EF\u3055\u308C\u308B\u6700\u5927\u9577\u3092\u8D85\u3048\u3066\u3044\u308B\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
08001.C.8=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
08001.C.7=\u30E6\u30FC\u30B6\u30FC ID \u3092 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42Y93=\u4E0D\u6B63\u306A REFERENCING \u6587\u7BC0\: \u9077\u79FB\u5909\u6570/\u8868\u306E\u5404\u30BF\u30A4\u30D7\u3054\u3068\u306B 1 \u3064\u306E\u540D\u524D\u3057\u304B\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
42Z38.U=\u3053\u306E ResultSet \u306F\u30AA\u30FC\u30D7\u30F3\u3055\u308C\u305F\u3053\u3068\u304C\u306A\u3044\u305F\u3081\u3001\u4F4D\u7F6E\u60C5\u5831\u306F\u3042\u308A\u307E\u305B\u3093\u3002
43X57.U=\u30CF\u30C3\u30B7\u30E5\u8868 ResultSet
08001.C.6=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u9577\u3055 ({0}) \u304C 1 \u304B\u3089 {1} \u306E\u7BC4\u56F2\u5916\u3067\u3059\u3002
08001.C.5=\u30E6\u30FC\u30B6\u30FC ID \u306E\u9577\u3055 ({0}) \u304C 1 \u304B\u3089 {1} \u306E\u7BC4\u56F2\u5916\u3067\u3059\u3002
08001.C.4=\u30BD\u30B1\u30C3\u30C8 ''{0}'' \u3067\u30B9\u30C8\u30EA\u30FC\u30E0\u3092\u958B\u3051\u307E\u305B\u3093\u3002
08001.C.3=SocketException\: ''{0}''
08001.C.2={0}\: \u30DD\u30FC\u30C8 {2} \u306E\u30B5\u30FC\u30D0\u30FC {1} \u3078\u306E\u63A5\u7D9A\u4E2D\u306B\u30E1\u30C3\u30BB\u30FC\u30B8 {3} \u3067\u30A8\u30E9\u30FC\u306B\u306A\u308A\u307E\u3057\u305F\u3002
43X75.U={0} \u4E0A
08001.C.1=\u5FC5\u8981\u306A Derby DataSource \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC {0} \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
42Z56.U=StopAfterBinding \u30C7\u30D0\u30C3\u30B0\u30FB\u30D5\u30E9\u30B0\u306B\u3088\u308B\u30D0\u30A4\u30F3\u30C9\u5F8C\u3001\u5B9F\u884C\u304C\u505C\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
43X93.U=\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u5236\u7D04 ResultSet
42X94={0} ''{1}'' \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
