#Thu May 16 17:55:33 BRT 2013
08001.C.12=N\u00E3o foi poss\u00EDvel estabelecer a conex\u00E3o, porque a senha possui comprimento zero ou \u00E9 maior que o m\u00E1ximo permitido pelo protocolo de rede.
08001.C.11=N\u00E3o foi poss\u00EDvel estabelecer a conex\u00E3o, porque a identifica\u00E7\u00E3o do usu\u00E1rio possui comprimento zero ou \u00E9 maior que o m\u00E1ximo permitido pelo protocolo de rede.
08001.C.10=N\u00E3o foi poss\u00EDvel estabelecer a conex\u00E3o, porque o token de seguran\u00E7a \u00E9 maior que o m\u00E1ximo permitido pelo protocolo de rede.
22005=Tentativa de obter um valor de dado do tipo ''{0}'' a partir de um valor de dado do tipo ''{1}''.
43Y29.U=Tempo de execu\u00E7\u00E3o
43Y47.U=Excluir ResultSet de VTI
42Y84=N\u00E3o pode aparecer ''{0}'' em uma defini\u00E7\u00E3o DEFAULT.
42X58=O n\u00FAmero de colunas dos lados esquerdo e direito de {0} devem ser id\u00EAnticos.
42X85=\u00C9 requerido que a restri\u00E7\u00E3o ''{0}'' esteja no mesmo esquema da tabela ''{1}''.
22005.S.6=Tipo SQL Java n\u00E3o reconhecido {0}.
22005.S.5=Tipo JDBC inv\u00E1lido para o par\u00E2metro {0}.
22005.S.4=Tipo JDBC n\u00E3o reconhecido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
22005.S.3=Cadeia de caracteres UNICODE n\u00E3o pode ser convertida em cadeia de caracteres EBCDIC.
22005.S.2=O conversor de caractere requerido n\u00E3o est\u00E1 dispon\u00EDvel.
43X48.U=ResultSet de jun\u00E7\u00E3o por ''hash''
22005.S.1=N\u00E3o foi poss\u00EDvel converter um valor do tipo ''{0}'' para o tipo ''{1}'' \: a codifica\u00E7\u00E3o n\u00E3o \u00E9 suportada.
42Z74=Recurso XML n\u00E3o suportado\: ''{0}''.
42Z47.U=A obten\u00E7\u00E3o do plano do comando como uma cadeia de caracteres n\u00E3o \u00E9 suportado atualmente para {0}
43X66.U=modo de inser\u00E7\u00E3o\: normal
42Y48=Lista de propriedades inv\u00E1lidas na lista FROM.  N\u00E3o h\u00E1 restri\u00E7\u00E3o com o nome ''{0}'' na tabela ''{1}'', ou a restri\u00E7\u00E3o n\u00E3o cont\u00E9m um \u00EDndice de apoio.
43X84.U=Jun\u00E7\u00E3o EXISTS por la\u00E7o aninhado
42Z83.U=compartilhamento instant\u00E2neo
42X49=O valor ''{0}'' n\u00E3o \u00E9 um literal inteiro v\u00E1lido.
42X76=Pelo menos uma coluna, ''{0}'', da chave prim\u00E1ria sendo adicionada pode conter nulos. Nenhuma coluna de uma chave prim\u00E1ria pode conter valores nulos.
01503=Modificada a coluna {0} da tabela {1} pela adi\u00E7\u00E3o de uma restri\u00E7\u00E3o de n\u00E3o nulo.
43Y56.U=Substitui\u00E7\u00F5es de otimiza\u00E7\u00E3o fornecidas pelo usu\u00E1rio em {0} s\u00E3o {1}
42Y39=''{0}'' n\u00E3o pode aparecer em uma defini\u00E7\u00E3o de CHECK CONSTRAINT, porque pode retornar resultados n\u00E3o-determin\u00EDsticos.
42Z92=leitura repet\u00EDvel
22014=A posi\u00E7\u00E3o inicial para LOCATE n\u00E3o \u00E9 v\u00E1lida; deve ser um inteiro positivo. O \u00EDndice a partir do qual a procura ser\u00E1 feita \u00E9 ''{2}''.  A cadeia de caracteres a ser procurada \u00E9 ''{0}''.  A cadeia de caracteres onde ser\u00E1 feita a procura \u00E9 ''{1}''.
XBCM3.S=O m\u00E9todo {1}() n\u00E3o existe na classe gerada {0}.
42Y66=N\u00E3o \u00E9 permitido bulkFetch em cursores atualiz\u00E1veis.
43X39.U=Varredura distinta
08001.C.9=N\u00E3o foi poss\u00EDvel estabelecer a conex\u00E3o, porque o nome do banco de dados ''{0}'' possui comprimento maior que o m\u00E1ximo permitido pelo protocolo de rede.
08001.C.8=A senha n\u00E3o pode ser nula.
08001.C.7=A identifica\u00E7\u00E3o do usu\u00E1rio n\u00E3o pode ser nula.
42Y93=Cl\u00E1usula REFERENCING ilegal\: \u00E9 permitido apenas um nome para cada tipo de tabela/vari\u00E1vel de transi\u00E7\u00E3o.
42Z38.U=As informa\u00E7\u00F5es sobre posicionamento n\u00E3o est\u00E3o dispon\u00EDveis, porque este ResultSet nunca foi aberto.
43X57.U=ResultSet da tabela por ''hash''
08001.C.6=O comprimento da senha ({0}) est\u00E1 fora do intervalo de 1 a {1}.
08001.C.5=O comprimento da identifica\u00E7\u00E3o do usu\u00E1rio ({0}) est\u00E1 fora do intervalo de 1 a {1}.
08001.C.4=N\u00E3o foi poss\u00EDvel abrir fluxo no soquete\: ''{0}''.
08001.C.3=SocketException\: ''{0}''
08001.C.2={0} \: Erro ao conectar no servidor ''{1}'' porta ''{2}''. Recebida a mensagem\: ''{3}''.
43X75.U=em {0}
08001.C.1=Propriedade requerida {0} n\u00E3o definida.
42Z56.U=Execu\u00E7\u00E3o parada ap\u00F3s a liga\u00E7\u00E3o pelo sinalizador de depura\u00E7\u00E3o StopAfterBinding.
43X93.U=ResultSet restrito ao projeto
42X94={0} ''{1}'' n\u00E3o existe.
