#Thu May 16 17:55:33 BRT 2013
08001.C.12=Po\u0142\u0105czenie nie mo\u017Ce by\u0107 nawi\u0105zane, poniewa\u017C has\u0142o u\u017Cytkownika ma zerow\u0105 d\u0142ugo\u015B\u0107 lub jest wi\u0119ksze ni\u017C maksymalne dozwolone przez protok\u00F3\u0142 sieciowy.
08001.C.11=Po\u0142\u0105czenie nie mo\u017Ce by\u0107 nawi\u0105zane, poniewa\u017C identyfikator u\u017Cytkownika ma zerow\u0105 d\u0142ugo\u015B\u0107 lub jest wi\u0119kszy ni\u017C maksymalny dozwolony przez protok\u00F3\u0142 sieciowy.
08001.C.10=Po\u0142\u0105czenie nie mo\u017Ce by\u0107 nawi\u0105zane, poniewa\u017C znacznik bezpiecze\u0144stwa jest wi\u0119kszy ni\u017C maksymalny dozwolony przez protok\u00F3\u0142 sieciowy.
22005=Wyst\u0105pi\u0142a pr\u00F3ba pobrania warto\u015Bci danych typu ''{0}'' z warto\u015Bci danych typu ''{1}''.
43Y29.U=Czas wykonywania
43Y47.U=Usu\u0144 interfejs ResultSet VTI
42Y84=''{0}'' mo\u017Ce si\u0119 nie pojawi\u0107 w definicji DEFAULT.
42X58=Liczba kolumn po prawej i lewej stronie operatora {0} musi by\u0107 taka sama.
42X85=Regu\u0142a ograniczaj\u0105ca ''{0}'' musi by\u0107 w tym samym schemacie, co tabela ''{1}''.
22005.S.6=Nierozpoznany typ Java SQL {0}.
22005.S.5=Niepoprawny typ JDBC dla parametru {0}.
22005.S.4=Nierozpoznany typ JDBC. Typ\: {0}, parametr columnCount\: {1}, parametr columnIndex\: {2}.
22005.S.3=\u0141a\u0144cuch w kodzie Unicode nie mo\u017Ce by\u0107 przekonwertowany na \u0142a\u0144cuch w kodzie Ebcdic
22005.S.2=Wymagany konwerter znak\u00F3w nie jest dost\u0119pny.
43X48.U=Interfejs ResultSet dla \u0142\u0105czenia mieszaj\u0105cego
22005.S.1=Nie mo\u017Cna dokona\u0107 konwersji warto\u015Bci typu ''{0}'' na typ ''{1}''\: kodowanie nie jest obs\u0142ugiwane.
42Z74=Opcja XML nie jest obs\u0142ugiwana\: ''{0}''.
42Z47.U=Pobieranie planu zapytania jako \u0142a\u0144cucha nie jest obs\u0142ugiwane dla {0}
43X66.U=tryb wstawiania\: zwyk\u0142e
42Y48=Niepoprawna lista w\u0142a\u015Bciwo\u015Bci na li\u015Bcie FROM. Brak nazwanej regu\u0142y ograniczaj\u0105cej ''{0}'' dla tabeli ''{1}'' lub regu\u0142a ograniczaj\u0105ca nie ma zapasowego indeksu.
43X84.U=\u0141\u0105czenie Exists p\u0119tli zagnie\u017Cd\u017Conej
42Z83.U=indywidualne wsp\u00F3\u0142u\u017Cytkowanie
42X49=Warto\u015B\u0107 ''{0}'' nie jest poprawnym litera\u0142em ca\u0142kowitym.
42X76=Przynajmniej jedna kolumna, ''{0}'', w dodawanym kluczu podstawowym mo\u017Ce mie\u0107 warto\u015Bci null. \u017Badna kolumna klucza podstawowego nie mo\u017Ce dopuszcza\u0107 warto\u015Bci null.
01503=Kolumna {0} tabeli {1} zosta\u0142a zmodyfikowana przez dodanie ograniczenia, kt\u00F3rego warto\u015B\u0107 nie mo\u017Ce by\u0107 r\u00F3wna null.
43Y56.U=Nadpisania optymalizatora podane przez u\u017Cytkownika dla {0} to {1}
42Y39=''{0}'' mo\u017Ce nie pojawi\u0107 si\u0119 w definicji CHECK CONSTRAINT, poniewa\u017C mo\u017Ce zwr\u00F3ci\u0107 wyniki niedeterministyczne.
42Z92=odczyt powtarzalny
22014=Pozycja pocz\u0105tkowa dla funkcji LOCATE jest niepoprawna. Musi to by\u0107 liczba ca\u0142kowita dodatnia. Indeks, od kt\u00F3rego ma si\u0119 rozpocz\u0105\u0107 wyszukiwanie, to ''{2}''. \u0141a\u0144cuch do wyszukania to ''{0}''. \u0141a\u0144cuch, od kt\u00F3rego rozpocznie si\u0119 wyszukiwanie, to ''{1}''. 
XBCM3.S=Metoda {1}() nie istnieje w wygenerowanej klasie {0}.
42Y66=Warto\u015B\u0107 bulkFetch nie jest dozwolona dla kursor\u00F3w, kt\u00F3re mo\u017Cna aktualizowa\u0107. 
43X39.U=Odr\u0119bne skanowanie
08001.C.9=Po\u0142\u0105czenie nie mo\u017Ce by\u0107 nawi\u0105zane, poniewa\u017C nazwa bazy danych ''{0}'' przekracza maksymaln\u0105 d\u0142ugo\u015B\u0107 dozwolon\u0105 przez protok\u00F3\u0142 sieciowy.
08001.C.8=Has\u0142o nie mo\u017Ce by\u0107 warto\u015Bci\u0105 null.
08001.C.7=Identyfikator u\u017Cytkownika nie mo\u017Ce by\u0107 warto\u015Bci\u0105 null.
42Y93=Niedozwolona klauzula REFERENCING\: dla ka\u017Cdego typu zmiennej/tabeli przej\u015Bciowej dozwolona jest tylko jedna nazwa.
42Z38.U=Informacje dotycz\u0105ce pozycjonowania nie s\u0105 dost\u0119pne, poniewa\u017C ten obiekt ResultSet nigdy nie by\u0142 otwierany.
43X57.U=Interfejs ResultSet dla tabeli mieszaj\u0105cej
08001.C.6=D\u0142ugo\u015B\u0107 has\u0142a ({0}) jest poza zakresem, kt\u00F3ry wynosi od 1 do {1}.
08001.C.5=D\u0142ugo\u015B\u0107 identyfikatora u\u017Cytkownika ({0}) jest poza zakresem, kt\u00F3ry wynosi od 1 do {1}.
08001.C.4=Nie mo\u017Cna otworzy\u0107 strumienia na gnie\u017Adzie\: ''{0}''.
08001.C.3=Wyj\u0105tekGniazda\: ''{0}''
08001.C.2={0}\: B\u0142\u0105d podczas \u0142\u0105czenia z serwerem {1} na porcie {2} z komunikatem {3}.
43X75.U=w {0}
08001.C.1=Wymagana w\u0142a\u015Bciwo\u015B\u0107 DataSource - {0} - bazy danych Derby nie zosta\u0142a ustawiona.
42Z56.U=Wykonywanie zatrzymane przez opcj\u0119 debugowania StopAfterBinding po powi\u0105zaniu.
43X93.U=Interfejs ResultSet ograniczenia projektu
42X94={0} ''{1}'' nie istnieje.
