#Thu May 16 17:55:33 BRT 2013
08001.C.14=Impossibile stabilire la connessione poich\u00E9 la lunghezza del nome server (SRVNAM) \u00E8 pari a zero o supera la lunghezza massima consentita dal protocollo di rete.
08001.C.13=Impossibile stabilire la connessione poich\u00E9 la lunghezza del nome esterno (EXTNAM) \u00E8 pari a zero o supera la lunghezza massima consentita dal protocollo di rete.
08001.C.12=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza della password \u00E8 uguale a zero o maggiore della lunghezza consentita dal protocollo di rete.
08001.C.11=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza dell''id utente \u00E8 uguale a zero o maggiore della lunghezza massima consentita dal protocollo di rete.
08001.C.10=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 il token di sicurezza possiede una dimensione superiore rispetto alla dimensione massima consentita dal protocollo di rete.
22005=\u00C8 stato effettuato un tentativo di ottenere un valore dati di tipo ''{0}'' da uno di tipo ''{1}''.
43Y29.U=Tempo di esecuzione
43Y47.U=Elimina VTI ResultSet
42Y84=''{0}'' potrebbe non comparire in una definizione DEFAULT.
01008=Clausola WITH ADMIN OPTION del ruolo {0} non revocata dall''ID di autenticazione {1}.
42X58=Il numero di colonne presenti sul lato destro e sinistro di {0} deve essere uguale.
22005.S.7=Impossibile convertire una stringa Unicode in una stringa UTF-8
42X85=La restrizione ''{0}'' deve essere contenuta nello stesso schema della tabella ''{1}''.
22005.S.6=Tipo SQL Java {0} non riconosciuto.
22005.S.5=Tipo JDBC non valido per il parametro {0}.
22005.S.4=Tipo JDBC non riconosciuto. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
22005.S.3=Impossibile convertire la stringa Unicode nella stringa Ebcdic
22005.S.2=Il convertitore del carattere richiesto non \u00E8 disponibile.
22005.S.1=Impossibile convertire un valore di tipo ''{0}'' nel tipo ''{1}'' \: la codifica non \u00E8 supportata.
43X48.U=Hash Join ResultSet
42Z74=Funzione XML non supportata\: ''{0}''.
42Z47.U=Il richiamo del piano query come una Stringa non \u00E8 supportato per {0}
43X66.U=modalit\u00E0 di inserimento\: normale
42Y48=Elenco Propriet\u00E0 non valido nell''elenco FROM.  Non esiste alcuna restrizione denominata ''{0}'' sulla tabella ''{1}'' oppure la restrizione non possiede un indice di copia.
43X84.U=Nested Loop Exists Join
42Z83.U=condivisione istantanea
42X49=Il valore ''{0}'' non \u00E8 un valore letterale intero valido.
42X76=Almeno una colonna, ''{0}'', nella chiave primaria aggiunta \u00E8 annullabile. Tutte le colonne presenti in una chiave primaria non devono essere annullabili.
01503=La colonna {0} sulla tabella {1} \u00E8 stata modificata aggiungendo una restrizione non nulla.
43Y56.U=Le sovrascritture del programma di ottimizzazione fornite dall''utente su {0} sono {1}
42Y39=''{0}'' non compare in una definizione CHECK CONSTRAINT poich\u00E9 potrebbe restituire dei risultati non deterministici.
42Z92=lettura ripetibile
22014=La posizione iniziale di LOCATE non \u00E8 valida; \u00E8 necessario che sia un numero intero positivo. L''indice da cui iniziare la ricerca \u00E8 ''{2}''.  La stringa da cui effettuare la ricerca \u00E8 ''{0}''.  La stringa da cui effettuare la ricerca \u00E8 ''{1}''. 
XBCM3.S=Il metodo {1}() non esiste nella classe {0} generata.
42Y66=bulkFetch non consentito sui cursori aggiornabili. 
43X39.U=Distinct Scan
08001.C.9=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza del nome del database ''{0}'' \u00E8 maggiore della lunghezza consentita dal protocollo di rete.
08001.C.8=La password non pu\u00F2 essere nulla.
08001.C.7=L''id utente non pu\u00F2 essere nullo.
42Y93=Clausola REFERENCING non valida\: \u00E8 consentito solo un nome per ogni tipo di variabile/tabella della transazione.
42Z38.U=posizionamento delle informazioni non disponibile poich\u00E9 ResultSet non \u00E8 stato mai aperto.
43X57.U=Hash Table ResultSet
08001.C.6=Lunghezza password ({0}) fuori dall''intervallo da 1 a {1}.
08001.C.5=Lunghezza id utente ({0}) fuori dall''intervallo da 1 a {1}.
08001.C.4=Impossibile aprire il flusso sul socket\: ''{0}''.
08001.C.3=SocketException\: ''{0}''
08001.C.2={0} \: Errore di connessione al server {1} sulla porta {2} con messaggio {3}.
43X75.U=su {0}
08001.C.1=Propriet\u00E0 Derby DataSource {0} richiesta non impostata.
42Z56.U=Esecuzione arrestata in seguito al collegamento tramite l''indicatore di debug StopAfterBinding.
43X93.U=Project-Restrict ResultSet
42X94={0} ''{1}'' non esiste.
