#Thu May 16 17:55:33 BRT 2013
08001.C.14=Impossible d''\u00E9tablir une connexion car le nom du serveur (SRVNAM) a une longueur de z\u00E9ro ou d\u00E9passe la longueur maximale autoris\u00E9e par le protocole r\u00E9seau.
08001.C.13=Impossible d''\u00E9tablir une connexion car le nom externe (EXTNAM) a une longueur de z\u00E9ro ou d\u00E9passe la longueur maximale autoris\u00E9e par le protocole r\u00E9seau.
08001.C.12=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le mot de passe a une longueur \u00E9gale \u00E0 z\u00E9ro ou est plus long que le maximum autoris\u00E9 par le protocole r\u00E9seau.
08001.C.11=Aucune connexion n''a pu \u00EAtre \u00E9tablie car l''ID utilisateur a une longueur \u00E9gale \u00E0 z\u00E9ro ou est plus long que le maximum autoris\u00E9 par le protocole r\u00E9seau.
08001.C.10=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le jeton de s\u00E9curit\u00E9 est plus grand que la taille maximale autoris\u00E9e par le protocole r\u00E9seau.
22005=Une tentative d''extraction d''une valeur de donn\u00E9es de type ''{0}'' \u00E0 partir d''une valeur de donn\u00E9es de type ''{1}'' a \u00E9t\u00E9 effectu\u00E9e.
43Y29.U=Dur\u00E9e de l''ex\u00E9cution
43Y47.U=Supprimer le ResultSet du VTI
42Y84=''{0}'' peut ne pas figurer dans une d\u00E9finition DEFAULT.
01008=AVEC OPTION ADMIN du r\u00F4le {0} non r\u00E9voqu\u00E9 de l''ID d''authentification {1}.
42X58=Le nombre de colonnes situ\u00E9es \u00E0 gauche et \u00E0 droite de l''\u00E9l\u00E9ment {0} doit \u00EAtre identique.
22005.S.7=Une cha\u00EEne Unicode ne peut \u00EAtre convertie en cha\u00EEne UTF-8
42X85=La contrainte ''{0}''doit obligatoirement se trouver dans le m\u00EAme sch\u00E9ma que la table ''{1}''.
22005.S.6=Type de langage SQL pour Java {0} non reconnu.
22005.S.5=Type de connectivit\u00E9 JDBC incorrect pour le param\u00E8tre {0}.
22005.S.4=Type de connectivit\u00E9 JDBC non reconnu. Type \: {0}, NombreColonne \: {1}, IndexColonne \: {2}.
22005.S.3=Une cha\u00EEne unicode ne peut \u00EAtre convertie en cha\u00EEne Ebcdic
22005.S.2=Le convertisseur de caract\u00E8res requis n''est pas disponible.
22005.S.1=Conversion d''une valeur de type ''{0}'' en type ''{1}'' impossible \: le codage n''est pas pris en charge.
43X48.U=ResultSet de jointure par hachage
42Z74=Fonction XML non prise en charge \: ''{0}''.
42Z47.U=L''extraction du plan de requ\u00EAte sous forme de cha\u00EEne n''est pas prise en charge actuellement pour {0}
43X66.U=mode d''insertion \: normal
42Y48=Liste Propri\u00E9t\u00E9s non valide dans la liste FROM.  Soit il n''existe aucune contrainte nomm\u00E9e ''{0}''sur la table ''{1}'', soit la contrainte ne poss\u00E8de pas d''index de secours.
43X84.U=Jointure Exists en boucle imbriqu\u00E9e
42Z83.U=partage instantan\u00E9
42X49=La valeur ''{0}'' n''est pas un litt\u00E9ral entier valide.
42X76=Une colonne au moins, ''{0}'', de la cl\u00E9 primaire ajout\u00E9e peut avoir une valeur null. Aucune colonne d''une cl\u00E9 primaire ne peut avoir une valeur nulle.
01503=La colonne {0} de la table {1} a \u00E9t\u00E9 modifi\u00E9e par ajout d''une contrainte non nulle.
43Y56.U=Les valeurs de substitution d''optimiseur fournies par l''utilisateur pour {0} sont {1}
42Y39=''{0}'' ne peut pas figurer dans une d\u00E9finition CHECK CONSTRAINT car il pourrait renvoyer des r\u00E9sultats non d\u00E9terministes.
42Z92=lecture reproductible
22014=La position de d\u00E9but pour LOCATE est incorrecte ; cette valeur doit \u00EAtre un entier positif. L''index \u00E0 partir duquel la recherche doit commencer est ''{2}''.  La cha\u00EEne \u00E0 rechercher est ''{0}''.  La cha\u00EEne dans laquelle effectuer la recherche est ''{1}''. 
XBCM3.S=La m\u00E9thode {1}() n''existe pas dans la classe g\u00E9n\u00E9r\u00E9e {0}.
42Y66=bulkFetch n''est pas autoris\u00E9 sur les curseurs pouvant \u00EAtre mis \u00E0 jour. 
43X39.U=Analyse distincte
08001.C.9=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le nom de la base de donn\u00E9es ''{0}'' est plus long que la longueur maximale autoris\u00E9e par le protocole r\u00E9seau.
08001.C.8=Le mot de passe ne peut pas \u00EAtre null.
08001.C.7=L''ID utilisateur ne peut pas \u00EAtre null.
42Y93=Clause REFERENCING incorrecte \: un seul nom est autoris\u00E9 pour chaque type de variable/table de transition.
42Z38.U=Aucune information de positionnement n''est disponible parce que ce ResultSet n''a jamais \u00E9t\u00E9 ouvert.
43X57.U=ResultSet de table de hachage
08001.C.6=La longueur du mot de passe ({0}) se situe hors de l''intervalle de 1 \u00E0 {1}.
08001.C.5=La longueur de l''ID utilisateur ({0}) se situe hors de l''intervalle de 1 \u00E0 {1}.
08001.C.4=Impossible d''ouvrir le flux sur le connecteur ''{0}''.
08001.C.3=Exception SocketException \: ''{0}''
08001.C.2={0} \: l''erreur lors de la connexion au serveur {1} sur le port {2} a \u00E9mis le message {3}.
43X75.U=sur {0}
08001.C.1=La propri\u00E9t\u00E9 requise Derby DataSource {0} n''a pas \u00E9t\u00E9 d\u00E9finie.
42Z56.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s la liaison par l''indicateur de d\u00E9bogage StopAfterBinding.
43X93.U=ResultSet de projection-limitation
42X94={0} ''{1}'' n''existe pas.
