#Thu May 16 17:55:33 BRT 2013
08001.C.14=No se ha podido establecer una conexi\u00F3n porque el nombre de servidor (SRVNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
08001.C.13=No se ha podido establecer una conexi\u00F3n porque el nombre externo (EXTNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
08001.C.12=No se ha podido establecer una conexi\u00F3n debido a que la contrase\u00F1a tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.11=No se ha podido establecer una conexi\u00F3n debido a que el id de usuario tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.10=No se ha podido establecer una conexi\u00F3n debido a que la se\u00F1al de seguridad es mayor que el m\u00E1ximo que permite el protocolo de red.
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.
43Y29.U=Tiempo de ejecuci\u00F3n
43Y47.U=Suprimir ResultSet de VTI
42Y84=''{0}'' no puede aparecer en una definici\u00F3n DEFAULT.
01008=WITH ADMIN OPTION de funci\u00F3n {0} no revocada de ID de autenticaci\u00F3n {1}.
42X58=El n\u00FAmero de columnas en los lados izquierdo y derecho de ''{0}'' debe ser el mismo.
22005.S.7=La cadena Unicode no puede convertirse en cadena UTF-8
42X85=Es necesario que la restricci\u00F3n ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.
22005.S.6=Tipo SQL Java no reconocido {0}.
22005.S.5=Tipo JDBC no v\u00E1lido para el par\u00E1metro {0}.
22005.S.4=Tipo JDBC no reconocido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
22005.S.3=La serie Unicode no se puede convertir a la serie Ebcdic
22005.S.2=El convertidor de caracteres necesario no est\u00E1 disponible.
22005.S.1=No se ha podido convertir un valor del tipo ''{0}'' al tipo ''{1}'' \: la codificaci\u00F3n no est\u00E1 soportada.
43X48.U=ResultSet de uni\u00F3n hash
42Z74=Funci\u00F3n XML no soportada\: ''{0}''.
42Z47.U=Obtener un plan de consulta como String no est\u00E1 soportado actualmente para {0}
43X66.U=modalidad de inserci\u00F3n\: normal
42Y48=Lista Properties no v\u00E1lida en lista FROM.  No hay restricci\u00F3n con nombre ''{0}'' sobre la tabla ''{1}'' o la restricci\u00F3n no tiene un \u00EDndice de respaldo.
43X84.U=Uni\u00F3n EXISTS de bucle anidado
42Z83.U=compartici\u00F3n instant\u00E1nea
42X49=El valor ''{0}'' no es un literal entero v\u00E1lido.
42X76=Al menos una columna, ''{0}'', en la clave primaria que se va a a\u00F1adir acepta nulos. Todas las columnas de una clave primaria no deben aceptar nulos.
01503=Se ha modificado la columna {0} de la tabla {1} a\u00F1adiendo una restricci\u00F3n no nula.
43Y56.U=Los modificadores de optimizador proporcionados por el usuario en {0} son {1}
42Y39=''{0}'' puede no aparecer en una definici\u00F3n CHECK CONSTRAINT porque puede devolver resultados no determinantes.
42Z92=lectura repetible
22014=La posici\u00F3n inicial de LOCATE no es v\u00E1lida; debe ser un entero positivo. El \u00EDndice desde el que comenzar la b\u00FAsqueda es ''{2}''.  La serie a buscar es ''{0}''.  La serie desde la que buscar es ''{1}''. 
XBCM3.S=El m\u00E9todo {1}() no existe en la clase generada {0}.
42Y66=bulkFetch no se permite en cursores actualizables. 
43X39.U=Exploraci\u00F3n distinct
08001.C.9=No se ha podido establecer una conexi\u00F3n debido a que el nombre de base de datos ''{0}'' es mayor que la longitud m\u00E1xima que permite el protocolo de red.
08001.C.8=La contrase\u00F1a no puede ser nula.
08001.C.7=El id de usuario no puede ser nulo.
42Y93=Cl\u00E1usula REFERENCING no permitida\: s\u00F3lo se permite un nombre para cada tipo de variable/tabla de transici\u00F3n.
42Z38.U=Informaci\u00F3n de posicionamiento no disponible porque este ResultSet nunca se ha abierto.
43X57.U=ResultSet de tabla hash
08001.C.6=La longitud de la contrase\u00F1a ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.5=El id de usuario ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.4=No se puede abrir la corriente en el socket\: ''{0}''.
08001.C.3=SocketException\: ''{0}''
08001.C.2={0} \: Error al conectarse al servidor {1} en el puerto {2} con el mensaje {3}.
43X75.U=sobre {0}
08001.C.1=La propiedad de Derby DataSource {0} necesaria no est\u00E1 establecida.
42Z56.U=Ejecuci\u00F3n detenida despu\u00E9s de enlazar mediante el distintivo de depuraci\u00F3n StopAfterBinding.
43X93.U=ResultSet de proyecci\u00F3n-restricci\u00F3n
42X94={0} ''{1}'' no existe.
