#Thu May 16 17:55:33 BRT 2013
42611=Atribut d\u00E9lky, p\u0159esnosti nebo m\u011B\u0159\u00EDtka sloupce anebo mapov\u00E1n\u00ED typu ''{0}'' nen\u00ED platn\u00E9. 
40XD0=Kontejner byl uzav\u0159en.
XSCB2.S=Po\u017Eadovan\u00E1 vlastnost {0} nebyla nalezena v seznamu vlastnost\u00ED poskytnut\u00E9m metod\u011B createConglomerate() pro sekund\u00E1rn\u00ED index b-stromu.
42503=U\u017Eivatel ''{0}'' nem\u00E1 povolen\u00ED {1} ke sloupci ''{2}'' tabulky ''{3}''.''{4}'' pro ud\u011Blen\u00ED.
43X89.U=Lev\u00E9 vn\u011Bj\u0161\u00ED slou\u010Den\u00ED vno\u0159en\u00E9 smy\u010Dky
42Y98.U=Zji\u0161t\u011Bno "{0}" na \u0159\u00E1dku {1}, sloupec {2}
08006.C.8=org.apache.derby.jdbc.EmbeddedDriver nen\u00ED registrov\u00E1n ve spr\u00E1vci ovlada\u010D\u016F JDBC
08006.C.6=Pokus o \u00FApln\u00E9 uskute\u010Dn\u011Bn\u00ED dat protokolu, kter\u00E1 jsou p\u0159\u00EDli\u0161 velk\u00E1 pro JVM. Spojen\u00ED bylo ukon\u010Deno.
22019=Neplatn\u00E1 \u00FAnikov\u00E1 sekvence ''{0}''. \u0158et\u011Bzec \u00FAnikov\u00E9 sekvence mus\u00ED m\u00EDt p\u0159esn\u011B jeden znak. Nesm\u00ED m\u00EDt hodnotu ''null'' nebo v\u00EDce ne\u017E jeden znak.
08006.C.5=Nedostatek dat p\u0159i na\u010D\u00EDt\u00E1n\u00ED ze s\u00EDt\u011B - o\u010Dek\u00E1valo se minim\u00E1ln\u011B {0} bajt\u016F a bylo p\u0159ijato pouze {1} bajt\u016F. Spojen\u00ED bylo ukon\u010Deno.
25502=Zm\u011Bna dat SQL nen\u00ED povolena pro p\u0159ipojen\u00ED, u\u017Eivatele nebo datab\u00E1zi pouze pro \u010Dten\u00ED.
08006.C.4=Vyskytla se chyba b\u011Bhem odlo\u017Een\u00E9ho resetov\u00E1n\u00ED spojen\u00ED a spojen\u00ED bylo ukon\u010Deno. Podrobnosti viz z\u0159et\u011Bzen\u00E9 v\u00FDjimky.
23513=Bylo p\u0159ekro\u010Deno kontroln\u00ED omezen\u00ED ''{1}'' p\u0159i prov\u00E1d\u011Bn\u00ED p\u0159\u00EDkazu INSERT nebo UPDATE v tabulce ''{0}''.
08006.C.3=Byla detekov\u00E1na chyba komunikac\u00ED\: {0}.
08006.C.2=V\u00FDjimka soketu\: ''{0}''
08006.C.1=Vyskytla se chyba b\u011Bhem resetov\u00E1n\u00ED p\u0159ipojen\u00ED a p\u0159ipojen\u00ED bylo ukon\u010Deno. Podrobnosti viz z\u0159et\u011Bzen\u00E9 v\u00FDjimky.
58010.C=Byla zji\u0161t\u011Bna chyba s\u00ED\u0165ov\u00E9ho protokolu. Spojen\u00ED nebylo ustanoveno, proto\u017Ee spr\u00E1vce {0} na \u00FArovni {1} nen\u00ED podporov\u00E1n serverem. 
XSDB1.D=Nezn\u00E1m\u00FD form\u00E1t str\u00E1nky na str\u00E1nce {0}
42Z97=P\u0159ejmenov\u00E1n\u00ED sloupce ''{0}'' zp\u016Fsob\u00ED p\u0159eru\u0161en\u00ED kontroln\u00EDho omezen\u00ED ''{1}''.
XBM0K.D=Nezn\u00E1m\u00FD podprotokol pro jm\u00E9no datab\u00E1ze {0}.
XSDA2.S=Byl u\u010Din\u011Bn pokus o aktualizaci vymazan\u00E9ho z\u00E1znamu
22028=\u0158et\u011Bzec p\u0159ekra\u010Duje maxim\u00E1ln\u00ED d\u00E9lku {0}.
42Z88.U=sd\u00EDlet \u0159\u00E1dek
43X98.U=Projektovat omezen\u00ED
42Z79=Nelze ur\u010Dit typ parametru pro XMLPARSE; zkuste pou\u017E\u00EDt CAST.
XD004.S=Nelze ulo\u017Eit z\u00E1vislosti.
08006.D=Vypnut\u00ED datab\u00E1ze ''{0}''.
08006.C=Byla zji\u0161t\u011Bna chyba s\u00ED\u0165ov\u00E9ho protokolu a spojen\u00ED bylo ukon\u010Deno\: {0}
54023=Byl p\u0159ekro\u010Den limit po\u010Dtu parametr\u016F procedury. Limit je {0} a po\u010Det parametr\u016F procedury {1} je {2}.
