#Thu May 16 17:55:33 BRT 2013
42611=El atributo de longitud, precisi\u00F3n o escala para columna o correlaci\u00F3n de tipo ''{0}'' no es v\u00E1lido. 
40XD0=Se ha cerrado el contenedor.
XSCB2.S=No se ha encontrado la propiedad necesaria {0} en la lista de propiedades dada para createConglomerate() de un \u00EDndice secundario btree.
42503=El usuario ''{0}'' no tiene el permiso de {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}'' para concesi\u00F3n.
43X89.U=Uni\u00F3n externa izquierda de bucle anidado
42Y98.U=Se ha encontrado ''{0}'' en la l\u00EDnea {1}, columna {2}
42XA1=La cl\u00E1usula de generaci\u00F3n de la columna ''{0}'' contiene un agregado. No est\u00E1 permitido.
08006.C.6=Se ha intentado materializar por completo datos lob demasiado grandes para JVM.  La conexi\u00F3n se ha finalizado.
22019=Secuencia de escape no v\u00E1lida, ''{0}''. La serie de escape debe contener exactamente un car\u00E1cter. No puede ser nula o contener m\u00E1s de un car\u00E1cter.
08006.C.5=No hay suficientes datos mientras se lee desde la red - se esperaba un m\u00EDnimo de {0} y s\u00F3lo se han recibido {1} bytes.  La conexi\u00F3n se ha finalizado.
25502=No se permite un cambio de datos SQL en una conexi\u00F3n, usuario o base de datos de s\u00F3lo lectura.
08006.C.4=Se ha producido un error durante un restablecimiento de conexi\u00F3n diferido y la conexi\u00F3n se ha finalizado.  Consulte las excepciones encadenadas para obtener detalles.
23513=La restricci\u00F3n de comprobaci\u00F3n ''{1}'' se ha violado al realizar un INSERT o UPDATE en la tabla ''{0}''.
08006.C.3=Se ha detectado un error de comunicaciones\: {0}.
08006.C.2=SocketException\: ''{0}''
42X99=No se permiten par\u00E1metros en una definici\u00F3n de TABLE.
08006.C.1=Se ha producido un error durante un restablecimiento de la conexi\u00F3n y se ha finalizado la conexi\u00F3n.  Consulte las excepciones encadenadas para obtener detalles.
58010.C=Se ha encontrado un error de protocolo de red.  No se ha podido establecer una conexi\u00F3n debido a que el gestor {0} en el nivel {1} no est\u00E1 soportado en el servidor. 
XSDB1.D=Formato de p\u00E1gina desconocido en la p\u00E1gina {0}
42Z97=La columna restante ''{0}'' originar\u00E1 que la restricci\u00F3n de comprobaci\u00F3n ''{1}'' se interrumpa.
XBM0K.D=Subprotocolo desconocido para el nombre de base de datos {0}.
XSDA2.S=Se ha intentado actualizar un registro suprimido
22028=La serie excede la longitud m\u00E1xima de {0}.
42Z88.U=compartir fila
43X98.U=Proyecto restricci\u00F3n
42Z79=No se puede determinar el tipo de par\u00E1metro para XMLPARSE; intente utilizar CAST.
XD004.S=Imposible almacenar dependencias.
08006.D=Conclusi\u00F3n de la base de datos ''{0}''.
08006.C=Se ha encontrado un error de protocolo de red y se ha finalizado la conexi\u00F3n\: {0}
54023=Se ha excedido el l\u00EDmite del n\u00FAmero de par\u00E1metros para un procedimiento. El l\u00EDmite es {0} y el n\u00FAmero de par\u00E1metros del procedimiento {1} es {2}.
08006.D.1=Base de datos ''{0}'' eliminada.
