#Thu May 16 17:55:33 BRT 2013
42611=\u5217\u306E\u9577\u3055\u3001\u7CBE\u5EA6\u3001\u307E\u305F\u306F\u6841\u6570\u306E\u5C5E\u6027\u3001\u307E\u305F\u306F\u3001\u578B\u306E\u30DE\u30C3\u30D4\u30F3\u30B0 ''{0}'' \u304C\u7121\u52B9\u3067\u3059\u3002 
40XD0=\u30B3\u30F3\u30C6\u30CA\u30FC\u304C\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u307E\u3057\u305F\u3002
XSCB2.S=\u5FC5\u8981\u306A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC {0} \u304C\u3001btree \u306E 2 \u6B21\u7D22\u5F15\u306E createConglomerate() \u306B\u4E0E\u3048\u3089\u308C\u305F\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30EA\u30B9\u30C8\u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42503=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u8868 ''{3}''.''{4}'' \u306E\u5217 ''{2}'' \u306B\u5BFE\u3059\u308B GRANT \u6587\u306E {1} \u8A31\u53EF\u3092\u4E0E\u3048\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
43X89.U=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30EB\u30FC\u30D7\u306E\u5DE6\u5916\u90E8\u7D50\u5408
42Y98.U="{0}" \u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002\u884C {1}\u3001\u5217 {2}\u3002
42XA1=\u5217 ''{0}'' \u306E\u751F\u6210\u6587\u7BC0\u306B\u96C6\u5408\u4F53\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
08006.C.6=JVM \u306B\u5BFE\u3057\u3066\u5927\u304D\u3059\u304E\u308B LOB \u30C7\u30FC\u30BF\u3092\u5B8C\u5168\u306B\u30DE\u30C6\u30EA\u30A2\u30E9\u30A4\u30BA\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
22019=\u7121\u52B9\u306A\u30A8\u30B9\u30B1\u30FC\u30D7\u30FB\u30B7\u30FC\u30B1\u30F3\u30B9\u3067\u3059\: ''{0}''\u3002 \u30A8\u30B9\u30B1\u30FC\u30D7\u30FB\u30B9\u30C8\u30EA\u30F3\u30B0\u306F\u30011 \u6587\u5B57\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 NULL \u3067\u3082 2 \u6587\u5B57\u4EE5\u4E0A\u3067\u3082\u3044\u3051\u307E\u305B\u3093\u3002
08006.C.5=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u304B\u3089\u8AAD\u307F\u53D6\u308A\u4E2D\u306E\u30C7\u30FC\u30BF\u304C\u4E0D\u5341\u5206\u3067\u3059\u3002{0} \u30D0\u30A4\u30C8\u4EE5\u4E0A\u306E\u30C7\u30FC\u30BF\u3092\u4E88\u671F\u3057\u3066\u3044\u307E\u3057\u305F\u304C\u53D7\u4FE1\u3057\u305F\u30C7\u30FC\u30BF\u306F {1} \u30D0\u30A4\u30C8\u306E\u307F\u3067\u3057\u305F\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
25502=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u63A5\u7D9A\u3001\u30E6\u30FC\u30B6\u30FC\u3001\u307E\u305F\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u3001SQL \u30C7\u30FC\u30BF\u5909\u66F4\u306F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
08006.C.4=\u636E\u3048\u7F6E\u304D\u63A5\u7D9A\u306E\u30EA\u30BB\u30C3\u30C8\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u3001\u63A5\u7D9A\u304C\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002  \u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001\u4ED8\u968F\u3059\u308B\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
23513=\u8868 ''{0}'' \u3067 INSERT \u307E\u305F\u306F UPDATE \u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u3068\u304D\u306B\u30C1\u30A7\u30C3\u30AF\u5236\u7D04 ''{1}'' \u306E\u9055\u53CD\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
08006.C.3=\u901A\u4FE1\u30A8\u30E9\u30FC\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\: {0}\u3002
08006.C.2=SocketException\: ''{0}''
42X99=\u8868\u306E\u5B9A\u7FA9\u306B\u30D1\u30E9\u30E1\u30FC\u30BF\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
08006.C.1=\u63A5\u7D9A\u306E\u30EA\u30BB\u30C3\u30C8\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u3001\u63A5\u7D9A\u304C\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002  \u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001\u4ED8\u968F\u3059\u308B\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
58010.C=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u30FB\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u30EC\u30D9\u30EB {1} \u306E\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC {0} \u306F\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u308A\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u63A5\u7D9A\u3092\u78BA\u7ACB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002 
XSDB1.D=\u30DA\u30FC\u30B8 {0} \u306B\u4E0D\u660E\u306E\u30DA\u30FC\u30B8\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u304C\u3042\u308A\u307E\u3059
42Z97=\u5217 ''{0}'' \u3092\u540D\u524D\u5909\u66F4\u3059\u308B\u3068\u30C1\u30A7\u30C3\u30AF\u5236\u7D04 ''{1}'' \u306B\u9055\u53CD\u3057\u307E\u3059\u3002
XBM0K.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u540D {0} \u306E\u30B5\u30D6\u30D7\u30ED\u30C8\u30B3\u30EB\u304C\u4E0D\u660E\u3067\u3059\u3002
XSDA2.S=\u524A\u9664\u6E08\u307F\u30EC\u30B3\u30FC\u30C9\u3092\u66F4\u65B0\u3057\u3088\u3046\u3068\u3057\u307E\u3057\u305F
22028=\u30B9\u30C8\u30EA\u30F3\u30B0\u304C\u6700\u5927\u9577\u3067\u3042\u308B {0} \u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
42Z88.U=\u5171\u7528\u884C
43X98.U=\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u5236\u7D04
42Z79=XMLPARSE \u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u578B\u3092\u5224\u5225\u3067\u304D\u307E\u305B\u3093\u3002CAST \u3092\u4F7F\u7528\u3057\u3066\u307F\u3066\u304F\u3060\u3055\u3044\u3002
XD004.S=\u5F93\u5C5E\u95A2\u4FC2\u3092\u4FDD\u7BA1\u3067\u304D\u307E\u305B\u3093\u3002
08006.D=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u304C\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002
08006.C=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D7\u30ED\u30C8\u30B3\u30EB\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u3001\u63A5\u7D9A\u304C\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\: {0}
54023=\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u306B\u5BFE\u3059\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6570\u304C\u5236\u9650\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002 \u5236\u9650\u306F {0} \u3067\u3001\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC {1} \u306B\u5BFE\u3059\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6570\u306F {2} \u3067\u3059\u3002
08006.D.1=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 ''{0}'' \u304C\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
