#Thu May 16 17:55:33 BRT 2013
42611=Atrybut d\u0142ugo\u015Bci, dok\u0142adno\u015Bci lub skali dla kolumny albo odwzorowanie typu ''{0}'' nie s\u0105 poprawne. 
40XD0=Kontener zosta\u0142 zamkni\u0119ty.
XSCB2.S=Nie znaleziono wymaganej w\u0142a\u015Bciwo\u015Bci {0} na li\u015Bcie w\u0142a\u015Bciwo\u015Bci przekazanej do metody createConglomerate() dla dodatkowego indeksu b-drzewa.
42503=U\u017Cytkownik ''{0}'' nie ma uprawnienia {1} do kolumny ''{2}'' tabeli ''{3}''.''{4}'' do nadawania.
43X89.U=Lewostronne \u0142\u0105czenie zewn\u0119trzne zagnie\u017Cd\u017Cone
42Y98.U=Napotkano "{0}"; wiersz {1}, kolumna {2}
08006.C.8=Klasa org.apache.derby.jdbc.EmbeddedDriver nie jest zarejestrowana za pomoc\u0105 mened\u017Cera sterownika JDBC
08006.C.6=Pr\u00F3ba pe\u0142nego zmaterializowania danych LOB, kt\u00F3re s\u0105 zbyt du\u017Ce dla \u015Brodowiska JVM. Po\u0142\u0105czenie zosta\u0142o przerwane.
22019=Niepoprawna sekwencja o zmienionym znaczeniu\: ''{0}''. \u0141a\u0144cuch zmiany znaczenia musi mie\u0107 dok\u0142adnie jeden znak. Nie mo\u017Ce mie\u0107 warto\u015Bci null ani zawiera\u0107 wi\u0119cej ni\u017C jednego znaku.
08006.C.5=Niewystarczaj\u0105ca ilo\u015B\u0107 danych podczas odczytu z sieci - oczekiwano minimum {0} bajt\u00F3w, a otrzymano tylko {1} bajt\u00F3w. Po\u0142\u0105czenie zosta\u0142o przerwane.
25502=Zmiana danych SQL nie jest dozwolona dla po\u0142\u0105cze\u0144, u\u017Cytkownika lub bazy danych tylko do odczytu.
08006.C.4=Wyst\u0105pi\u0142 b\u0142\u0105d podczas odroczonego resetowania po\u0142\u0105czenia i po\u0142\u0105czenie zosta\u0142o zako\u0144czone. Szczeg\u00F3\u0142y zawieraj\u0105 kolejne wyj\u0105tki.
23513=Podczas wykonywania instrukcji INSERT lub UPDATE na tabeli ''{0}'' zosta\u0142o naruszone ograniczenie sprawdzaj\u0105ce ''{1}''.
08006.C.3=Wykryto b\u0142\u0105d komunikacji\: {0}.
08006.C.2=Wyj\u0105tekGniazda\: ''{0}''
08006.C.1=Wyst\u0105pi\u0142 b\u0142\u0105d podczas resetowania po\u0142\u0105czenia i po\u0142\u0105czenie zosta\u0142o zako\u0144czone. Szczeg\u00F3\u0142y zawieraj\u0105 kolejne wyj\u0105tki.
58010.C=Wyst\u0105pi\u0142 b\u0142\u0105d protoko\u0142u sieciowego. Po\u0142\u0105czenie nie mo\u017Ce by\u0107 nawi\u0105zane, poniewa\u017C serwer nie obs\u0142uguje mened\u017Cera {0} na poziomie {1}. 
XSDB1.D=Nieznany format strony na stronie {0}
42Z97=Zmiana nazwy kolumny ''{0}'' spowoduje naruszenie ograniczenia sprawdzaj\u0105cego ''{1}''.
XBM0K.D=Nieznany podprotok\u00F3\u0142 dla nazwy bazy danych {0}.
XSDA2.S=Nast\u0105pi\u0142a pr\u00F3ba aktualizowania usuni\u0119tego rekordu
22028=\u0141a\u0144cuch przekracza d\u0142ugo\u015B\u0107 maksymaln\u0105 r\u00F3wn\u0105 {0}.
42Z88.U=wsp\u00F3\u0142u\u017Cytkowany wiersz
43X98.U=Ograniczenie projektu
42Z79=Nie mo\u017Cna okre\u015Bli\u0107 typu parametru dla XMLPARSE. Spr\u00F3buj u\u017Cy\u0107 polecenia CAST.
XD004.S=Nie mo\u017Cna zapisa\u0107 zale\u017Cno\u015Bci.
08006.D=Baza danych ''{0}'' zosta\u0142a wy\u0142\u0105czona.
08006.C=Wyst\u0105pi\u0142 b\u0142\u0105d protoko\u0142u sieciowego i po\u0142\u0105czenie zosta\u0142o zako\u0144czone\: {0}
54023=Ograniczenie liczby parametr\u00F3w dla procedury zosta\u0142o przekroczone. Ograniczenie wynosi {0}, a liczba parametr\u00F3w dla procedury {1} to {2}.
