#Thu May 16 17:55:33 BRT 2013
42611=O atributo comprimento, precis\u00E3o ou escala para a coluna ou mapeamento de tipo ''{0}'' n\u00E3o \u00E9 v\u00E1lido.
40XD0=O cont\u00EAiner foi fechado.
XSCB2.S=A propriedade solicitada {0} n\u00E3o foi encontrada na lista de propriedades especificadas para createConglomerate() de um \u00EDndice secund\u00E1rio btree.
42503=O usu\u00E1rio ''{0}'' n\u00E3o possui a permiss\u00E3o {1} na coluna ''{2}'' da tabela ''{3}''.''{4}'' podendo conceder.
43X89.U=Jun\u00E7\u00E3o externa esquerda por la\u00E7o aninhado
42Y98.U=Encontrado "{0}" na linha {1}, coluna {2}
08006.C.8=org.apache.derby.jdbc.EmbeddedDriver n\u00E3o est\u00E1 registrado com o gerenciador do driver JDBC
08006.C.6=Tentativa de materializar completamente dados LOB muito grandes para a JVM.  A conex\u00E3o foi encerrada.
22019=Seq\u00FC\u00EAncia de escape inv\u00E1lida, ''{0}''. A cadeia de caracteres de escape deve ter exatamente um caractere\: n\u00E3o pode ser nula ou ter mais de um caractere.
08006.C.5=Dados insuficientes ao ler da rede - esperado um m\u00EDnimo de {0} bytes mas recebido apenas {1} bytes.  A conex\u00E3o foi encerrada.
25502=N\u00E3o \u00E9 permitida altera\u00E7\u00E3o nos dados SQL em conex\u00F5es, usu\u00E1rios e bancos de dados apenas-de-leitura.
08006.C.4=Ocorreu um erro durante uma redefini\u00E7\u00E3o de conex\u00E3o postergada e a conex\u00E3o foi encerrada.  Consulte as exce\u00E7\u00F5es encadeadas para obter detalhes.
23513=Viola\u00E7\u00E3o da restri\u00E7\u00E3o de verifica\u00E7\u00E3o ''{1}'' ao realizar INSERT ou UPDATE na tabela ''{0}''.
08006.C.3=Foi detectado um erro de comunica\u00E7\u00E3o\: {0}.
08006.C.2=SocketException\: ''{0}''
08006.C.1=Ocorreu um erro durante a redefini\u00E7\u00E3o da conex\u00E3o, e a conex\u00E3o foi encerrada.  Consulte as exce\u00E7\u00F5es encadeadas para obter detalhes.
58010.C=Foi encontrado um erro de protocolo de rede.  N\u00E3o foi poss\u00EDvel estabelecer uma conex\u00E3o, porque o gerenciador {0} no n\u00EDvel {1} n\u00E3o \u00E9 suportado pelo servidor.
XSDB1.D=Formato de p\u00E1gina desconhecido na p\u00E1gina {0}
42Z97=Renomear a coluna ''{0}'' causar\u00E1 a quebra da restri\u00E7\u00E3o de verifica\u00E7\u00E3o ''{1}''.
XBM0K.D=Subprotocolo desconhecido para o banco de dados de nome {0}.
XSDA2.S=Tentativa de atualizar um registro exclu\u00EDdo
22028=A cadeia de caracteres excede o comprimento m\u00E1ximo de {0}.
42Z88.U=compartilhar linha
43X98.U=Restrito ao Projeto
42Z79=Imposs\u00EDvel determinar o tipo de par\u00E2metro para XMLPARSE; tente utilizar um CAST.
XD004.S=N\u00E3o foi poss\u00EDvel armazenar depend\u00EAncias.
08006.D=Banco de dados ''{0}'' fechado.
08006.C=Foi encontrado um erro de protocolo de rede e a conex\u00E3o foi encerrada\: {0}
54023=Foi excedido o n\u00FAmero m\u00E1ximo de par\u00E2metros para um procedimento. No m\u00E1ximo s\u00E3o {0}, e o procedimento {1} possui {2} par\u00E2metros.
