#Thu May 16 17:55:33 BRT 2013
43X99.U=ResultSet de ligne
54006=La longueur r\u00E9sultant de l''op\u00E9ration {0} est sup\u00E9rieure \u00E0 {1}.
42ZA0=Instruction trop complexe. Essayez de r\u00E9\u00E9crire la requ\u00EAte afin de la simplifier. L''\u00E9limination de nombreuses expressions en double ou la rupture de la requ\u00EAte et le stockage des r\u00E9sultats interm\u00E9diaires dans une table temporaire permettent souvent de r\u00E9soudre cette erreur.
40XD1=Le conteneur a \u00E9t\u00E9 ouvert en mode lecture seule.
XBM0L.D=La classe de m\u00E9thode d''authentification sp\u00E9cifi\u00E9e {0} n''impl\u00E9mente pas l''interface d''authentification {1}.
25503=Une DDL n''est pas autoris\u00E9e pour une connexion, un utilisateur ou une base de donn\u00E9es en lecture seule.
38004=La routine a tent\u00E9 de lire des donn\u00E9es, cependant elle n''a pas \u00E9t\u00E9 d\u00E9finie en ce sens (READS SQL DATA).
XSCB3.S=Fonction non impl\u00E9ment\u00E9e.
42621=Une contrainte de v\u00E9rification ou une colonne g\u00E9n\u00E9r\u00E9e d\u00E9finie par ''{0}'' n''est pas valide.
42Y99.U=Erreur lexicale \u00E0 la ligne {0}, colonne {1}. Exception rencontr\u00E9e \: {2}
XIE0M.S=La table ''{0}'' n''existe pas.  
XSDA3.S=Restriction \: L''enregistrement ne peut pas \u00EAtre mis \u00E0 jour ou ins\u00E9r\u00E9 en raison du manque d''espace sur la page. Utilisez les param\u00E8tres derby.storage.pageSize et/ou derby.storage.pageReservedSpace pour contourner cette restriction.
42XA2=''{0}'' ne peut pas figurer dans une CLAUSE DE G\u00C9N\u00C9RATION, car il pourrait renvoyer des r\u00E9sultats peu fiables.
23505=L''instruction a \u00E9t\u00E9 abandonn\u00E9e parce qu''elle aurait entra\u00EEn\u00E9 la duplication d''une valeur de cl\u00E9 dans une contrainte de cl\u00E9 ou d''index unique identifi\u00E9 par ''{0}'' d\u00E9finie sur ''{1}''.
XSDB2.D=Format de conteneur inconnu au niveau du conteneur {0} \: {1}
42504=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur {2} ''{3}''.''{4}''.
