#Thu May 16 17:55:33 BRT 2013
43X99.U=ResultSet sor
54006=A(z) {0} m\u0171veletb\u0151l eredm\u00E9ny\u00FCl kapott hossz nagyobb, mint {1}.
42ZA0=Az utas\u00EDt\u00E1s t\u00FAl \u00F6sszetett. Pr\u00F3b\u00E1lja meg a lek\u00E9rdez\u00E9st \u00FAjra\u00EDrni az \u00F6sszetetts\u00E9g megsz\u00FCntet\u00E9se \u00E9rdek\u00E9ben. A t\u00F6bbsz\u00F6r\u00F6s kifejez\u00E9sek nagy r\u00E9sz\u00E9nek megsz\u00FCntet\u00E9se vagy a lek\u00E9rdez\u00E9s megszak\u00EDt\u00E1sa \u00E9s a k\u00F6ztes eredm\u00E9nyek ideiglenes t\u00E1bl\u00E1ban t\u00E1rol\u00E1sa gyakran seg\u00EDt a hiba felold\u00E1s\u00E1ban.
40XD1=A t\u00E1rol\u00F3 megnyitva \u00EDr\u00E1sv\u00E9dett m\u00F3dban.
XBM0L.D=A megadott hiteles\u00EDt\u00E9si s\u00E9maoszt\u00E1ly ({0}) nem val\u00F3s\u00EDtja meg a(z) {1} hiteles\u00EDt\u00E9si fel\u00FCletet.
25503=A DDL csak olvashat\u00F3 kapcsolat, felhaszn\u00E1l\u00F3 vagy adatb\u00E1zis eset\u00E9n nem megengedett.
38004=A rutin megpr\u00F3b\u00E1l adatokat olvasni, de nem READS SQL DATA elemk\u00E9nt lett megadva.
XSCB3.S=Nem megval\u00F3s\u00EDtott szolg\u00E1ltat\u00E1s.
42621=A(z) ''{0}'' elemmel megadott ellen\u0151rz\u00E9si megszor\u00EDt\u00E1s vagy el\u0151\u00E1ll\u00EDtott oszlop \u00E9rv\u00E9nytelen.
42Y99.U=Lexikai hiba a(z) {0}. sor {1}. oszlop\u00E1ban. \u00C9szlelt \u00E9rt\u00E9k\: {2}
XIE0M.S=A(z) ''{0}'' t\u00E1bla nem l\u00E9tezik.  
XSDA3.S=Korl\u00E1toz\u00E1s\: A rekord nem friss\u00EDthet\u0151 vagy sz\u00FArhat\u00F3 be az oldalon fenn\u00E1ll\u00F3 helyhi\u00E1ny miatt. A korl\u00E1toz\u00E1s megker\u00FCl\u00E9s\u00E9hez haszn\u00E1lja a derby.storage.pageSize \u00E9s/vagy derby.storage.pageReservedSpace param\u00E9tereket.
23505=Az utas\u00EDt\u00E1s megszak\u00EDt\u00E1sra ker\u00FClt, mivel t\u00F6bbsz\u00F6r\u00F6s kulcs\u00E9rt\u00E9ket okozott volna egy egyedi vagy els\u0151dleges kulcs megszor\u00EDt\u00E1sban vagy a(z) ''{0}'' \u00E1ltal azonos\u00EDtott \u00E9s a k\u00F6vetkez\u0151n meghat\u00E1rozott egyedi indexben\: ''{1}''.
XSDB2.D=Ismeretlen t\u00E1rol\u00F3form\u00E1tum az() {0} t\u00E1rol\u00F3n\: {1}
42504=A(z) ''{0}'' felhaszn\u00E1l\u00F3 nem rendelkezik v\u00E9grehajt\u00E1s jogosults\u00E1ggal a(z) {1} ''{2}''.''{3}'' elemhez.
