#Thu May 16 17:55:33 BRT 2013
43X99.U=ResultSet - \u0421\u0442\u0440\u043E\u043A\u0430
54006=\u0414\u043B\u0438\u043D\u0430, \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u0430\u044F \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 {0}, \u0431\u043E\u043B\u044C\u0448\u0435 {1}.
42ZA0=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u0441\u043B\u043E\u0436\u043D\u044B\u0439. \u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043F\u0435\u0440\u0435\u043F\u0438\u0441\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441, \u0447\u0442\u043E\u0431\u044B \u0435\u0433\u043E \u0443\u043F\u0440\u043E\u0441\u0442\u0438\u0442\u044C. \u042D\u0442\u0443 \u043E\u0448\u0438\u0431\u043A\u0443 \u0447\u0430\u0441\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0443\u0441\u0442\u0440\u0430\u043D\u0438\u0442\u044C, \u0443\u0431\u0440\u0430\u0432 \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442\u044B \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0439 \u0438\u043B\u0438 \u0440\u0430\u0437\u0431\u0438\u0432 \u0437\u0430\u043F\u0440\u043E\u0441 \u043D\u0430 \u0447\u0430\u0441\u0442\u0438 \u0438 \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0432 \u043F\u0440\u043E\u043C\u0435\u0436\u0443\u0442\u043E\u0447\u043D\u044B\u0435 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0432\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435.
40XD1=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 \u043E\u0442\u043A\u0440\u044B\u0442 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0442\u043E\u043B\u044C\u043A\u043E-\u0447\u0442\u0435\u043D\u0438\u044F.
XBM0L.D=\u0423\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0439 \u043A\u043B\u0430\u0441\u0441 \u0441\u0445\u0435\u043C\u044B \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 {0} \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 {1}.
25503=DDL \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0438\u043B\u0438 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0442\u043E\u043B\u044C\u043A\u043E-\u0434\u043B\u044F-\u0447\u0442\u0435\u043D\u0438\u044F.
38004=\u041F\u043E\u0434\u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0430 \u043F\u043E\u043F\u044B\u0442\u0430\u043B\u0430\u0441\u044C \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435, \u043D\u043E \u043F\u043E\u0434\u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0430 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u0430 \u043A\u0430\u043A READS SQL DATA.
XSCB3.S=\u041D\u0435\u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u044F.
42621=\u041A\u043E\u043D\u0442\u0440\u043E\u043B\u044C\u043D\u043E\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0438\u043B\u0438 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0441\u0442\u043E\u043B\u0431\u0435\u0446, \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0435 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C ''{0}'', \u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u043C\u0438.
42Y99.U=\u041B\u0435\u043A\u0441\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430 \u0432 \u0441\u0442\u0440\u043E\u043A\u0435 {0}, \u0441\u0442\u043E\u043B\u0431\u0446\u0435 {1}. \u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u043E\: {2}
XIE0M.S=\u0422\u0430\u0431\u043B\u0438\u0446\u0430 ''{0}'' \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.  
XSDA3.S=\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435\: \u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0438\u043B\u0438 \u0432\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0437\u0430\u043F\u0438\u0441\u044C \u0438\u0437-\u0437\u0430 \u043D\u0435\u0445\u0432\u0430\u0442\u043A\u0438 \u043C\u0435\u0441\u0442\u0430 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435. \u0427\u0442\u043E\u0431\u044B \u043E\u0431\u043E\u0439\u0442\u0438 \u044D\u0442\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B derby.storage.pageSize \u0438/\u0438\u043B\u0438 derby.storage.pageReservedSpace.
23505=\u041E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 \u043F\u0440\u0435\u043A\u0440\u0430\u0449\u0435\u043D\u0430, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043F\u0440\u0438 \u044D\u0442\u043E\u043C \u0431\u044B\u043B \u0431\u044B \u0441\u043E\u0437\u0434\u0430\u043D \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043B\u044E\u0447\u0430 \u0432 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0438 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0438\u043B\u0438 \u0433\u043B\u0430\u0432\u043D\u043E\u0433\u043E \u043A\u043B\u044E\u0447\u0430 \u0438\u043B\u0438 \u0432 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u043C \u0438\u043D\u0434\u0435\u043A\u0441\u0435, \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u043C \u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 ''{0}'', \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u043C \u0432 ''{1}''.
XSDB2.D=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0439 \u0444\u043E\u0440\u043C\u0430\u0442 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0435 {0} \: {1}
42504=\u0423 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F ''{0}'' \u043D\u0435\u0442 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F \u043D\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0434\u043B\u044F {1} ''{2}''.''{3}''.
