#Thu May 16 17:55:33 BRT 2013
0A000.S.4=Der Server bietet keine Unterst\u00FCtzung f\u00FCr cancel().
42506=Benutzer ''{0}''ist nicht Eigent\u00FCmer von {1} ''{2}''.''{3}''.
0A000.S.3=Das resultSetHoldability-Merkmal {0} wird nicht unterst\u00FCtzt.
XJ100.S=Die von der Methode registerOutParameter angegebene Anzahl Nachkommastellen passt nicht zur setter-Methode. Ein Genauigkeitsverlust ist m\u00F6glich\!
0A000.S.2=Die JDBC-Methode {0} wird nicht vom Server unterst\u00FCtzt. F\u00FChren Sie ein Serverupgrade durch.
0A000.S.1=Die JDBC-Methode ist noch nicht implementiert.
XBCX0.S=Ausnahme vom Verschl\u00FCsselungsprovider. Details enth\u00E4lt die n\u00E4chste Ausnahme.
42ZC0=Fenster ''{0}'' ist nicht definiert.
0A000.C.6=Der DRDA-Befehl {0} ist derzeit nicht implementiert. Die Verbindung wurde beendet.
XSDB4.D=Die Seite {0} hat den Versionsstand {1}. Die Protokolldatei enth\u00E4lt die \u00C4nderungsversion {2}. Es fehlen Protokolls\u00E4tze dieser Seite oder die Seite wurde nicht ordnungsgem\u00E4\u00DF auf den Datentr\u00E4ger geschrieben.
54008=Die Anweisung CREATE INDEX gibt zu viele Spalten an. (Das Maximum liegt bei 16.)
XSDF0.S=Die Datei {0} konnte nicht erstellt werden, da sie bereits vorhanden ist.
XBM0N.D=Die JDBC-Treiberregistrierung mit java.sql.DriverManager ist gescheitert. Details enth\u00E4lt die n\u00E4chste Ausnahme. 
42XA4=Die Erstellungsklausel f\u00FCr die Spalte ''{0}'' verweist auf andere generierte Spalten. Dies ist unzul\u00E4ssig.
XSDA5.S=Es wurde versucht, das L\u00F6schen eines nicht gel\u00F6schten Datensatzes zu widerrufen.
25505=Ein Benutzer mit Lesezugriff oder der Benutzer einer schreibgesch\u00FCtzten Datenbank ist nicht berechtigt, den Schreibschutzmodus f\u00FCr eine Verbindung zu inaktivieren.
42ZA2=Der Operand LIKE mit dem Typ {0} und der Kollation {1} ist nicht kompatabel mit dem LIKE-Musteroperand mit Typ {2} und Kollation {3}.
0A000.S=Nicht implementiertes Feature\: {0}.
42821=Spalten vom Typ ''{0}'' d\u00FCrfen keine Werte des Typs ''{1}'' enthalten. 
XK000.S=Die Sicherheitsrichtlinie konnte nicht neu geladen werden\: {0}
XJ010.S=SAVEPOINT kann nicht abgesetzt werden, wenn autoCommit aktiviert ist.
42605=Die Anzahl der Argumente f\u00FCr die Funktion ''{0}'' ist falsch.
42ZB1=Parameterstil DERBY_JDBC_RESULT_SET ist nur bei Tabellenfunktionen zul\u00E4ssig.
XSCG0.S=Eine Schablone konnte nicht erstellt werden.
42803=Ein Ausdruck mit der Spalte ''{0}'' erscheint in der SELECT-Liste und ist nicht Bestandteil einer ''GROUP BY''-Klausel.
XSCB5.S=W\u00E4hrend des logischen Widerrufs einer Einf\u00FCge- oder L\u00F6schoperation f\u00FCr eine B-Baumstruktur kann die Zeile in der Baumstruktur nicht gefunden werden.
28502=Der Benutzername ''{0}'' ist ung\u00FCltig. 
XCXB0.S=Ung\u00FCltiger Datenbankklassenpfad\: ''{0}''.
XJ001.U=Java-Ausnahme\: ''{1}\: {0}''.
0A000.S.7=Der Datentyp ''{0}'' wird nicht unterst\u00FCtzt. 
0A000.S.5=Der Sicherheitsmechanismus ''{0}'' wird nicht unterst\u00FCtzt.
