#Thu May 16 17:55:33 BRT 2013
0A000.S.4=A cancel() f\u00FCggv\u00E9nyt a kiszolg\u00E1l\u00F3 nem t\u00E1mogatja.
42506=A(z) ''{0}'' felhaszn\u00E1l\u00F3 nem a(z) {1} ''{2}''.''{3}'' tulajdonosa.
0A000.S.3=A(z) {0} resultSetHoldability tulajdons\u00E1g nem t\u00E1mogatott
XJ100.S=A registerOutParameter met\u00F3dus \u00E1ltal biztos\u00EDtott sk\u00E1la nem felel meg a setter met\u00F3dusnak. Pontoss\u00E1gveszt\u00E9s l\u00E9phet fel\!
0A000.S.2=A(z) {0} JDBC met\u00F3dust a kiszolg\u00E1l\u00F3 nem t\u00E1mogatja. Friss\u00EDtse a kiszolg\u00E1l\u00F3t.
0A000.S.1=A JDBC met\u00F3dus m\u00E9g nem ker\u00FClt megval\u00F3s\u00EDt\u00E1sra.
XBCX0.S=Kiv\u00E9tel a kriptogr\u00E1fiaszolg\u00E1ltat\u00F3t\u00F3l. R\u00E9szletek\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt.
0A000.C.6=A(z) {0} DRDA parancs jelenleg nincs megval\u00F3s\u00EDtva.  A kapcsolat lez\u00E1r\u00E1sra ker\u00FClt.
XSDB4.D=A(z) {0} oldal {1} verzi\u00F3sz\u00E1m\u00FA, a napl\u00F3f\u00E1jl {2} verzi\u00F3sz\u00E1m\u00FA m\u00F3dos\u00EDt\u00E1st tartalmaz, az oldalr\u00F3l napl\u00F3bejegyz\u00E9sek hi\u00E1nyoznak, vagy az oldal nem megfelel\u0151en ker\u00FClt ki\u00EDr\u00E1sra a lemezre.
54008=A CREATE INDEX utas\u00EDt\u00E1s t\u00FAl sok oszlopot ad meg (16 a maximum).
XSDF0.S=A(z) {0} f\u00E1jl nem hozhat\u00F3 l\u00E9tre, mivel m\u00E1r l\u00E9tezik.
XBM0N.D=A JDBC illeszt\u0151program regisztr\u00E1ci\u00F3ja meghi\u00FAsult a java.sql.DriverManagerhez. R\u00E9szletek\u00E9rt tekintse meg a k\u00F6vetkez\u0151 kiv\u00E9telt. 
XSDA5.S=K\u00EDs\u00E9rlet t\u00F6rt\u00E9nt egy nem t\u00F6r\u00F6lt rekord t\u00F6rl\u00E9s\u00E9nek visszavon\u00E1s\u00E1ra
25505=Csak olvashat\u00F3 felhaszn\u00E1l\u00F3 vagy egy csak olvashat\u00F3 adatb\u00E1zis felhaszn\u00E1l\u00F3ja nem tilthatja le a csak olvashat\u00F3 m\u00F3dot a kapcsolaton.
0A000.S=A szolg\u00E1ltat\u00E1s nem ker\u00FClt megval\u00F3s\u00EDt\u00E1sra\: {0}.
42821=''{0}'' t\u00EDpus\u00FA oszlop nem tartalmazhat ''{1}'' t\u00EDpus\u00FA \u00E9rt\u00E9keket. 
XJ010.S=Nem adhat\u00F3 ki ment\u00E9si pont, ha az autoCommit be van kapcsolva.
42605=A(z) ''{0}'' f\u00FCggv\u00E9ny argumentumainak sz\u00E1ma helytelen.
XSCG0.S=Nem hozhat\u00F3 l\u00E9tre sablon.
42803=A(z) ''{0}'' oszlopot tartalmaz\u00F3 kifejez\u00E9s megjelenik a SELECT list\u00E1ban \u00E9s a GROUP BY r\u00E9szkifejez\u00E9snek nem r\u00E9sze.
XSCB5.S=Egy b-fa besz\u00FAr\u00E1s vagy t\u00F6rl\u00E9s logikai visszavon\u00E1sa sor\u00E1n a sor nem tal\u00E1lhat\u00F3 a f\u00E1ban.
28502=A(z) ''{0}'' felhaszn\u00E1l\u00F3n\u00E9v \u00E9rv\u00E9nytelen. 
XCXB0.S=\u00C9rv\u00E9nytelen adatb\u00E1zis oszt\u00E1ly\u00FAtvonal\: ''{0}''.
XJ001.U=Java kiv\u00E9tel\: ''{1}\: {0}''.
0A000.S.7=A(z) ''{0}'' adatt\u00EDpus nem t\u00E1mogatott.
0A000.S.5=A(z) ''{0}'' biztons\u00E1gi mechanizmus nem t\u00E1mogatott.
