#Thu May 16 17:55:33 BRT 2013
0A000.S.4=cancel() \u306F\u30B5\u30FC\u30D0\u30FC\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
42506=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F {1} ''{2}''.''{3}'' \u306E\u6240\u6709\u8005\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
0A000.S.3=resultSetHoldability \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC {0} \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XJ100.S=registerOutParameter \u30E1\u30BD\u30C3\u30C9\u306B\u3088\u308A\u6307\u5B9A\u3055\u308C\u305F\u4F4D\u53D6\u308A\u304C setter \u30E1\u30BD\u30C3\u30C9\u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002 \u7CBE\u5EA6\u304C\u5931\u308F\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
0A000.S.2=JDBC \u30E1\u30BD\u30C3\u30C9 {0} \u306F\u30B5\u30FC\u30D0\u30FC\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 \u30B5\u30FC\u30D0\u30FC\u3092\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
0A000.S.1=JDBC \u30E1\u30BD\u30C3\u30C9\u306F\u307E\u3060\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XBCX0.S=\u6697\u53F7\u65B9\u5F0F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u306E\u4F8B\u5916\u3002 \u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001\u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
42ZC0=\u30A6\u30A3\u30F3\u30C9\u30A6 ''{0}'' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
0A000.C.6=DRDA \u30B3\u30DE\u30F3\u30C9 {0} \u306F\u73FE\u5728\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
XSDB4.D=\u30DA\u30FC\u30B8 {0} \u306F\u30D0\u30FC\u30B8\u30E7\u30F3 {1} \u3067\u3001\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306B\u306F\u5909\u66F4\u30D0\u30FC\u30B8\u30E7\u30F3 {2} \u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u30DA\u30FC\u30B8\u306E\u30ED\u30B0\u30FB\u30EC\u30B3\u30FC\u30C9\u304C\u6B20\u843D\u3057\u3066\u3044\u308B\u304B\u3001\u3053\u306E\u30DA\u30FC\u30B8\u304C\u6B63\u3057\u304F\u30C7\u30A3\u30B9\u30AF\u306B\u66F8\u304D\u8FBC\u307E\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
54008=CREATE INDEX \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C\u6307\u5B9A\u3059\u308B\u5217\u304C\u591A\u3059\u304E\u307E\u3059 (16 \u304C\u6700\u5927\u3067\u3059)\u3002
XSDF0.S=\u30D5\u30A1\u30A4\u30EB {0} \u306F\u3059\u3067\u306B\u5B58\u5728\u3059\u308B\u305F\u3081\u3001\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
XBM0N.D=java.sql.DriverManager \u3078\u306E JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u767B\u9332\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002 \u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001\u6B21\u306E\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
42XA4=\u5217 ''{0}'' \u306E\u751F\u6210\u6587\u7BC0\u306F\u751F\u6210\u3055\u308C\u305F\u307B\u304B\u306E\u5217\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
XSDA5.S=\u524A\u9664\u3055\u308C\u3066\u3044\u306A\u3044\u30EC\u30B3\u30FC\u30C9\u306E\u524A\u9664\u3092\u53D6\u308A\u6D88\u305D\u3046\u3068\u3057\u307E\u3057\u305F
25505=\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30E6\u30FC\u30B6\u30FC\u307E\u305F\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30E6\u30FC\u30B6\u30FC\u306F\u3001\u63A5\u7D9A\u306B\u5BFE\u3059\u308B\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30E2\u30FC\u30C9\u3092\u4F7F\u7528\u4E0D\u53EF\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
42ZA2=\u578B {0} \u3068\u7167\u5408\u9806\u5E8F {1} \u3092\u6307\u5B9A\u3057\u305F LIKE \u8FF0\u8A9E\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u306F\u3001\u578B {2} \u3068\u7167\u5408\u9806\u5E8F {3} \u3092\u6307\u5B9A\u3057\u305F LIKE \u30D1\u30BF\u30FC\u30F3\u30AA\u30DA\u30E9\u30F3\u30C9\u3068\u4E92\u63DB\u6027\u304C\u3042\u308A\u307E\u305B\u3093\u3002
0A000.S=\u30D5\u30A3\u30FC\u30C1\u30E3\u30FC\u306F\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\: {0}\u3002
42821=\u578B ''{0}'' \u306E\u5217\u306F\u578B ''{1}'' \u306E\u5024\u3092\u4FDD\u6301\u3067\u304D\u307E\u305B\u3093\u3002 
XK000.S=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30DD\u30EA\u30B7\u30FC\u3092\u518D\u8AAD\u307F\u8FBC\u307F\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: {0}
XJ010.S=autoCommit \u304C\u30AA\u30F3\u306B\u306A\u3063\u3066\u3044\u308B\u3068\u304D\u306B\u306F\u3001savepoint \u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002
42605=\u95A2\u6570 ''{0}'' \u306E\u5F15\u6570\u306E\u6570\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
42ZB1=\u30D1\u30E9\u30E1\u30FC\u30BF\u30B9\u30BF\u30A4\u30EB DERBY_JDBC_RESULT_SET \u306F\u3001\u8868\u6A5F\u80FD\u306B\u5BFE\u3057\u3066\u306E\u307F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
XSCG0.S=\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
42803=\u5217 ''{0}'' \u3092\u542B\u3080\u5F0F\u304C SELECT \u30EA\u30B9\u30C8\u306B\u51FA\u3066\u304D\u307E\u3059\u304C\u3001\u3053\u308C\u306F GROUP BY \u6587\u7BC0\u306E\u4E00\u90E8\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
XSCB5.S=btree \u633F\u5165\u307E\u305F\u306F\u524A\u9664\u306E\u8AD6\u7406 UNDO \u4E2D\u3001\u30C4\u30EA\u30FC\u3067\u3053\u306E\u884C\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
28502=\u30E6\u30FC\u30B6\u30FC\u540D ''{0}'' \u306F\u7121\u52B9\u3067\u3059\u3002 
XCXB0.S=\u7121\u52B9\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30AF\u30E9\u30B9\u30D1\u30B9\: ''{0}''\u3002
XJ001.U=Java \u4F8B\u5916\: ''{1}\: {0}''\u3002
0A000.S.7=\u30C7\u30FC\u30BF\u578B ''{0}'' \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
0A000.S.5=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30E1\u30AB\u30CB\u30BA\u30E0 ''{0}'' \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
