#Thu May 16 17:55:33 BRT 2013
0A000.S.4=N\u00E3o \u00E9 suportado cancel() pelo servidor.
42506=O usu\u00E1rio ''{0}'' n\u00E3o \u00E9 dono de {1} ''{2}''.''{3}''.
0A000.S.3=A propriedade resultSetHoldability {0} n\u00E3o \u00E9 suportada
XJ100.S=A escala fornecida pelo m\u00E9todo ''registerOutParameter'' n\u00E3o corresponde \u00E0 do m\u00E9todo definidor. Poss\u00EDvel perda de precis\u00E3o\!
0A000.S.2=O m\u00E9todo JDBC {0} n\u00E3o \u00E9 suportado pelo servidor. Por favor atualize o servidor.
0A000.S.1=O m\u00E9todo JDBC ainda n\u00E3o est\u00E1 implementado.
XBCX0.S=Exce\u00E7\u00E3o do provedor Cryptography. Consulte a pr\u00F3xima exce\u00E7\u00E3o para obter detalhes.
0A000.C.6=O comando DRDA {0} n\u00E3o est\u00E1 implementado atualmente.  A conex\u00E3o foi encerrada.
XSDB4.D=A p\u00E1gina {0} est\u00E1 na vers\u00E3o {1}, o arquivo de log cont\u00E9m altera\u00E7\u00F5es na vers\u00E3o {2}, est\u00E3o faltando registros de logs nesta p\u00E1gina ou a p\u00E1gina n\u00E3o foi gravada corretamente no disco.
54008=A instru\u00E7\u00E3o CREATE INDEX especifica colunas em excesso (o m\u00E1ximo s\u00E3o 16).
XSDF0.S=N\u00E3o foi poss\u00EDvel criar o arquivo {0}, o mesmo j\u00E1 existe.
XBM0N.D=Falha ao registrar o Driver JDBC com java.sql.DriverManager. Consulte a pr\u00F3xima exce\u00E7\u00E3o para obter detalhes.
XSDA5.S=Tentativa de recuperar um registro que n\u00E3o foi exclu\u00EDdo
25505=Um usu\u00E1rio apenas-de-leitura, ou um usu\u00E1rio em um banco de dados apenas-de-leitura, n\u00E3o pode desativar o modo apenas-de-leitura da conex\u00E3o.
0A000.S=Funcionalidade n\u00E3o implementada\: {0}.
42821=As colunas do tipo ''{0}'' n\u00E3o podem conter valores do tipo ''{1}''.
XJ010.S=N\u00E3o \u00E9 poss\u00EDvel colocar SAVEPOINT quando o a auto-efetiva\u00E7\u00E3o est\u00E1 ativa.
42605=O n\u00FAmero de argumentos para a fun\u00E7\u00E3o ''{0}'' n\u00E3o est\u00E1 correto.
XSCG0.S=N\u00E3o foi poss\u00EDvel criar o modelo.
42803=Aparece na lista SELECT uma express\u00E3o contendo a coluna ''{0}'' que n\u00E3o faz parte de uma cl\u00E1usula GROUP BY.
XSCB5.S=Durante o desfazimento l\u00F3gico da inser\u00E7\u00E3o ou exclus\u00E3o ''btree'' a linha n\u00E3o p\u00F4de ser encontrada na \u00E1rvore.
28502=O nome de usu\u00E1rio ''{0}'' n\u00E3o \u00E9 v\u00E1lido.
XCXB0.S=Caminho de classes do banco de dados inv\u00E1lido\: ''{0}''.
XJ001.U=Exce\u00E7\u00E3o Java\: ''{1}\: {0}''.
0A000.S.7=O tipo de dado ''{0}'' n\u00E3o \u00E9 suportado.
0A000.S.5=O mecanismo de seguran\u00E7a ''{0}'' n\u00E3o \u00E9 suportado.
