#Thu May 16 17:55:33 BRT 2013
0A000.S.4=cancel() \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u0435\u0440\u0432\u0435\u0440\u043E\u043C.
42506=\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C ''{0}'' \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432\u043B\u0430\u0434\u0435\u043B\u044C\u0446\u0435\u043C {1} ''{2}''.''{3}''.
0A000.S.3=\u0421\u0432\u043E\u0439\u0441\u0442\u0432\u043E resultSetHoldability {0} \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F
XJ100.S=\u041E\u0431\u043B\u0430\u0441\u0442\u044C, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u0432\u044B\u0434\u0430\u043B \u043C\u0435\u0442\u043E\u0434 registerOutParameter, \u043D\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043C\u0435\u0442\u043E\u0434\u0443 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438. \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u0430 \u043F\u043E\u0442\u0435\u0440\u044F \u0442\u043E\u0447\u043D\u043E\u0441\u0442\u0438\!
0A000.S.2=\u041C\u0435\u0442\u043E\u0434 JDBC {0} \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u0435\u0440\u0432\u0435\u0440\u043E\u043C. \u041E\u0431\u043D\u043E\u0432\u0438\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440.
0A000.S.1=\u041C\u0435\u0442\u043E\u0434 JDBC \u0435\u0449\u0435 \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D.
XBCX0.S=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043E\u0442 \u043F\u0440\u043E\u0432\u0430\u0439\u0434\u0435\u0440\u0430 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F. \u041F\u043E\u0434\u0440\u043E\u0431\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0432 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0438.
0A000.C.6=\u041A\u043E\u043C\u0430\u043D\u0434\u0430 DRDA {0} \u0432 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XSDB4.D=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 {0} \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A \u0432\u0435\u0440\u0441\u0438\u0438 {1}; \u0444\u0430\u0439\u043B \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0432\u0435\u0440\u0441\u0438\u044E \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439 {2}; \u043B\u0438\u0431\u043E \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0442 \u0437\u0430\u043F\u0438\u0441\u0438 \u0436\u0443\u0440\u043D\u0430\u043B\u0430 \u0434\u043B\u044F \u0434\u0430\u043D\u043D\u043E\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B, \u043B\u0438\u0431\u043E \u0434\u0430\u043D\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u043D\u0435 \u0431\u044B\u043B\u0430 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C \u0437\u0430\u043F\u0438\u0441\u0430\u043D\u0430 \u043D\u0430 \u0434\u0438\u0441\u043A.
54008=\u041E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 CREATE INDEX \u0437\u0430\u0434\u0430\u0435\u0442 \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043C\u043D\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 (\u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C \u0440\u0430\u0432\u0435\u043D 16).
XSDF0.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0444\u0430\u0439\u043B {0}, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043E\u043D \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
XBM0N.D=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F \u0434\u0440\u0430\u0439\u0432\u0435\u0440\u0430 JDBC \u0432 java.sql.DriverManager \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0430\u0441\u044C \u043D\u0435\u0443\u0434\u0430\u0447\u043D\u043E. \u041F\u043E\u0434\u0440\u043E\u0431\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0432 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0438. 
XSDA5.S=\u041F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u043E\u0442\u043C\u0435\u043D\u0438\u0442\u044C \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u0435 \u0437\u0430\u043F\u0438\u0441\u0438, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043D\u0435 \u0443\u0434\u0430\u043B\u044F\u043B\u0430\u0441\u044C
25505=\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E \u0442\u043E\u043B\u044C\u043A\u043E-\u0434\u043B\u044F-\u0447\u0442\u0435\u043D\u0438\u044F \u0438\u043B\u0438 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0442\u043E\u043B\u044C\u043A\u043E-\u0434\u043B\u044F-\u0447\u0442\u0435\u043D\u0438\u044F \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u043E\u0442\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u0440\u0435\u0436\u0438\u043C  \u0442\u043E\u043B\u044C\u043A\u043E-\u0434\u043B\u044F-\u0447\u0442\u0435\u043D\u0438\u044F \u0434\u043B\u044F \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F.
0A000.S=\u0424\u0443\u043D\u043A\u0446\u0438\u044F \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430\: {0}.
42821=\u0421\u0442\u043E\u043B\u0431\u0446\u044B \u0442\u0438\u043F\u0430 ''{0}'' \u043D\u0435 \u043C\u043E\u0433\u0443\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0442\u0438\u043F\u0430 ''{1}''. 
XJ010.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0442\u043E\u0447\u043A\u0443 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F, \u043A\u043E\u0433\u0434\u0430 \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u0430 \u043E\u043F\u0446\u0438\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u0438\u044F (autoCommit).
42605=\u041D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u043E\u0432 \u0434\u043B\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438 ''{0}''.
XSCG0.S=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0448\u0430\u0431\u043B\u043E\u043D.
42803=\u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435, \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0449\u0435\u0435 \u0441\u0442\u043E\u043B\u0431\u0435\u0446 ''{0}'', \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0441\u043F\u0438\u0441\u043A\u0435 SELECT \u0438 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0447\u0430\u0441\u0442\u044C\u044E \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0438 GROUP BY.
XSCB5.S=\u041F\u0440\u0438 \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u043E\u0442\u043A\u0430\u0442\u0435 \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0438\u043B\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F btree \u043D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043D\u0430\u0439\u0442\u0438 \u0441\u0442\u0440\u043E\u043A\u0443 \u0432 \u0434\u0435\u0440\u0435\u0432\u0435.
28502=\u0418\u043C\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F ''{0}'' \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0435\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u043C. 
XCXB0.S=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u043F\u0443\u0442\u044C \u043A\u043B\u0430\u0441\u0441\u043E\u0432 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445\: ''{0}''.
XJ001.U=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 Java\: ''{1}\: {0}''.
0A000.S.7=\u0422\u0438\u043F \u0434\u0430\u043D\u043D\u044B\u0445 ''{0}'' \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F.
0A000.S.5=\u041C\u0435\u0445\u0430\u043D\u0438\u0437\u043C \u0437\u0430\u0449\u0438\u0442\u044B ''{0}'' \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F.
