#Thu May 16 17:55:33 BRT 2013
42507=Der Benutzer ''{0}'' darf die Operation im Schema ''{1}'' nicht ausf\u00FChren.
XCXC0.S=Ung\u00FCltige ID-Liste.
42ZC1=Nur ein Fenster wird unterst\u00FCtzt.
XJ011.S=Null kann nicht als Name f\u00FCr den Sicherungspunkt \u00FCbergeben werden.
42XA5=Die Routine ''{0}'' gibt unter Umst\u00E4nden SQL-Code aus und kann daher nicht in einer GENERATION CLAUSE enthalten sein.
XJ110.S=Der Name der Prim\u00E4rtabelle muss ungleich null sein.
XSCB6.S=Einschr\u00E4nkung\: Der Datensatz f\u00FCr den Sekund\u00E4rindex einer B-Baumstruktur kann wegen unzureichenden Speicherbereichs auf der Seite nicht aktualisiert oder eingef\u00FCgt werden. Verwenden Sie den Parameter derby.storage.pageSize und/oder derby.storage.pageReservedSpace, um diese Einschr\u00E4nkung zu umgehen.
42903=Ung\u00FCltige Verwendung einer Aggregatfunktion.
42ZA3=Die Tabelle wird den Kollationtyp {0} haben, der sich von der Kollation des Schemas {1} unterscheidet, da dieser Vorgang nicht unterst\u00FCtzt wird.
42831.S.1=''{0}'' kann Nullwerte enthalten und daher keine Spalte eines Prim\u00E4rschl\u00FCssels sein.
42606=Es wurde eine ung\u00FCltige Hexadezimalkonstante gefunden, die mit ''{0}'' beginnt.
58014.C=Der DDM-Befehl 0x{0} wird nicht unterst\u00FCtzt. Die Verbindung wurde beendet.
XBCX1.S=Sie initialisieren das Verschl\u00FCsselungsverfahren mit einem ung\u00FCltigen Modus. Der Modus muss ENCRYPT oder DECRYPT sein.
XJ200.S=Die maximale Anzahl Abschnitte {0} wurde \u00FCberschritten.
XSDG0.D=Die Seite {0} konnte nicht vom Datentr\u00E4ger gelesen werden.
XSDB5.D=Der \u00C4nderungssatz befindet sich auf Seite {0} des Protokolls, die sich au\u00DFerhalb des Containerendes befindet.
42ZB2=F\u00FCr Tabellenfunktionen gibt es nur den Parameterstil DERBY_JDBC_RESULT_SET.
XJ020.S=Der Objekttyp kann nicht in TYPE ''{0}'' konvertiert werden. Der Wert f\u00FCr java.sql.Types ist ung\u00FCltig oder der Objektzeiger ist ein Nullzeiger.
XSDF1.S=Beim Erstellen der Datei {0} f\u00FCr den Container ist eine Ausnahme eingetreten.
XSDA6.S=Die Spalte {0} der Zeile ist gleich null. Sie muss so konfiguriert werden, dass sie auf ein Objekt zeigt.
42831=''{0}'' kann Nullwerte enthalten und daher keine Spalte eines Prim\u00E4rschl\u00FCssels oder eines eindeutigen Schl\u00FCssels sein.
XSCH0.S=Ein Container konnte nicht erstellt werden.
XSAJ0.U=Suchtyp
XIE0P.S=Referenzierte Lob-Datendatei {0} in der Importdatei nicht gefunden.
