#Thu May 16 17:55:33 BRT 2013
42507=El usuario ''{0}'' no puede realizar la operaci\u00F3n en el esquema ''{1}''.
XCXC0.S=Lista de id no v\u00E1lida.
42ZC1=S\u00F3lo se admite una ventana.
XJ011.S=No se puede pasar un valor nulo como nombre de SAVEPOINT.
42XA5=La rutina ''{0}'' puede ejecutar SQL; por lo tanto, no puede aparecer en una cl\u00E1usula de generaci\u00F3n.
XJ110.S=El nombre de tabla primaria no puede ser nulo
XSCB6.S=Limitaci\u00F3n\: no se puede actualizar o insertar el registro de un \u00EDndice secundario btree debido a la falta de espacio en la p\u00E1gina.  Utilice los par\u00E1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00F3n.
42903=Uso no v\u00E1lido de una funci\u00F3n de agregaci\u00F3n.
42ZA3=La tabla tendr\u00E1 el tipo de ordenaci\u00F3n {0}, que es distinta de la del esquema {1}, dado que no se admite esta operaci\u00F3n.
42831.S.1=''{0}'' no puede ser una columna de clave primaria porque puede contener valores nulos.
42606=Se ha detectado una constante hexadecimal no v\u00E1lida que comienza por ''{0}''.
58014.C=El mandato de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
XBCX1.S=Inicializando cifrado con modalidad no permitida, debe ser ENCRYPT o DECRYPT.
XJ200.S=Se ha excedido el n\u00FAmero m\u00E1ximo de secciones {0}
XSDG0.D=No se ha podido leer la p\u00E1gina {0} del disco.
XSDB5.D=Las anotaciones cronol\u00F3gicas tienen un registro de cambio en la p\u00E1gina {0} que est\u00E1 m\u00E1s all\u00E1 del final del contenedor.
42ZB2=Las funciones de tabla s\u00F3lo pueden tener el estilo de par\u00E1metro DERBY_JDBC_RESULT_SET.
XJ020.S=El tipo de objeto no es convertible a TYPE ''{0}'', valor java.sql.Types no v\u00E1lido o el objeto es nulo.
XSDF1.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor
XSDA6.S=La columna {0} de la fila es nula, debe asignarse un valor para que apunte a un objeto.
42831=''{0}'' no puede ser una columna de clave primaria o clave \u00FAnica porque puede contener valores nulos.
XSCH0.S=No se ha podido crear el contenedor.
XSAJ0.U=Tipo de exploraci\u00F3n
XIE0P.S=No se ha encontrado el archivo de datos LOB {0} al que se hace referencia en el archivo de importaci\u00F3n.
