#Thu May 16 17:55:33 BRT 2013
42507=L''utilisateur ''{0}'' ne peut pas ex\u00E9cuter l''op\u00E9ration dans le sch\u00E9ma ''{1}''.
XCXC0.S=Liste d''ID non valide.
42ZC1=Une seule fen\u00EAtre est prise en charge.
XJ011.S=Impossible de transmettre une valeur null comme nom du point de sauvegarde.
42XA5=La routine ''{0}'' peut \u00E9mettre des commandes SQL et ne peut donc pas appara\u00EEtre dans une CLAUSE DE G\u00C9N\u00C9RATION.
XJ110.S=Le nom de la table principale ne peut pas \u00EAtre null
XSCB6.S=Restriction \: L''enregistrement d''un index secondaire btree ne peut pas \u00EAtre mis \u00E0 jour ou ins\u00E9r\u00E9 en raison du manque d''espace sur la page.  Utilisez les param\u00E8tres derby.storage.pageSize et/ou derby.storage.pageReservedSpace pour contourner cette restriction.
42903=Utilisation non valide d''une fonction d''agr\u00E9gat.
42ZA3=La table disposera du type d''interclassement {0}, lequel diff\u00E8re de l''interclassement du sch\u00E9ma {1} ; cette op\u00E9ration n''est donc pas prise en charge.
42831.S.1=''{0}'' ne peut pas \u00EAtre une colonne de cl\u00E9 primaire, car elle peut contenir des valeurs nulles.
42606=Une constante hexad\u00E9cimale non valide commen\u00E7ant par ''{0}'' a \u00E9t\u00E9 d\u00E9tect\u00E9e.
58014.C=La commande du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas prise en charge.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
XBCX1.S=Initialisation du code de chiffrement dans un mode non admis ; ce mode doit \u00EAtre soit ENCRYPT, soit DECRYPT.
XJ200.S=Nombre maximum de sections {0} d\u00E9pass\u00E9
XSDG0.D=Impossible de lire la page {0} \u00E0 partir du disque.
XSDB5.D=Le fichier journal comprend un enregistrement de modification \u00E0 la page {0}, c''est-\u00E0-dire au-del\u00E0 de la fin du conteneur.
42ZB2=Les fonctions de table peuvent uniquement avoir le style de param\u00E8tre DERBY_JDBC_RESULT_SET.
XJ020.S=Le type d''objet n''est pas convertible en TYPE ''{0}'', la valeur java.sql.Types est incorrecte ou l''objet \u00E9tait null.
XSDF1.S=Exception au cours de la cr\u00E9ation du fichier {0} pour le conteneur
XSDA6.S=La colonne {0} de la ligne a la valeur null alors qu''elle doit d\u00E9signer un objet.
42831=''{0}'' ne peut pas \u00EAtre une colonne de cl\u00E9 primaire ou unique car elle peut contenir des valeurs null.
XSCH0.S=Impossible de cr\u00E9er un conteneur.
XSAJ0.U=Type d''analyse
XIE0P.S=Le fichier de donn\u00E9es lob {0} r\u00E9f\u00E9renc\u00E9 dans le fichier d''importation est introuvable.
