#Thu May 16 17:55:33 BRT 2013
42ZC2=La funci\u00F3n de ventana es ilegal en este contexto\: cl\u00E1usula ''{0}''
42XA6=''{0}'' es una columna generada. No puede ser parte de una clave externa cuya acci\u00F3n referencial para DELETE sea SET NULL o SET DEFAULT, o cuya acci\u00F3n referencial para UPDATE sea CASCADE.
58015.C=El objeto de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
XBCX2.S=Inicializando cifrado con una contrase\u00F1a de arranque demasiado corta. La contrase\u00F1a debe tener al menos {0} caracteres de longitud.    
XSDG1.D=La p\u00E1gina {0} no se pudo grabar en el disco, compruebe si el disco est\u00E1 lleno o si se ha alcanzado un l\u00EDmite en el sistema de archivos, como por ejemplo una cuota o un tama\u00F1o m\u00E1ximo de archivo.
XSDB6.D=Es posible que otra instancia de Derby haya iniciado ya la base de datos {0}.
XJ021.S=El tipo no est\u00E1 soportado.
XSDF2.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor, no se pudo eliminar el archivo.  Excepci\u00F3n\: {1}.
XSDA7.S=La restauraci\u00F3n de un objeto serializable o SQLData de clase {0} ha intentado leer m\u00E1s datos que los almacenados originalmente
XBM0P.D=El suministrador de servicio es de s\u00F3lo lectura. Operaci\u00F3n no permitida. 
XSCH1.S=Contenedor {0} no encontrado.
XSAJ1.U=N\u00FAmero de p\u00E1ginas visitadas
XIE0Q.S=El nombre del archivo de datos LOB no puede se nulo. 
42ZB3=XML no se permite como tipo de datos de una columna devuelta por una funci\u00F3n de tabla.
XJ012.S=''{0}'' ya est\u00E1 cerrado.
XJ111.S=El nombre de tabla for\u00E1nea no puede ser nulo
XJ210.S=No se ha encontrado el nombre del m\u00F3dulo de carga para el procedimiento almacenado en el servidor.
XSCB7.S=Se ha producido un error interno durante una exploraci\u00F3n btree - current_rh es nulo \= {0}, clave de posici\u00F3n es nula \= {1}.
XJ030.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n anidada.
XSAI2.S=El conglomerado ({0}) solicitado no existe.
42508=El usuario ''{0}'' no puede crear el esquema ''{1}''. S\u00F3lo el propietario de la base de datos puede emitir esta sentencia.
