#Thu May 16 17:55:33 BRT 2013
42ZC2=La fonction de fen\u00EAtre n''est pas admise dans ce contexte \: clause ''{0}''
42XA6=''{0}'' est une colonne g\u00E9n\u00E9r\u00E9e. Elle ne peut pas faire partie d''une cl\u00E9 externe dont l''action de r\u00E9f\u00E9rentiel pour DELETE est SET NULL ou SET DEFAULT ou dont l''action de r\u00E9f\u00E9rentiel pour UPDATE est CASCADE.
58015.C=L''objet du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas pris en charge.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
XBCX2.S=Initialisation du code de chiffrement avec un mot de passe d''amor\u00E7age trop court. Le mot de passe doit comporter au moins {0}.    
XSDG1.D=La page {0} n''a pas pu \u00EAtre enregistr\u00E9e sur disque ; v\u00E9rifiez que le disque n''est pas satur\u00E9 ou qu''une limite de syst\u00E8me de fichiers, notamment un quota ou une taille maximale de fichier, n''a pas \u00E9t\u00E9 atteinte.
XSDB6.D=Il est possible qu''une autre instance de Derby ait d\u00E9j\u00E0 amorc\u00E9 la base de donn\u00E9es {0}.
XJ021.S=Ce type n''est pas pris en charge.
XSDF2.S=Exception au cours de la cr\u00E9ation du fichier {0} pour le conteneur ; le fichier n''a pas pu \u00EAtre supprim\u00E9.  Exception \: {1}.
XSDA7.S=La restauration d''un objet s\u00E9rialisable ou SQLData de classe {0} a tent\u00E9 de lire plus de donn\u00E9es que la quantit\u00E9 initialement enregistr\u00E9e
XBM0P.D=Le fournisseur de services est en lecture seule. L''op\u00E9ration n''est pas autoris\u00E9e. 
XSCH1.S=Impossible de trouver le conteneur {0}.
XSAJ1.U=Nombre de pages visit\u00E9es.
XIE0Q.S=Le nom du fichier de donn\u00E9es lob ne peut pas \u00EAtre nul. 
42ZB3=XML n''est pas admis comme type de donn\u00E9es d''une colonne renvoy\u00E9e par une fonction de table.
XJ012.S=''{0}'' est d\u00E9j\u00E0 ferm\u00E9.
XJ111.S=Le nom de la table externe ne peut pas \u00EAtre null
XJ210.S=Le nom du module de chargemment pour la proc\u00E9dure m\u00E9moris\u00E9e sur le serveur est introuvable.
XSCB7.S=Une erreur interne a \u00E9t\u00E9 d\u00E9tect\u00E9e au cours d''une analyse - current_rh est null \= {0}, la cl\u00E9 de position est null \= {1}.
XJ030.S=Impossible de d\u00E9finir AUTOCOMMIT sur ON dans une connexion imbriqu\u00E9e.
XSAI2.S=Le conglom\u00E9rat ({0}) demand\u00E9 n''existe pas.
42508=L''utilisateur ''{0}'' ne peut pas cr\u00E9er de sch\u00E9ma ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es a pu \u00E9mettre cette instruction.
