#Thu May 16 17:55:33 BRT 2013
42ZC2=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3067\u306F\u30A6\u30A3\u30F3\u30C9\u30A6\u95A2\u6570\u304C\u4E0D\u6B63\u3067\u3059\: ''{0}'' \u6587\u7BC0
42XA6=''{0}'' \u306F\u751F\u6210\u3055\u308C\u305F\u5217\u3067\u3059\u3002DELETE \u306E\u53C2\u7167\u30A2\u30AF\u30B7\u30E7\u30F3\u304C SET NULL \u307E\u305F\u306F SET DEFAULT \u3067\u3042\u308B\u5916\u90E8\u30AD\u30FC\u3001\u3042\u308B\u3044\u306F UPDATE \u306E\u53C2\u7167\u30A2\u30AF\u30B7\u30E7\u30F3\u304C CASCADE \u3067\u3042\u308B\u5916\u90E8\u30AD\u30FC\u306B\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
58015.C=DDM \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 0x{0} \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002  \u63A5\u7D9A\u306F\u7D42\u4E86\u3055\u308C\u307E\u3057\u305F\u3002
XBCX2.S=\u6697\u53F7\u306E\u521D\u671F\u5316\u306B\u4F7F\u3063\u3066\u3044\u308B\u30D6\u30FC\u30C8\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u77ED\u3059\u304E\u307E\u3059\u3002 \u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u9577\u3055\u306F\u5C11\u306A\u304F\u3068\u3082 {0} \u6587\u5B57\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002    
XSDG1.D=\u30DA\u30FC\u30B8 {0} \u3092\u30C7\u30A3\u30B9\u30AF\u306B\u66F8\u304D\u8FBC\u3081\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30C7\u30A3\u30B9\u30AF\u304C\u3044\u3063\u3071\u3044\u304B\u3069\u3046\u304B\u3001\u307E\u305F\u306F\u5272\u308A\u5F53\u3066\u3084\u6700\u5927\u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u306A\u3069\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u306E\u5236\u9650\u306B\u9054\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
XSDB6.D=Derby \u306E\u5225\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u3059\u3067\u306B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 {0} \u3092\u30D6\u30FC\u30C8\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
XJ021.S=\u578B\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XSDF2.S=\u30B3\u30F3\u30C6\u30CA\u306E\u30D5\u30A1\u30A4\u30EB {0} \u306E\u4F5C\u6210\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u30D5\u30A1\u30A4\u30EB\u3092\u9664\u53BB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002  \u4F8B\u5916\: {1}\u3002
XSDA7.S=\u30AF\u30E9\u30B9 {0} \u306E\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u53EF\u80FD\u307E\u305F\u306F SQLData \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30EA\u30B9\u30C8\u30A2\u3067\u3001\u6700\u521D\u306B\u4FDD\u7BA1\u3055\u308C\u305F\u30C7\u30FC\u30BF\u3088\u308A\u3082\u591A\u304F\u306E\u30C7\u30FC\u30BF\u306E\u8AAD\u307F\u53D6\u308A\u304C\u8A66\u884C\u3055\u308C\u307E\u3057\u305F
XBM0P.D=\u30B5\u30FC\u30D3\u30B9\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3059\u3002 \u30AA\u30DA\u30EC\u30FC\u30B7\u30E7\u30F3\u304C\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 
XSCH1.S=\u30B3\u30F3\u30C6\u30CA\u30FC {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
XSAJ1.U=\u8A2A\u554F\u3057\u305F\u30DA\u30FC\u30B8\u6570
XIE0Q.S=LOB \u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u540D\u3092 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002  
42ZB3=XML \u306F\u3001\u8868\u6A5F\u80FD\u306B\u3088\u3063\u3066\u8FD4\u3055\u308C\u305F\u5217\u306E\u30C7\u30FC\u30BF\u578B\u3068\u3057\u3066\u306F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
XJ012.S=''{0}'' \u306F\u3059\u3067\u306B\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u3066\u3044\u307E\u3059\u3002
XJ111.S=\u5916\u90E8\u8868\u540D\u3092 NULL \u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
XJ210.S=\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u30B9\u30C8\u30A2\u30FC\u30C9\u30FB\u30D7\u30ED\u30B7\u30FC\u30B8\u30E3\u30FC\u306E\u30ED\u30FC\u30C9\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u3092\u691C\u51FA\u3067\u304D\u307E\u305B\u3093\u3002
XSCB7.S=btree \u306E\u30B9\u30AD\u30E3\u30F3\u4E2D\u306B\u5185\u90E8\u30A8\u30E9\u30FC\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002current_rh \u306F NULL \= {0}\u3002\u4F4D\u7F6E\u30AD\u30FC\u306F NULL \= {1}\u3002
XJ030.S=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u63A5\u7D9A\u3067\u306F\u3001\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u3092\u30AA\u30F3\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
XSAI2.S=\u8981\u6C42\u3055\u308C\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304A\u3088\u3073\u95A2\u9023\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8 ({0}) \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
42508=\u30E6\u30FC\u30B6\u30FC ''{0}'' \u306F\u3001\u30B9\u30AD\u30FC\u30DE ''{1}'' \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002 \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u6240\u6709\u8005\u306E\u307F\u304C\u3053\u306E\u6587\u3092\u5B9F\u884C\u3067\u304D\u307E\u3059\u3002
