#Thu May 16 17:55:33 BRT 2013
42ZC2=Window \uD568\uC218\uAC00 \uC774 \uCEE8\uD14D\uC2A4\uD2B8 ''{0}'' \uC808\uC5D0\uC11C \uC798\uBABB\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
42XA6=''{0}''\uC740(\uB294) \uC0DD\uC131\uB41C \uC5F4\uC785\uB2C8\uB2E4. DELETE\uC5D0 \uB300\uD55C \uCC38\uC870 \uC791\uC5C5\uC774 SET NULL \uB610\uB294 SET DEFAULT\uC774\uAC70\uB098 UPDATE\uC5D0 \uB300\uD55C \uCC38\uC870 \uC791\uC5C5\uC774 CASCADE\uC778 \uC678\uB798 \uD0A4\uC758 \uC77C\uBD80\uC77C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
58015.C=DDM \uC624\uBE0C\uC81D\uD2B8 0x{0}\uC774(\uAC00) \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uC5F0\uACB0\uC774 \uC885\uB8CC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
XBCX2.S=\uB108\uBB34 \uC9E7\uC740 \uBD80\uD305 \uC554\uD638\uB85C \uC554\uD638 \uCD08\uAE30\uD654 \uC911. \uC554\uD638\uC758 \uAE38\uC774\uB294 \uCD5C\uC18C\uD55C {0}\uC790\uC5EC\uC57C \uD569\uB2C8\uB2E4. 
XSDG1.D={0} \uD398\uC774\uC9C0\uB97C \uB514\uC2A4\uD06C\uC5D0 \uC4F8 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uB514\uC2A4\uD06C\uAC00 \uAF49 \uCC3C\uAC70\uB098 \uD560\uB2F9\uB7C9 \uB610\uB294 \uCD5C\uB300 \uD30C\uC77C \uD06C\uAE30\uC640 \uAC19\uC740 \uD30C\uC77C \uC2DC\uC2A4\uD15C \uC81C\uD55C\uC5D0 \uB3C4\uB2EC\uD588\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
XSDB6.D=\uB2E4\uB978 Derby \uC778\uC2A4\uD134\uC2A4\uAC00 \uC774\uBBF8 {0} \uB370\uC774\uD130\uBCA0\uC774\uC2A4\uB97C \uBD80\uD305\uD588\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
XJ021.S=\uC720\uD615\uC774 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
XSDF2.S=\uCEE8\uD14C\uC774\uB108\uC5D0 \uB300\uD55C {0} \uD30C\uC77C \uC791\uC131 \uC911 \uC608\uC678 \uBC1C\uC0DD. \uD30C\uC77C\uC744 \uC81C\uAC70\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uC608\uC678\: {1}.
XSDA7.S=\uD074\uB798\uC2A4 {0}\uC758 \uC5F0\uC18D \uAC00\uB2A5 \uB610\uB294 SQLData \uC624\uBE0C\uC81D\uD2B8 \uBCF5\uC6D0. \uCC98\uC74C\uC5D0 \uC800\uC7A5\uB41C \uAC83\uBCF4\uB2E4 \uB9CE\uC740 \uB370\uC774\uD130\uB97C \uC77D\uC73C\uB824\uACE0 \uC2DC\uB3C4\uD588\uC2B5\uB2C8\uB2E4.
XBM0P.D=\uC11C\uBE44\uC2A4 \uC81C\uACF5\uC790\uB294 \uC77D\uAE30 \uC804\uC6A9\uC785\uB2C8\uB2E4. \uC870\uC791\uC774 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. 
XSCH1.S={0} \uCEE8\uD14C\uC774\uB108\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSAJ1.U=\uBC29\uBB38\uD55C \uD398\uC774\uC9C0 \uC218
XIE0Q.S=Lob \uB370\uC774\uD130 \uD30C\uC77C \uC774\uB984\uC740 NULL\uC77C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. 
42ZB3=XML\uC740 \uD14C\uC774\uBE14 \uD568\uC218\uC5D0\uC11C \uBC18\uD658\uD558\uB294 \uC5F4\uC758 \uB370\uC774\uD130 \uC720\uD615\uC73C\uB85C \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
XJ012.S=''{0}''\uC774(\uAC00) \uC774\uBBF8 \uB2EB\uD600 \uC788\uC2B5\uB2C8\uB2E4.
XJ111.S=\uC678\uBD80 \uD14C\uC774\uBE14 \uC774\uB984\uC740 \uB110\uC774 \uB420 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XJ210.S=\uC11C\uBC84\uC758 \uC2A4\uD1A0\uC5B4\uB4DC \uD504\uB85C\uC2DC\uC800\uC5D0 \uB300\uD55C \uB85C\uB4DC \uBAA8\uB4C8 \uC774\uB984\uC744 \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSCB7.S=btree \uC2A4\uCE94 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4. current_rh\uB294 NULl \= {0}\uC774\uACE0 \uC704\uCE58 \uD0A4\uB294 NULL \= {1}\uC785\uB2C8\uB2E4.
XJ030.S=\uD3EC\uD568\uB41C \uC5F0\uACB0\uC5D0 \uC788\uC744 \uB54C AUTOCOMMIT ON\uC744 \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
XSAI2.S=\uC694\uCCAD\uB41C \uC9D1\uD569({0})\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
42508=''{0}'' \uC0AC\uC6A9\uC790\uB294 ''{1}'' \uC2A4\uD0A4\uB9C8\uB97C \uC791\uC131\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uC18C\uC720\uC790\uB9CC \uC774 \uBA85\uB839\uBB38\uC744 \uC2E4\uD589\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
