#Thu May 16 17:55:33 BRT 2013
XJ210.S=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0438\u043C\u044F \u043C\u043E\u0434\u0443\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0434\u043B\u044F \u0445\u0440\u0430\u043D\u0438\u043C\u043E\u0439 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u044B \u043D\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0435.
XSAJ1.U=\u0427\u0438\u0441\u043B\u043E \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043D\u043D\u044B\u0445 \u0441\u0442\u0440\u0430\u043D\u0438\u0446
XBM0P.D=\u041F\u0440\u043E\u0432\u0430\u0439\u0434\u0435\u0440 \u0441\u043B\u0443\u0436\u0431\u044B \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F. \u041E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0430. 
XSDF2.S=\u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u0438 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0438 \u0444\u0430\u0439\u043B\u0430 {0} \u0434\u043B\u044F \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430; \u0441\u0442\u0435\u0440\u0435\u0442\u044C \u0444\u0430\u0439\u043B \u043D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C.  \u0418\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435\: {1}.
XJ021.S=\u0422\u0438\u043F \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F.
XJ111.S=\u0418\u043C\u044F \u0447\u0443\u0436\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043D\u0443\u043B\u0435\u0432\u044B\u043C
XSDG1.D=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0437\u0430\u043F\u0438\u0441\u0430\u0442\u044C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 {0} \u043D\u0430 \u0434\u0438\u0441\u043A; \u043F\u0440\u043E\u0432\u0435\u0440\u044C\u0442\u0435, \u043D\u0435 \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D \u043B\u0438 \u0434\u0438\u0441\u043A.
XBCX2.S=\u0418\u043D\u0438\u0446\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043A\u043E\u0440\u043E\u0442\u043A\u043E\u0433\u043E \u043F\u0430\u0440\u043E\u043B\u044F \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438. \u041F\u0430\u0440\u043E\u043B\u044C \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0434\u043E\u043B\u0436\u0435\u043D \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 {0} \u0441\u0438\u043C\u0432\u043E\u043B\u0430(\u043E\u0432).    
XSCB7.S=\u041E\u0431\u043D\u0430\u0440\u0443\u0436\u0435\u043D\u0430 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u044F\u044F \u043E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0438 btree - \u043D\u0443\u043B\u0435\u0432\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 current_rh \= {0}, \u043D\u0443\u043B\u0435\u0432\u043E\u0435 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043A\u043B\u044E\u0447\u0430 \= {1}.
58015.C=\u041E\u0431\u044A\u0435\u043A\u0442 DDM 0x{0} \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F.  \u0421\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0440\u0432\u0430\u043D\u043E.
XSCH1.S=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 {0} \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D.
XSDA7.S=\u041F\u0440\u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0443\u0435\u043C\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430 \u0438\u043B\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u0430 SQLData \u043A\u043B\u0430\u0441\u0441\u0430 {0} \u043F\u0440\u0435\u0434\u043F\u0440\u0438\u043D\u044F\u0442\u0430 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435 \u0434\u0430\u043D\u043D\u044B\u0445, \u0447\u0435\u043C \u0431\u044B\u043B\u043E \u0438\u0441\u0445\u043E\u0434\u043D\u043E \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u043E
XSAI2.S=\u0417\u0430\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043A\u043E\u043D\u0433\u043B\u043E\u043C\u0435\u0440\u0430\u0442 {0} \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
XJ012.S=''{0}'' \u0443\u0436\u0435 \u0437\u0430\u043A\u0440\u044B\u0442(\u0430/\u043E).
XJ030.S=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C AUTOCOMMIT ON \u0432\u043E \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u043C \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0438.
XSDB6.D=\u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0434\u0440\u0443\u0433\u043E\u0439 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 Derby \u0443\u0436\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u043B \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445 {0}.
42508=\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C ''{0}'' \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0441\u0445\u0435\u043C\u0443 ''{1}''. \u042D\u0442\u043E\u0442 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 \u043C\u043E\u0436\u0435\u0442 \u0432\u0432\u0435\u0441\u0442\u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u0432\u043B\u0430\u0434\u0435\u043B\u0435\u0446 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445.
