<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>&Uuml;bersicht</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20060127;9521300">
	<META NAME="CHANGED" CONTENT="20060903;20110600">
	<STYLE>
	<!--
		@page { size: 8.5in 11in; margin: 0.79in }
		P { margin-bottom: 0.08in }
		P.western { font-family: "Arial", sans-serif }
	-->
	</STYLE>
</HEAD>
<BODY LANG="en-US" TEXT="#000000" BGCOLOR="#f8e89e" DIR="LTR">
<IMG src="images/aoi.png">
<P ALIGN=LEFT STYLE="margin-bottom: 0in"><FONT SIZE=2><FONT FACE="tahoma"><BR><STRONG><FONT SIZE=5><FONT COLOR="#3300cc">Overview</FONT></FONT></STRONG>
<P CLASS="western" STYLE="margin-bottom: 0in">Art Of Illusion ist ein
Open Source 3D Modeling, animation und Rendering Programm. Es ist komplett in Java geschrieben
was bedeutet das es auf nahezu jedem Betriebssytem lauff&auml;hig ist.
Mit Art of Illusion k&ouml;nnen gerenderte Bilder erstellt werden z.B. in den Formaten
JPEG, PNG und TIFF wie auch Videoanimationen in Quicktime. Es k&ouml;nnen auch Einzelbildern
mit Hilfe eines Videoeditors zu einer Animation verarbeitet werden.</P>
<BR>
<P CLASS="western" STYLE="margin-bottom: 0in">
Modelieren in AOI (Art of Illusion) wird mit Hilfe der integrierten Mesheditoren
durchgef&uuml;hrt. W&auml;hrend normalerweise AOI fast ausschlie&szlig;lich mit Dreiecksnetzen
arbeitet, haben sich in letzter Zeit auch sog. Quads- und Ngons ihren Weg gebahnt.
Insbesondere durch den sog. PolyMeshEditor (PME).</P>
<BR>
<P CLASS="western" STYLE="margin-bottom: 0in">
Texturen und Materialien werden ideal unterst&uuml;tzt mit linearen und prozeduralen,
als auch 2D und 3D Texturen und ebensolchen Materialien.
Es gibt Textur- und Materialeditoren mit z&uuml;gigem visuellem Feedback.
Prozedurale Texturen und Materialine sind mit logischen Elementen die man einfach
miteinander verkn&uuml;pft, sehr schnell erstellt.
Nat&uuml;rlich wird man zu Beginn ein wenig F&uuml;hrung zu sch&auml;tzen wissen die einem sagt, was
man miteinander verbinden  sollte.
</P>
<br>
<P CLASS="western" STYLE="margin-bottom: 0in">
Alle Renderer (Renderengines) in AOI sind Plugins.
Die Standardversion von AOI enth&auml;lt einen Rasterrenderer und den bekannten
(und excellenten) Raytracer.
Weitere Renderer sind erh&auml;ltlich - so z.B. ein Vektorrenderer der auch SVG erstellen kann
und ein Advanced Renderer der direkt auf die Festplatte rendert (RAM sparend) und auch
Bild Komposition unterst&uuml;tzt (Schattenf&auml;nger...)

Alle Renderer k&ouml;nnen Einzelbilder und Animationen erstellen. Der AOI Raytracer
ist zugleich schnell und m&auml;chtig und beweist das Javacode schon lange nicht mehr langsam ist
- sondern vielmehr zu den schnellen Codes geh&ouml;rt wenn man es mit C oder C++ vergleicht.
Der AOI Raytracer ist multi-threaded - so kann er alle Vorz&uuml;ge von Hyperthreading oder z.B. von Duo oder
Quad CPUs nutzen - ein nicht zu untersch&auml;tzender Faktor!
Der Raytracer unterst&uuml;tzt so fortgeschrittene Techniken wie AntiAliasing, Ambient Occlusion,
Monte-Carlo, Photonmapping, Tiefenunsch&auml;rfe (DOF) und Caustics um nur einige zu nennen...</P>
<br>
<P CLASS="western" STYLE="margin-bottom: 0in">
Die AOI Plugin Architektur erlaubt Usern und <SUP>Dritt</SUP>anbietern
neue Funktionalit&auml;ten zu erschaffen ohne den Basiscode &auml;ndern zu m&uuml;ssen.
AOI kommt in der Standardversion mit einem Script und Downloadmanager daher.
Dieser kann mit wenigen klicks sicherstellen, das man immer &uuml;ber alle aktuellen Scripts und Plugins verf&uuml;gt.
Das AOI Script Interface erlaubt Nutzern Aufgaben zu automatisieren, neue Tools zu erschaffen
oder sogar neue Objekttypen ohne Code kompilieren zu m&uuml;ssen.
Scripte werden in einer Java Syntax geschrieben und ausgef&uuml;hrt in einer
Open Source Beanshell Engine (Nur zur Info...).</P>
<br>
<P CLASS="western" STYLE="margin-bottom: 0in">Eine Auswahl von bereits verf&uuml;gbaren Plugins:</P>
<UL>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Ein PolyMesh Plugin
          das Quadnetze unterst&uuml;tzt - vergleichbar mit Wings3D.</P>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Ein Baum- und Pflanzengenerator,
         der ein visuellen, prozeduralen Ansatz verfolgt um repetive und fractale Strukturen
         f&uuml;r B&auml;ume, Pflanzen und mehr erzeugt.</P>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Ein Vektor Renderer,
         der u.a. den Export in Vektorformate wie SVG unterst&uuml;tzt</P>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Verschiedene
         Formatumsetzter (Translater) die Formate wie VRML, STL, XML und OBJ</P>
</UL>
<br>
<P CLASS="western" STYLE="margin-bottom: 0in">Eine Auswahl der verf&uuml;gbaren Scripte:</P>
<UL>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Grunge,
         das Verschmutung und Alterung auf selektierten Fl&auml;chen erzeugt</P>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Text, das erlaubt
         3D Texte zu erstellen</P>
	<LI><P CLASS="western" STYLE="margin-bottom: 0in">Tinsel (Rauschgold), das
         genau solche Rauschgold Objekte erzeugt</P>
</UL>
<br>
<P CLASS="western" STYLE="margin-bottom: 0in">
Au&szlig;erdem ist ein excellentes Handbuch verf&uuml;gbar als Download oder direkt online;
eine Menge Tutorials die Themen wie Erste Schritte (Hourglass) ebenso behandeln wie
komplexes Modelieren und Animationen. Auch Script und Pluginerstellung.
Die AOI Gemeinschaft (Community) benutzt verschiedene Foren um sich auszutauschen,
Hilfe anzubieten und neue Techniken und Ideen zu diskutieren.
Zus&auml;tzlich gibt es ein Wiki, das Neuigkeiten und neue Funktionen fortw&auml;hrend dokumentiert.</P>
</BODY>
</HTML>