ij> AUTOCOMMIT OFF;
ij> -- MODULE DML053

-- SQL Test Suite, V6.0, Interactive SQL, dml053.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0233 Table as multiset of rows - INSERT duplicate VALUES()!
 
-- setup
     INSERT INTO TEMP_S
            VALUES('E1',11,'Deale');
1 row inserted/updated/deleted
ij> -- PASS:0233 If 1 row is inserted?

     INSERT INTO TEMP_S
            VALUES('E1',11,'Deale');
1 row inserted/updated/deleted
ij> -- PASS:0233 If 1 row is inserted?

--O     SELECT COUNT(*)
     SELECT empnum
                FROM TEMP_S
                WHERE EMPNUM='E1' AND GRADE=11 AND CITY='Deale';
EMP&
----
E1  
E1  
ij> -- PASS:0233 If count = 2?

-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0233 <<< END TEST
-- *************************************************////END-OF-MODULE
;
ij> 