ij> AUTOCOMMIT OFF;
ij> -- MODULE DML052

-- SQL Test Suite, V6.0, Interactive SQL, dml052.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0229 Case-sensitive LIKE predicate!

-- setup
     INSERT INTO STAFF
            VALUES('E6','ALICE',11,'Gaithersburg');
1 row inserted/updated/deleted
ij> -- PASS:0229 If 1 row is inserted?

     SELECT EMPNAME
          FROM   STAFF
          WHERE  EMPNAME LIKE 'Ali%';
EMPNAME             
--------------------
Alice               
ij> -- PASS:0229 If 1 row is returned and EMPNAME = 'Alice' (not 'ALICE')?

     SELECT EMPNAME
          FROM   STAFF
          WHERE  EMPNAME LIKE 'ALI%';
EMPNAME             
--------------------
ALICE               
ij> -- PASS:0229 If 1 row is returned and EMPNAME = 'ALICE' (not 'Alice')?

-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0229 <<< END TEST
-- *************************************************////END-OF-MODULE
;
ij> 