ij> AUTOCOMMIT OFF;
ij> -- MODULE DML016

-- SQL Test Suite, V6.0, Interactive SQL, dml016.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION SULLIVAN
   create schema SULLIVAN;
0 rows inserted/updated/deleted
ij> set schema SULLIVAN;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
SULLIVAN1                                                                                                                       
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0064 SELECT USER!

     SELECT USER, PNAME
          FROM HU.PROJ;
1                                                                                                                               |PNAME               
-----------------------------------------------------------------------------------------------------------------------------------------------------
SULLIVAN1                                                                                                                       |MXSS                
SULLIVAN1                                                                                                                       |CALM                
SULLIVAN1                                                                                                                       |SDP                 
SULLIVAN1                                                                                                                       |SDP                 
SULLIVAN1                                                                                                                       |IRM                 
SULLIVAN1                                                                                                                       |PAYR                
ij> -- PASS:0064 If 6 rows are selected and each USER = 'SULLIVAN' ?

-- END TEST >>> 0064 <<< END TEST
-- ***********************************************************

-- NO_TEST:0172 SELECT USER into short variable!
-- Tests Host Variable

-- **********************************************************

-- TEST:0065 SELECT CHAR literal and term with numeric literal!

     SELECT 'USER',PNAME
          FROM HU.PROJ;
1   |PNAME               
-------------------------
USER|MXSS                
USER|CALM                
USER|SDP                 
USER|SDP                 
USER|IRM                 
USER|PAYR                
ij> -- PASS:0065 If 6 rows are selected and first column is value 'USER'?

     SELECT PNUM,'BUDGET IN GRAMS IS ',BUDGET * 5
          FROM HU.PROJ
          WHERE PNUM = 'P1';
PN&|2                  |3                   
--------------------------------------------
P1 |BUDGET IN GRAMS IS |50000               
ij> -- PASS:0065 If values are 'P1', 'BUDGET IN GRAMS IS ', 50000?

-- END TEST >>> 0065 <<< END TEST
-- ************************************************************

-- TEST:0066 SELECT numeric literal!
     SELECT EMPNUM,10
          FROM HU.STAFF
          WHERE GRADE = 10;
EM&|2          
---------------
E2 |10         
ij> -- PASS:0066 If 1 row with values 'E2' and 10?

     SELECT EMPNUM, 10
          FROM HU.STAFF;
EM&|2          
---------------
E1 |10         
E2 |10         
E3 |10         
E4 |10         
E5 |10         
ij> -- PASS:0066 If 5 rows are selected with second value always = 10?
-- PASS:0066 and EMPNUMs are 'E1', 'E2', 'E3', 'E4', 'E5'?

-- END TEST >>> 0066 <<< END TEST
-- *************************************************////END-OF-MODULE
;
ij> 