ij> AUTOCOMMIT OFF;
ij> -- MODULE   XTS760

-- SQL Test Suite, V6.0, Interactive SQL, xts760.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION CTS1
   set schema CTS1;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
CTS1                                                                                                                            
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment
   ROLLBACK WORK;
ij> -- date_time print

-- TEST:7060 MAX of column derived from <set function specification>!

   CREATE VIEW V000V AS
  SELECT DEPTNO, AVG(SALARY) AS AVSAL
--O  FROM CTS1.TABX760 GROUP BY DEPTNO;
  FROM TABX760 GROUP BY DEPTNO;
0 rows inserted/updated/deleted
ij> -- PASS:7060 If view created successfully?

   COMMIT WORK;
ij> SELECT MAX(AVSAL) FROM V000V;
1              
---------------
78000.0000     
ij> -- PASS:7060 If MAX(avsal) is 78000?

   COMMIT WORK;
ij> --O   DROP VIEW V000V CASCADE;
   DROP VIEW V000V ;
0 rows inserted/updated/deleted
ij> -- PASS:7060 If view dropped successfully?

   COMMIT WORK;
ij> -- END TEST >>> 7060 <<< END TEST
-- *********************************************
-- *************************************************////END-OF-MODULE
;
ij> 