<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>Overview</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20060127;9521300">
	<META NAME="CHANGEDBY" CONTENT="le pimousse">
	<META NAME="CHANGED" CONTENT="20061201;23201600">
	<STYLE TYPE="text/css">
	<!--
		@page { size: 21.59cm 27.94cm; margin: 2.01cm }
		P { margin-bottom: 0.2cm; color: #000000 }
		P.western { font-family: "Arial", sans-serif }
	-->
	</STYLE>
</HEAD>
<BODY LANG="en-US" TEXT="#000000" BGCOLOR="#f8e89e" DIR="LTR">
<P CLASS="western"><IMG SRC="images/aoi.png" NAME="Image1" ALIGN=BOTTOM WIDTH=64 HEIGHT=64 BORDER=0>
</P>
<P CLASS="western" ALIGN=LEFT STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="tahoma"><BR><STRONG><FONT SIZE=5><FONT COLOR="#3300cc">Vue
d'ensemble</FONT></FONT></STRONG></FONT></FONT></P>
<P CLASS="western" ALIGN=LEFT STYLE="margin-bottom: 0cm"> 
</P>
<P CLASS="western" STYLE="margin-bottom: 0cm"><FONT FACE="tahoma"><FONT SIZE=2>Art
of Illusion est un programme de cr&eacute;ation d'images et
d'animations de haute qualit&eacute;, toujours photo r&eacute;aliste
(au format .mov ou sous la forme d'une s&eacute;quence de photos qui
peuvent &ecirc;tres unies les unes aux autres &agrave; l'aide d'un
autre logiciel pour cr&eacute;er un fichier de film). Les images sont
produites par pr&eacute;sentation de fichiers de sc&egrave;ne. Ces
fichiers de sc&egrave;ne doivent contenir des objets 3-D, au moins un
&eacute;clairage de fa&ccedil;on &agrave; ce que les objets soient
visibles et au moins un appareil photo, &agrave; partir duquel
l'image sera affich&eacute;e. Les sc&egrave;nes complexes peuvent
contenir plusieurs centaines d'objets et plusieurs &eacute;clairages.
Les fichiers cr&eacute;&eacute;s pour un animation peuvent contenir
plusieurs appareils photo entre lesquels les affichages sont partag&eacute;s
pour cr&eacute;er une s&eacute;quence d'animation int&eacute;ressante.<BR><BR>Les
objets 3-D sont fournis en 4 moutures de base: Primitives, maillages
spline, maillages triangulaires et tubes, chacune d'entre elles &eacute;tant
d&eacute;crite en d&eacute;tails plus loin dans ce manuel. Art of
Illusion propose des &eacute;diteurs tr&egrave;s souples, mais
simples d'utilisation, pour la texture (propri&eacute;t&eacute;s de
surface, comme la couleur, les reliefs, le lustrage, la transparence,
etc.) et les mat&eacute;riaux (propri&eacute;t&eacute;s internes de
simulation du verre, de la fum&eacute;e, etc.)<BR><BR>L'Animation des
objets contenus dans la sc&egrave;ne est r&eacute;alis&eacute;e avec
un syst&egrave;me d'images cl&eacute; qui comprend la prise en charge
de squelettes en utilisant l'animation cin&eacute;matique avant et
arri&egrave;re. Les textures peuvent aussi &ecirc;tre anim&eacute;es.<BR><BR>La
pr&eacute;sentation de la sc&egrave;ne est obtenue par un moteur
raster rapide ou un raytracer de haute qualit&eacute; capable de
produire des images photor&eacute;alistes. Le flou de mouvement, la
profondeur de champ, l'illumination globale et les effets caustiques
sont pris en charge.<BR><BR>De plus, Art of Illusion inclut une
fonction script permettant la cr&eacute;ation de nouveaux types
d'objets et d'outils parmi d'autres possibilit&eacute;s virtuellement
illimit&eacute;es via le langage de script Beanshell. <BR><BR>Un bon
moyen de d&eacute;marrer, &agrave; moins que vous souhaitiez
consulter d'abord la totalit&eacute; du manuel, est de suivre les
didacticiels du site web de Art of Illusion. Le didacticiel
concernant le sablier constitue une excellente introduction &agrave;
l'utilisation du programme. D'autres didacticiels prennent en charge
les d&eacute;tails utiles concernant la texture et les mat&eacute;riaux,
ainsi que les syst&egrave;mes de maillages. </FONT></FONT>
</P>
<P CLASS="western" STYLE="margin-bottom: 0cm"><BR>
</P>
</BODY>
</HTML>